RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
         uint32_t RESERVED6[9];

    __IO uint32_t PAWKEN;                   //PORTA Wakeup Enable
    __IO uint32_t PBWKEN;
    __IO uint32_t PCWKEN;
    __IO uint32_t PDWKEN;
    __IO uint32_t PEWKEN;

         uint32_t RESERVED7[3];

    __IO uint32_t PMWKEN;
    __IO uint32_t PNWKEN;

         uint32_t RESERVED8[2];

    __IO uint32_t PAWKSR;                   //PORTA Wakeup Status，写1清零
    __IO uint32_t PBWKSR;
    __IO uint32_t PCWKSR;
    __IO uint32_t PDWKSR;
    __IO uint32_t PEWKSR;

         uint32_t RESERVED9[3];

    __IO uint32_t PMWKSR;
    __IO uint32_t PNWKSR;

         uint32_t RESERVED10[(0x400-0x154)/4-1];

    __IO uint32_t IOFILT0;                  //IO Filter 0
    __IO uint32_t IOFILT1;

    uint32_t RESERVED11[(0x720-0x404)/4-1];

    __IO uint32_t PRSTEN;                   //外设复位使能，只有当PRSTEN的值为0x55时，才能写PRSTR0、PRSTR1
    __IO uint32_t PRSTR0;
    __IO uint32_t PRSTR1;

    //Analog Control: 0x400AA000
         uint32_t RESERVED12[(0x400AA000-0x40000728)/4-1];

    __IO uint32_t HRCCR;                    //High speed RC Control Register
         uint32_t RESERVED13[3];

    __IO uint32_t BODCR;
    __IO uint32_t BODSR;

    __IO uint32_t ADCCR;

         uint32_t RESERVED14;

    __IO uint32_t XTALCR;
    __IO uint32_t XTALSR;

         uint32_t RESERVED15[6];

    __IO uint32_t PLLCR;
    __IO uint32_t PLLDIV;
         uint32_t RESERVED16;
    __IO uint32_t PLLLOCK;                  //[0] 1 PLL已锁定

    __IO uint32_t LRCCR;                    //Low speed RC Control Register

         uint32_t RESERVED17[7];

    __IO uint32_t OPACR;                    //OPA Control Register

         uint32_t RESERVED18[3];

    __IO uint32_t ACMPCR;                   //Analog Comparator Control Register
    __IO uint32_t ACMPSR;                   //Analog Comparator Status Register
    __IO uint32_t ACMPCR2;

         uint32_t RESERVED19;

    __IO uint32_t DACCR;

         uint32_t RESERVED20;

    __IO uint32_t TEMPCR;                   //Temperature Sensor
} SYS_TypeDef;


#define SYS_CLKSEL_SYS_Pos          0       //系统时钟选择    1 HRC   0 CLK_DIVx
#define SYS_CLKSEL_SYS_Msk          (0x01 << SYS_CLKSEL_SYS_Pos)
#define SYS_CLKSEL_CLK_DIVx_Pos     1       //选择CLK_DIVx  0 CLK_DIV1   1 CLK_DIV8
#define SYS_CLKSEL_CLK_DIVx_Msk     (0x01 << SYS_CLKSEL_CLK_DIVx_Pos)
#define SYS_CLKSEL_CLK_Pos          2       //Clock Source  0 LRC   1 PLL   2 XTAL_32K   3 XTAL   4 HRC
#define SYS_CLKSEL_CLK_Msk          (0x07 << SYS_CLKSEL_CLK_Pos)
#define SYS_CLKSEL_RTC_Pos          5       //RTC时钟源选择  0 LRC   1 XTAL_32K
#define SYS_CLKSEL_RTC_Msk          (0x01 << SYS_CLKSEL_RTC_Pos)
#define SYS_CLKSEL_IOFILT_Pos       6       //IO Filter时钟选择，0 HRC   2 XTAL   3 LRC
#define SYS_CLKSEL_IOFILT_Msk       (0x03 << SYS_CLKSEL_IOFILT_Pos)
#define SYS_CLKSEL_SDIO_Pos         10      //SDIO时钟选择，0 SYSCLK/2   1 SYSCLK/8   2 SYSCLK/4   3 SYSCLK
#define SYS_CLKSEL_SDIO_Msk         (0x03 << SYS_CLKSEL_SDIO_Pos)
#define SYS_CLKSEL_WDT_Pos          12      //看门狗时钟选择  0 HRC   1 XTAL   2 LRC   3 XTAL_32K
#define SYS_CLKSEL_WDT_Msk          (0x03 << SYS_CLKSEL_WDT_Pos)
#define SYS_CLKSEL_RTCTRIM_Pos      14      //RTC Trim参考时钟  0 XTAL   1 XTAL/2   2 XTAL/4   3 XTAL/8
#define SYS_CLKSEL_RTCTRIM_Msk      (0x03 << SYS_CLKSEL_RTCTRIM_Pos)
#define SYS_CLKSEL_AD0_Pos          16      //ADC0时钟选择  0 HRC   1 XTAL   2 PLL
#define SYS_CLKSEL_AD0_Msk          (0x03 << SYS_CLKSEL_AD0_Pos)
#define SYS_CLKSEL_AD0DIV_Pos       18      //ADC0时钟分频  0 1分频   1 1分频   2 4分频   3 8分频
#define SYS_CLKSEL_AD0DIV_Msk       (0x03 << SYS_CLKSEL_AD0DIV_Pos)
#define SYS_CLKSEL_AD1_Pos          20
#define SYS_CLKSEL_AD1_Msk          (0x03 << SYS_CLKSEL_AD1_Pos)
#define SYS_CLKSEL_AD1DIV_Pos       22
#define SYS_CLKSEL_AD1DIV_Msk       (0x03 << SYS_CLKSEL_AD1DIV_Pos)
#define SYS_CLKSEL_SLEEP_Pos        24      //休眠时钟源  0 LRC   1 XTAL_32K
#define SYS_CLKSEL_SLEEP_Msk        (0x01 << SYS_CLKSEL_SLEEP_Pos)

#define SYS_CLKDIV_ON_Pos           0
#define SYS_CLKDIV_ON_Msk           (0x01 << SYS_CLKDIV_ON_Pos)

#define SYS_CLKEN0_GPIOA_Pos        0
#define SYS_CLKEN0_GPIOA_Msk        (0x01 << SYS_CLKEN0_GPIOA_Pos)
#define SYS_CLKEN0_GPIOB_Pos        1
#define SYS_CLKEN0_GPIOB_Msk        (0x01 << SYS_CLKEN0_GPIOB_Pos)
#define SYS_CLKEN0_GPIOC_Pos        2
#define SYS_CLKEN0_GPIOC_Msk        (0x01 << SYS_CLKEN0_GPIOC_Pos)
#define SYS_CLKEN0_GPIOD_Pos        3
#define SYS_CLKEN0_GPIOD_Msk        (0x01 << SYS_CLKEN0_GPIOD_Pos)
#define SYS_CLKEN0_GPIOM_Pos        4
#define SYS_CLKEN0_GPIOM_Msk        (0x01 << SYS_CLKEN0_GPIOM_Pos)
#define SYS_CLKEN0_GPION_Pos        5
#define SYS_CLKEN0_GPION_Msk        (0x01 << SYS_CLKEN0_GPION_Pos)
#define SYS_CLKEN0_UART0_Pos        6
#define SYS_CLKEN0_UART0_Msk        (0x01 << SYS_CLKEN0_UART0_Pos)
#define SYS_CLKEN0_UART1_Pos        7
#define SYS_CLKEN0_UART1_Msk        (0x01 << SYS_CLKEN0_UART1_Pos)
#define SYS_CLKEN0_UART2_Pos        8
#define SYS_CLKEN0_UART2_Msk        (0x01 << SYS_CLKEN0_UART2_Pos)
#define SYS_CLKEN0_UART3_Pos        9
#define SYS_CLKEN0_UART3_Msk        (0x01 << SYS_CLKEN0_UART3_Pos)
#define SYS_CLKEN0_WDT_Pos          10
#define SYS_CLKEN0_WDT_Msk          (0x01 << SYS_CLKEN0_WDT_Pos)
#define SYS_CLKEN0_TIMR_Pos         11
#define SYS_CLKEN0_TIMR_Msk         (0x01 << SYS_CLKEN0_TIMR_Pos)
#define SYS_CLKEN0_PWM_Pos          12
#define SYS_CLKEN0_PWM_Msk          (0x01 << SYS_CLKEN0_PWM_Pos)
#define SYS_CLKEN0_SPI0_Pos         13
#define SYS_CLKEN0_SPI0_Msk         (0x01 << SYS_CLKEN0_SPI0_Pos)
#define SYS_CLKEN0_SPI1_Pos         14
#define SYS_CLKEN0_SPI1_Msk         (0x01 << SYS_CLKEN0_SPI1_Pos)
#define SYS_CLKEN0_I2C0_Pos         15
#define SYS_CLKEN0_I2C0_Msk         (0x01 << SYS_CLKEN0_I2C0_Pos)
#define SYS_CLKEN0_I2C1_Pos         16
#define SYS_CLKEN0_I2C1_Msk         (0x01 << SYS_CLKEN0_I2C1_Pos)
#define SYS_CLKEN0_CRC_Pos          19
#define SYS_CLKEN0_CRC_Msk          (0x01 << SYS_CLKEN0_CRC_Pos)
#define SYS_CLKEN0_CORDIC_Pos       20
#define SYS_CLKEN0_CORDIC_Msk       (0x01 << SYS_CLKEN0_CORDIC_Pos)
#define SYS_CLKEN0_DIV_Pos          21
#define SYS_CLKEN0_DIV_Msk          (0x01 << SYS_CLKEN0_DIV_Pos)
#define SYS_CLKEN0_SDIO_Pos         22
#define SYS_CLKEN0_SDIO_Msk         (0x01 << SYS_CLKEN0_SDIO_Pos)
#define SYS_CLKEN0_USB_Pos          24
#define SYS_CLKEN0_USB_Msk          (0x01 << SYS_CLKEN0_USB_Pos)
#define SYS_CLKEN0_ANAC_Pos         25      //模拟控制单元时钟使能
#define SYS_CLKEN0_ANAC_Msk         (0x01 << SYS_CLKEN0_ANAC_Pos)
#define SYS_CLKEN0_ADC0_Pos         26
#define SYS_CLKEN0_ADC0_Msk         (0x01 << SYS_CLKEN0_ADC0_Pos)
#define SYS_CLKEN0_CAN0_Pos         28
#define SYS_CLKEN0_CAN0_Msk         (0x01 << SYS_CLKEN0_CAN0_Pos)
#define SYS_CLKEN0_DMA2D_Pos        29
#define SYS_CLKEN0_DMA2D_Msk        (0x01 << SYS_CLKEN0_DMA2D_Pos)
#define SYS_CLKEN0_LCD_Pos          30
#define SYS_CLKEN0_LCD_Msk          (0x01 << SYS_CLKEN0_LCD_Pos)

#define SYS_CLKEN1_GPIOE_Pos        0
#define SYS_CLKEN1_GPIOE_Msk        (0x01 << SYS_CLKEN1_GPIOE_Pos)
#define SYS_CLKEN1_SPI2_Pos         8
#define SYS_CLKEN1_SPI2_Msk         (0x01 << SYS_CLKEN1_SPI2_Pos)
#define SYS_CLKEN1_SDRAM_Pos        12
#define SYS_CLKEN1_SDRAM_Msk        (0x01 << SYS_CLKEN1_SDRAM_Pos)
#define SYS_CLKEN1_SFC_Pos          13
#define SYS_CLKEN1_SFC_Msk          (0x01 << SYS_CLKEN1_SFC_Pos)
#define SYS_CLKEN1_ADC1_Pos         16
#define SYS_CLKEN1_ADC1_Msk         (0x01 << SYS_CLKEN1_ADC1_Pos)
#define SYS_CLKEN1_CAN1_Pos         17
#define SYS_CLKEN1_CAN1_Msk         (0x01 << SYS_CLKEN1_CAN1_Pos)
#define SYS_CLKEN1_RTC_Pos          19
#define SYS_CLKEN1_RTC_Msk          (0x01 << SYS_CLKEN1_RTC_Pos)
#define SYS_CLKEN1_IOFILT_Pos       20      //IO Filter
#define SYS_CLKEN1_IOFILT_Msk       (0x01 << SYS_CLKEN1_IOFILT_Pos)
#define SYS_CLKEN1_BTIMR_Pos        22
#define SYS_CLKEN1_BTIMR_Msk        (0x01 << SYS_CLKEN1_BTIMR_Pos)
#define SYS_CLKEN1_JPEG_Pos         25
#define SYS_CLKEN1_JPEG_Msk         (0x01 << SYS_CLKEN1_JPEG_Pos)
#define SYS_CLKEN1_DAC_Pos          26
#define SYS_CLKEN1_DAC_Msk          (0x01 << SYS_CLKEN1_DAC_Pos)
#define SYS_CLKEN1_QEI_Pos          27
#define SYS_CLKEN1_QEI_Msk          (0x01 << SYS_CLKEN1_QEI_Pos)

#define SYS_SLEEP_SLEEP_Pos         0       //将该位置1后，系统将进入SLEEP模式
#define SYS_SLEEP_SLEEP_Msk         (0x01 << SYS_SLEEP_SLEEP_Pos)
#define SYS_SLEEP_STOP_Pos          1       //将该位置1后，系统将进入STOP SLEEP模式
#define SYS_SLEEP_STOP_Msk          (0x01 << SYS_SLEEP_STOP_Pos)

