RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define SYS_RSTSR_POR_Pos           0       //1 出现过POR复位，写1清零
#define SYS_RSTSR_POR_Msk           (0x01 << SYS_RSTSR_POR_Pos)
#define SYS_RSTSR_WDT_Pos           1       //1 出现过WDT复位，写1清零
#define SYS_RSTSR_WDT_Msk           (0x01 << SYS_RSTSR_WDT_Pos)

#define SYS_RTCWKCR_EN_Pos          0       //RTC唤醒使能
#define SYS_RTCWKCR_EN_Msk          (0x01 << SYS_RTCWKCR_EN_Pos)

#define SYS_RTCWKSR_FLAG_Pos        0       //RTC唤醒标志，写1清零
#define SYS_RTCWKSR_FLAG_Msk        (0x01 << SYS_RTCWKSR_FLAG_Pos)

#define SYS_USBPHYCR_IDEN_Pos       0       //ID PIN采样使能
#define SYS_USBPHYCR_IDEN_Msk       (0x01 << SYS_USBPHYCR_IDEN_Pos)
#define SYS_USBPHYCR_OPMODE_Pos     1       //0 Normal Operation   1 Non-Driving (Disable Pull-up register)
#define SYS_USBPHYCR_OPMODE_Msk     (0x03 << SYS_USBPHYCR_OPMODE_Pos)
#define SYS_USBPHYCR_XCVR_Pos       4       //收发器模式选择，1 FS   2 LS
#define SYS_USBPHYCR_XCVR_Msk       (0x03 << SYS_USBPHYCR_XCVR_Pos)
#define SYS_USBPHYCR_PLLEN_Pos      7       //PHY内置PLL开关
#define SYS_USBPHYCR_PLLEN_Msk      (0x01 << SYS_USBPHYCR_PLLEN_Pos)

#define SYS_USBCR_RST48M_Pos        0       //USB控制器48M时钟域复位
#define SYS_USBCR_RST48M_Msk        (0x01 << SYS_USBCR_RST48M_Pos)
#define SYS_USBCR_RST12M_Pos        1       //USB控制器12M时钟域复位
#define SYS_USBCR_RST12M_Msk        (0x01 << SYS_USBCR_RST12M_Pos)
#define SYS_USBCR_RSTPLL_Pos        2       //USB控制器PLL时钟域复位
#define SYS_USBCR_RSTPLL_Msk        (0x01 << SYS_USBCR_RSTPLL_Pos)
#define SYS_USBCR_ROLE_Pos          3       //0 由ID引脚决定   2 Host   3 Device
#define SYS_USBCR_ROLE_Msk          (0x03 << SYS_USBCR_ROLE_Pos)
#define SYS_USBCR_VBUS_Pos          5       //0 由VBUS引脚决定   1 强制为高
#define SYS_USBCR_VBUS_Msk          (0x01 << SYS_USBCR_VBUS_Pos)

#define SYS_PRNGCR_CLR_Pos          0       //种子清零，至少保持一个LRC时钟周期
#define SYS_PRNGCR_CLR_Msk          (0x01 << SYS_PRNGCR_CLR_Pos)
#define SYS_PRNGCR_MODE_Pos         1       //0 关闭   2 三时钟模式（RCHF、RCLF、XTAH）   3 两时钟模式（RCHF、RCLF）
#define SYS_PRNGCR_MODE_Msk         (0x03 << SYS_PRNGCR_MODE_Pos)
#define SYS_PRNGCR_RDY_Pos          8       //1 可以从PRNGDL和PRNGDH读取数据
#define SYS_PRNGCR_RDY_Msk          (0x01 << SYS_PRNGCR_RDY_Pos)

#define SYS_IOFILT_TIM_Pos          0       //滤波窗口时间 = Tfilter_clk * 时钟分频 * 2^TIM
#define SYS_IOFILT_TIM_Msk          (0x0F << SYS_IOFILT_TIM_Pos)
#define SYS_IOFILT_CLKDIV_Pos       4       //0 时钟不分频   1 时钟32分频
#define SYS_IOFILT_CLKDIV_Msk       (0x01 << SYS_IOFILT_CLKDIV_Pos)
#define SYS_IOFILT_IOSEL_Pos        5       //被滤波IO选择，每个IOFILT可为四个IO中的一个进行滤波
#define SYS_IOFILT_IOSEL_Msk        (0x03 << SYS_IOFILT_IOSEL_Pos)

#define SYS_PRSTR0_GPIOA_Pos        0       //1 复位GPIOA    0 不复位
#define SYS_PRSTR0_GPIOA_Msk        (0x01 << SYS_PRSTR0_GPIOA_Pos)
#define SYS_PRSTR0_GPIOB_Pos        1
#define SYS_PRSTR0_GPIOB_Msk        (0x01 << SYS_PRSTR0_GPIOB_Pos)
#define SYS_PRSTR0_GPIOC_Pos        2
#define SYS_PRSTR0_GPIOC_Msk        (0x01 << SYS_PRSTR0_GPIOC_Pos)
#define SYS_PRSTR0_GPIOD_Pos        3
#define SYS_PRSTR0_GPIOD_Msk        (0x01 << SYS_PRSTR0_GPIOD_Pos)
#define SYS_PRSTR0_GPIOM_Pos        4
#define SYS_PRSTR0_GPIOM_Msk        (0x01 << SYS_PRSTR0_GPIOM_Pos)
#define SYS_PRSTR0_GPION_Pos        5
#define SYS_PRSTR0_GPION_Msk        (0x01 << SYS_PRSTR0_GPION_Pos)
#define SYS_PRSTR0_UART0_Pos        6
#define SYS_PRSTR0_UART0_Msk        (0x01 << SYS_PRSTR0_UART0_Pos)
#define SYS_PRSTR0_UART1_Pos        7
#define SYS_PRSTR0_UART1_Msk        (0x01 << SYS_PRSTR0_UART1_Pos)
#define SYS_PRSTR0_UART2_Pos        8
#define SYS_PRSTR0_UART2_Msk        (0x01 << SYS_PRSTR0_UART2_Pos)
#define SYS_PRSTR0_UART3_Pos        9
#define SYS_PRSTR0_UART3_Msk        (0x01 << SYS_PRSTR0_UART3_Pos)
#define SYS_PRSTR0_WDT_Pos          10
#define SYS_PRSTR0_WDT_Msk          (0x01 << SYS_PRSTR0_WDT_Pos)
#define SYS_PRSTR0_TIMR_Pos         11
#define SYS_PRSTR0_TIMR_Msk         (0x01 << SYS_PRSTR0_TIMR_Pos)
#define SYS_PRSTR0_PWM_Pos          12
#define SYS_PRSTR0_PWM_Msk          (0x01 << SYS_PRSTR0_PWM_Pos)
#define SYS_PRSTR0_SPI0_Pos         13
#define SYS_PRSTR0_SPI0_Msk         (0x01 << SYS_PRSTR0_SPI0_Pos)
#define SYS_PRSTR0_SPI1_Pos         14
#define SYS_PRSTR0_SPI1_Msk         (0x01 << SYS_PRSTR0_SPI1_Pos)
#define SYS_PRSTR0_I2C0_Pos         15
#define SYS_PRSTR0_I2C0_Msk         (0x01 << SYS_PRSTR0_I2C0_Pos)
#define SYS_PRSTR0_I2C1_Pos         16
#define SYS_PRSTR0_I2C1_Msk         (0x01 << SYS_PRSTR0_I2C1_Pos)
#define SYS_PRSTR0_CRC_Pos          19
#define SYS_PRSTR0_CRC_Msk          (0x01 << SYS_PRSTR0_CRC_Pos)
#define SYS_PRSTR0_CORDIC_Pos       20
#define SYS_PRSTR0_CORDIC_Msk       (0x01 << SYS_PRSTR0_CORDIC_Pos)
#define SYS_PRSTR0_DIV_Pos          21
#define SYS_PRSTR0_DIV_Msk          (0x01 << SYS_PRSTR0_DIV_Pos)
#define SYS_PRSTR0_SDIO_Pos         22
#define SYS_PRSTR0_SDIO_Msk         (0x01 << SYS_PRSTR0_SDIO_Pos)
#define SYS_PRSTR0_USB_Pos          24
#define SYS_PRSTR0_USB_Msk          (0x01 << SYS_PRSTR0_USB_Pos)
#define SYS_PRSTR0_ANAC_Pos         25
#define SYS_PRSTR0_ANAC_Msk         (0x01 << SYS_PRSTR0_ANAC_Pos)
#define SYS_PRSTR0_ADC0_Pos         26
#define SYS_PRSTR0_ADC0_Msk         (0x01 << SYS_PRSTR0_ADC0_Pos)
#define SYS_PRSTR0_CAN0_Pos         28
#define SYS_PRSTR0_CAN0_Msk         (0x01 << SYS_PRSTR0_CAN0_Pos)
#define SYS_PRSTR0_DMA2D_Pos        29
#define SYS_PRSTR0_DMA2D_Msk        (0x01 << SYS_PRSTR0_DMA2D_Pos)
#define SYS_PRSTR0_LCD_Pos          30
#define SYS_PRSTR0_LCD_Msk          (0x01 << SYS_PRSTR0_LCD_Pos)

#define SYS_PRSTR1_GPIOE_Pos        0
#define SYS_PRSTR1_GPIOE_Msk        (0x01 << SYS_PRSTR1_GPIOE_Pos)
#define SYS_PRSTR1_SPI2_Pos         8
#define SYS_PRSTR1_SPI2_Msk         (0x01 << SYS_PRSTR1_SPI2_Pos)
#define SYS_PRSTR1_SDRAM_Pos        12
#define SYS_PRSTR1_SDRAM_Msk        (0x01 << SYS_PRSTR1_SDRAM_Pos)
#define SYS_PRSTR1_ADC1_Pos         16
#define SYS_PRSTR1_ADC1_Msk         (0x01 << SYS_PRSTR1_ADC1_Pos)
#define SYS_PRSTR1_RTC_Pos          19
#define SYS_PRSTR1_RTC_Msk          (0x01 << SYS_PRSTR1_RTC_Pos)
#define SYS_PRSTR1_IOFILT_Pos       20
#define SYS_PRSTR1_IOFILT_Msk       (0x01 << SYS_PRSTR1_IOFILT_Pos)
#define SYS_PRSTR1_BTIMR_Pos        22
#define SYS_PRSTR1_BTIMR_Msk        (0x01 << SYS_PRSTR1_BTIMR_Pos)
#define SYS_PRSTR1_JPEG_Pos         25
#define SYS_PRSTR1_JPEG_Msk         (0x01 << SYS_PRSTR1_JPEG_Pos)

#define SYS_HRCCR_ON_Pos            0       //High speed RC ON
#define SYS_HRCCR_ON_Msk            (0x01 << SYS_HRCCR_ON_Pos)
#define SYS_HRCCR_DBL_Pos           1       //Double Frequency  0 20MHz   1 40MHz
#define SYS_HRCCR_DBL_Msk           (0x01 << SYS_HRCCR_DBL_Pos)

