RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define SYS_BODCR_IE_Pos            1       //Interrupt Enable
#define SYS_BODCR_IE_Msk            (0x01 << SYS_BODCR_IE_Pos)
#define SYS_BODCR_INTLVL_Pos        4       //BOD中断触发电平，0 1.9v   1 2.1v   2 2.3v   3 2.5v   4 2.7v
#define SYS_BODCR_INTLVL_Msk        (0x07 << SYS_BODCR_INTLVL_Pos)
#define SYS_BODCR_RSTLVL_Pos        7       //BOD复位电平，0 1.7v   1 1.9v   2 2.1v   3 2.7v
#define SYS_BODCR_RSTLVL_Msk        (0x07 << SYS_BODCR_RSTLVL_Pos)

#define SYS_BODSR_IF_Pos            0       //中断标志，写1清零
#define SYS_BODSR_IF_Msk            (0x01 << SYS_BODSR_IF_Pos)
#define SYS_BODSR_ST_Pos            1       //BOD Status
#define SYS_BODSR_ST_Msk            (0x01 << SYS_BODSR_ST_Pos)

#define SYS_ADCCR_0IVREN_Pos        0       //ADC0 Internal Vref Enable
#define SYS_ADCCR_0IVREN_Msk        (0x01 << SYS_ADCCR_0IVREN_Pos)
#define SYS_ADCCR_1IVREN_Pos        1       //ADC1 Internal Vref Enable
#define SYS_ADCCR_1IVREN_Msk        (0x01 << SYS_ADCCR_1IVREN_Pos)
#define SYS_ADCCR_0IVRSEL_Pos       2       //ADC0 Internal Vref Select，0 基准电流乘以电阻   1 VDD33电阻分压
#define SYS_ADCCR_0IVRSEL_Msk       (0x01 << SYS_ADCCR_0IVRSEL_Pos)
#define SYS_ADCCR_1IVRSEL_Pos       3       //ADC1 Internal Vref Select，0 基准电流乘以电阻   1 VDD33电阻分压
#define SYS_ADCCR_1IVRSEL_Msk       (0x01 << SYS_ADCCR_1IVRSEL_Pos)
#define SYS_ADCCR_IVRFLT_Pos        4       //Internal Vref Filter，0 高通滤波   1 低通滤波
#define SYS_ADCCR_IVRFLT_Msk        (0x01 << SYS_ADCCR_IVRFLT_Pos)
#define SYS_ADCCR_IVROuA_Pos        5       //Internal Vref Output uA， 0 50uA   1 150uA
#define SYS_ADCCR_IVROuA_Msk        (0x01 << SYS_ADCCR_IVROuA_Pos)
#define SYS_ADCCR_IVRLVL_Pos        6       //Internal Vref Output Level，X00b 1.2V   X01 1.6V   X10 2.0V   X11 2.5V
#define SYS_ADCCR_IVRLVL_Msk        (0x07 << SYS_ADCCR_IVRLVL_Pos)
#define SYS_ADCCR_IVRTRIM_Pos       9       //Internal Vref Output Level Trimming，000 +0V   001 +0.04V   010 +0.8V   011 +0.12V   100 -0.04V   101 -0.08V   110 -0.12V   111 -0.16V
#define SYS_ADCCR_IVRTRIM_Msk       (0x07 << SYS_ADCCR_IVRTRIM_Pos)

#define SYS_XTALCR_32KON_Pos        0       //XTAL_32K On
#define SYS_XTALCR_32KON_Msk        (0x01 << SYS_XTALCR_32KON_Pos)
#define SYS_XTALCR_ON_Pos           1       //XTAL On
#define SYS_XTALCR_ON_Msk           (0x01 << SYS_XTALCR_ON_Pos)
#define SYS_XTALCR_32KDET_Pos       4       //XTAL_32K Stop Detect
#define SYS_XTALCR_32KDET_Msk       (0x01 << SYS_XTALCR_32KDET_Pos)
#define SYS_XTALCR_DET_Pos          5       //XTAL Stop Detect
#define SYS_XTALCR_DET_Msk          (0x01 << SYS_XTALCR_DET_Pos)
#define SYS_XTALCR_32KDRV_Pos       8       //XTAL_32K 驱动能力，可微调频率
#define SYS_XTALCR_32KDRV_Msk       (0x0F << SYS_XTALCR_32KDRV_Pos)
#define SYS_XTALCR_DRV_Pos          16      //XTAL 驱动能力，可微调频率
#define SYS_XTALCR_DRV_Msk          (0x1F << SYS_XTALCR_DRV_Pos)

#define SYS_XTALSR_32KSTOP_Pos      0       //XTAL_32K Stop，写1清零
#define SYS_XTALSR_32KSTOP_Msk      (0x01 << SYS_XTALSR_32KSTOP_Pos)
#define SYS_XTALSR_STOP_Pos         1       //XTAL Stop，写1清零
#define SYS_XTALSR_STOP_Msk         (0x01 << SYS_XTALSR_STOP_Pos)

#define SYS_PLLCR_OUTEN_Pos         0       //只能LOCK后设置
#define SYS_PLLCR_OUTEN_Msk         (0x01 << SYS_PLLCR_OUTEN_Pos)
#define SYS_PLLCR_INSEL_Pos         1       //0 XTAL    1 HRC
#define SYS_PLLCR_INSEL_Msk         (0x01 << SYS_PLLCR_INSEL_Pos)
#define SYS_PLLCR_OFF_Pos           2
#define SYS_PLLCR_OFF_Msk           (0x01 << SYS_PLLCR_OFF_Pos)
#define SYS_PLLCR_RST_Pos           3
#define SYS_PLLCR_RST_Msk           (0x01 << SYS_PLLCR_RST_Pos)

#define SYS_PLLDIV_FBDIV_Pos        0       //PLL FeedBack分频寄存器
                                            //VCO输出频率 = PLL输入时钟 / INDIV * 4 * FBDIV
                                            //PLL输出频率 = PLL输入时钟 / INDIV * 4 * FBDIV / OUTDIV = VCO输出频率 / OUTDIV
#define SYS_PLLDIV_FBDIV_Msk        (0x1FF << SYS_PLLDIV_FBDIV_Pos)
#define SYS_PLLDIV_INDIV_Pos        16      //PLL 输入源时钟分频
#define SYS_PLLDIV_INDIV_Msk        (0x1F << SYS_PLLDIV_INDIV_Pos)
#define SYS_PLLDIV_OUTDIV_Pos       24      //PLL 输出分频，0 8分频    1 4分频    0 2分频
#define SYS_PLLDIV_OUTDIV_Msk       (0x03 << SYS_PLLDIV_OUTDIV_Pos)

#define SYS_LRCCR_ON_Pos            0       //Low Speed RC On
#define SYS_LRCCR_ON_Msk            (0x01 << SYS_LRCCR_ON_Pos)

#define SYS_OPACR_OPA0ON_Pos        0       //OPA0 开启
#define SYS_OPACR_OPA0ON_Msk        (0x01 << SYS_OPACR_OPA0ON_Pos)
#define SYS_OPACR_OPA1ON_Pos        1
#define SYS_OPACR_OPA1ON_Msk        (0x01 << SYS_OPACR_OPA1ON_Pos)
#define SYS_OPACR_OPA2ON_Pos        2
#define SYS_OPACR_OPA2ON_Msk        (0x01 << SYS_OPACR_OPA2ON_Pos)
#define SYS_OPACR_OPA3ON_Pos        3
#define SYS_OPACR_OPA3ON_Msk        (0x01 << SYS_OPACR_OPA3ON_Pos)

#define SYS_ACMPCR_CMP0ON_Pos       0       //CMP0 开启
#define SYS_ACMPCR_CMP0ON_Msk       (0x01 << SYS_ACMPCR_CMP0ON_Pos)
#define SYS_ACMPCR_CMP1ON_Pos       1
#define SYS_ACMPCR_CMP1ON_Msk       (0x01 << SYS_ACMPCR_CMP1ON_Pos)
#define SYS_ACMPCR_CMP2ON_Pos       2
#define SYS_ACMPCR_CMP2ON_Msk       (0x01 << SYS_ACMPCR_CMP2ON_Pos)
#define SYS_ACMPCR_CMP0HYS_Pos      8       //CMP0 迟滞开启
#define SYS_ACMPCR_CMP0HYS_Msk      (0x01 << SYS_ACMPCR_CMP0HYS_Pos)
#define SYS_ACMPCR_CMP1HYS_Pos      9
#define SYS_ACMPCR_CMP1HYS_Msk      (0x01 << SYS_ACMPCR_CMP1HYS_Pos)
#define SYS_ACMPCR_CMP2HYS_Pos      10
#define SYS_ACMPCR_CMP2HYS_Msk      (0x01 << SYS_ACMPCR_CMP2HYS_Pos)
#define SYS_ACMPCR_0NVREF_Pos       16      //1 ACMP0 N输入端接内部VREF
#define SYS_ACMPCR_0NVREF_Msk       (0x01 << SYS_ACMPCR_0NVREF_Pos)
#define SYS_ACMPCR_1NVREF_Pos       17
#define SYS_ACMPCR_1NVREF_Msk       (0x01 << SYS_ACMPCR_1NVREF_Pos)
#define SYS_ACMPCR_2NVREF_Pos       18
#define SYS_ACMPCR_2NVREF_Msk       (0x01 << SYS_ACMPCR_2NVREF_Pos)
#define SYS_ACMPCR_CMP0IE_Pos       24      //CMP0 中断使能
#define SYS_ACMPCR_CMP0IE_Msk       (0x01 << SYS_ACMPCR_CMP0IE_Pos)
#define SYS_ACMPCR_CMP1IE_Pos       25
#define SYS_ACMPCR_CMP1IE_Msk       (0x01 << SYS_ACMPCR_CMP1IE_Pos)
#define SYS_ACMPCR_CMP2IE_Pos       26
#define SYS_ACMPCR_CMP2IE_Msk       (0x01 << SYS_ACMPCR_CMP2IE_Pos)

