RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define SYS_ACMPSR_CMP0OUT_Pos      0       //0 N > P   1 P > N
#define SYS_ACMPSR_CMP0OUT_Msk      (0x01 << SYS_ACMPSR_CMP0OUT_Pos)
#define SYS_ACMPSR_CMP1OUT_Pos      1
#define SYS_ACMPSR_CMP1OUT_Msk      (0x01 << SYS_ACMPSR_CMP1OUT_Pos)
#define SYS_ACMPSR_CMP2OUT_Pos      2
#define SYS_ACMPSR_CMP2OUT_Msk      (0x01 << SYS_ACMPSR_CMP2OUT_Pos)
#define SYS_ACMPSR_CMP0IF_Pos       8       //中断标志，写1清零
#define SYS_ACMPSR_CMP0IF_Msk       (0x01 << SYS_ACMPSR_CMP0IF_Pos)
#define SYS_ACMPSR_CMP1IF_Pos       9
#define SYS_ACMPSR_CMP1IF_Msk       (0x01 << SYS_ACMPSR_CMP1IF_Pos)
#define SYS_ACMPSR_CMP2IF_Pos       10
#define SYS_ACMPSR_CMP2IF_Msk       (0x01 << SYS_ACMPSR_CMP2IF_Pos)

#define SYS_ACMPCR2_HALL0_Pos       0       //1 ACMP0输出连接HALL0输入
#define SYS_ACMPCR2_HALL0_Msk       (0x01 << SYS_ACMPCR2_HALL0_Pos)
#define SYS_ACMPCR2_HALL1_Pos       1
#define SYS_ACMPCR2_HALL1_Msk       (0x01 << SYS_ACMPCR2_HALL1_Pos)
#define SYS_ACMPCR2_HALL2_Pos       2
#define SYS_ACMPCR2_HALL2_Msk       (0x01 << SYS_ACMPCR2_HALL2_Pos)
#define SYS_ACMPCR2_VREF_Pos        3       //ACMP内部基准电压VREF，电压值为 0.6 + 0.04*VREF
#define SYS_ACMPCR2_VREF_Msk        (0x3F << SYS_ACMPCR2_VREF_Pos)

#define SYS_DACCR_VRADJ_Pos         0       //Vref Adjust
#define SYS_DACCR_VRADJ_Msk         (0x1F << SYS_DACCR_VRADJ_Pos)

#define SYS_TEMPCR_EN_Pos           0
#define SYS_TEMPCR_EN_Msk           (0x01 << SYS_TEMPCR_EN_Pos)
#define SYS_TEMPCR_TRIM_Pos         4
#define SYS_TEMPCR_TRIM_Msk         (0x3F << SYS_TEMPCR_TRIM_Pos)
#define SYS_TEMPCR_AD0CH7_Pos       16      //ADC0 CH7通道测量信号选择，0 外部输入   1 温度传感器输出
#define SYS_TEMPCR_AD0CH7_Msk       (0x03 << SYS_TEMPCR_AD0CH7_Pos)




typedef struct {
    __IO uint32_t FUNC0;                    //引脚功能选择

    __IO uint32_t FUNC1;

         uint32_t RESERVED[62];

    __IO uint32_t PULLU;                    //上拉使能

         uint32_t RESERVED2[63];

    __IO uint32_t PULLD;                    //下拉使能

         uint32_t RESERVED3[63];

    __IO uint32_t INEN;                     //输入使能

         uint32_t RESERVED4[63];

    __IO uint32_t OPEND;                    //开漏使能

         uint32_t RESERVED5[63];

    __IO uint32_t DRVST;                    //驱动强度选择，0 4mA   1 8mA
} PORT_TypeDef;




typedef struct {
    __IO uint32_t ODR;
#define PIN0    0
#define PIN1    1
#define PIN2    2
#define PIN3    3
#define PIN4    4
#define PIN5    5
#define PIN6    6
#define PIN7    7
#define PIN8    8
#define PIN9    9
#define PIN10   10
#define PIN11   11
#define PIN12   12
#define PIN13   13
#define PIN14   14
#define PIN15   15

    __IO uint32_t DIR;                      //0 输入  1 输出

    __IO uint32_t INTLVLTRG;                //Interrupt Level Trigger  1 电平触发中断 0 边沿触发中断

    __IO uint32_t INTBE;                    //Both Edge，当INTLVLTRG设为边沿触发中断时，此位置1表示上升沿和下降沿都触发中断，置0时触发边沿由INTRISEEN选择

    __IO uint32_t INTRISEEN;                //Interrupt Rise Edge Enable   1 上升沿/高电平触发中断    0 下降沿/低电平触发中断

    __IO uint32_t INTEN;                    //1 中断使能    0 中断禁止

    __IO uint32_t INTRAWSTAT;               //中断检测单元是否检测到了触发中断的条件 1 检测到了中断触发条件  0 没有检测到中断触发条件

    __IO uint32_t INTSTAT;                  //INTSTAT.PIN0 = INTRAWSTAT.PIN0 & INTEN.PIN0

    __IO uint32_t INTCLR;                   //写1清除中断标志，只对边沿触发中断有用

    __IO uint32_t DMAEN;

         uint32_t RESERVED[2];

    __IO uint32_t IDR;

         uint32_t RESERVED2[3];

    __IO uint32_t DATAPIN0;                 //PIN0引脚的DATA寄存器，单个引脚对应整个32位寄存器，方便实现原子写操作
    __IO uint32_t DATAPIN1;
    __IO uint32_t DATAPIN2;
    __IO uint32_t DATAPIN3;
    __IO uint32_t DATAPIN4;
    __IO uint32_t DATAPIN5;
    __IO uint32_t DATAPIN6;
    __IO uint32_t DATAPIN7;
    __IO uint32_t DATAPIN8;
    __IO uint32_t DATAPIN9;
    __IO uint32_t DATAPIN10;
    __IO uint32_t DATAPIN11;
    __IO uint32_t DATAPIN12;
    __IO uint32_t DATAPIN13;
    __IO uint32_t DATAPIN14;
    __IO uint32_t DATAPIN15;
} GPIO_TypeDef;




typedef struct {
    __IO uint32_t LOAD;                     //定时器加载值，使能后定时器从此数值开始向下递减计数

    __I  uint32_t VALUE;                    //定时器当前值，LDVAL-CVAL 可计算出计时时长

    __IO uint32_t CR;

         uint32_t RESERVED;

    __IO uint32_t IE;

    __IO uint32_t IF;

    __IO uint32_t HALT;                     //[0] 1 暂停计数    0 恢复计数

    __IO uint32_t OCCR;
    __IO uint32_t OCMAT;

    __IO uint32_t RESERVED2;

    __IO uint32_t ICLOW;
    __IO uint32_t ICHIGH;

    __IO uint32_t PREDIV;                   //预分频，8位
} TIMR_TypeDef;


#define TIMR_CR_CLKSRC_Pos          0       //时钟源：  0 内部系统时钟    2 外部引脚脉冲计数
#define TIMR_CR_CLKSRC_Msk          (0x03 << TIMR_CR_CLKSRC_Pos)
#define TIMR_CR_MODE_Pos            2       //工作模式：0 定时器    1 输入捕获    2 输出比较
#define TIMR_CR_MODE_Msk            (0x03 << TIMR_CR_MODE_Pos)

#define TIMR_IE_TO_Pos              0       //Time out
#define TIMR_IE_TO_Msk              (0x01 << TIMR_IE_TO_Pos)
#define TIMR_IE_OC0_Pos             1       //输出比较，第一个反转点
#define TIMR_IE_OC0_Msk             (0x01 << TIMR_IE_OC0_Pos)
#define TIMR_IE_OC1_Pos             2       //输出比较，第二个反转点
#define TIMR_IE_OC1_Msk             (0x01 << TIMR_IE_OC1_Pos)
#define TIMR_IE_ICR_Pos             3       //输入捕获，上升沿中断
#define TIMR_IE_ICR_Msk             (0x01 << TIMR_IE_ICR_Pos)
#define TIMR_IE_ICF_Pos             4       //输入捕获，下降沿中断
#define TIMR_IE_ICF_Msk             (0x01 << TIMR_IE_ICF_Pos)

#define TIMR_IF_TO_Pos              0       //超时中断标志，写1清零
#define TIMR_IF_TO_Msk              (0x01 << TIMR_IF_TO_Pos)
#define TIMR_IF_OC0_Pos             1
#define TIMR_IF_OC0_Msk             (0x01 << TIMR_IF_OC0_Pos)
#define TIMR_IF_OC1_Pos             2
#define TIMR_IF_OC1_Msk             (0x01 << TIMR_IF_OC1_Pos)
#define TIMR_IF_ICR_Pos             3
#define TIMR_IF_ICR_Msk             (0x01 << TIMR_IF_ICR_Pos)
#define TIMR_IF_ICF_Pos             4
#define TIMR_IF_ICF_Msk             (0x01 << TIMR_IF_ICF_Pos)

#define TIMR_OCCR_FORCELVL_Pos      0       //Force Levle，强制输出电平
#define TIMR_OCCR_FORCELVL_Msk      (0x01 << TIMR_OCCR_FORCELVL_Pos)
#define TIMR_OCCR_INITLVL_Pos       1       //Initial Level, 初始输出电平
#define TIMR_OCCR_INITLVL_Msk       (0x01 << TIMR_OCCR_INITLVL_Pos)
#define TIMR_OCCR_FORCEEN_Pos       2       //Force Enable, 强制输出使能
#define TIMR_OCCR_FORCEEN_Msk       (0x01 << TIMR_OCCR_FORCEEN_Pos)


