RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
typedef struct {
    __IO uint32_t HALLIE;                   //HALL中断使能

         uint32_t RESERVED;

    __IO uint32_t HALLIF;

    __IO uint32_t HALLEN;                   //HALL功能开关

    __IO uint32_t HALL0V;                   //HALL0输入跳变沿将Timer0（加载值 - 当前值）存入此寄存器

    __IO uint32_t HALL3V;                   //HALL3输入跳变沿将Timer3（加载值 - 当前值）存入此寄存器

         uint32_t RESERVED2;

    __IO uint32_t HALLSR;                   //HALL输入状态

         uint32_t RESERVED3[8];

    __IO uint32_t EN;
} TIMRG_TypeDef;


#define TIMRG_HALLIE_HALL0_Pos      0       //HALL0中断使能，HALL0使用Timer0计数器
#define TIMRG_HALLIE_HALL0_Msk      (0x01 << TIMRG_HALLIE_HALL0_Pos)
#define TIMRG_HALLIE_HALL3_Pos      1
#define TIMRG_HALLIE_HALL3_Msk      (0x01 << TIMRG_HALLIE_HALL3_Pos)

#define TIMRG_HALLIF_H0IN0_Pos      0       //HALL0输入信号0触发中断标志
#define TIMRG_HALLIF_H0IN0_Msk      (0x01 << TIMRG_HALLIF_H0IN0_Pos)
#define TIMRG_HALLIF_H0IN1_Pos      1
#define TIMRG_HALLIF_H0IN1_Msk      (0x01 << TIMRG_HALLIF_H0IN1_Pos)
#define TIMRG_HALLIF_H0IN2_Pos      2
#define TIMRG_HALLIF_H0IN2_Msk      (0x01 << TIMRG_HALLIF_H0IN2_Pos)
#define TIMRG_HALLIF_H3IN0_Pos      3       //HALL3输入信号0触发中断标志
#define TIMRG_HALLIF_H3IN0_Msk      (0x01 << TIMRG_HALLIF_H3IN0_Pos)
#define TIMRG_HALLIF_H3IN1_Pos      4
#define TIMRG_HALLIF_H3IN1_Msk      (0x01 << TIMRG_HALLIF_H3IN1_Pos)
#define TIMRG_HALLIF_H3IN2_Pos      5
#define TIMRG_HALLIF_H3IN2_Msk      (0x01 << TIMRG_HALLIF_H3IN2_Pos)

#define TIMRG_HALLEN_HALL0_Pos      0       //HALL0功能开关，HALL0使用Timer0计数器
#define TIMRG_HALLEN_HALL0_Msk      (0x01 << TIMRG_HALLEN_HALL0_Pos)
#define TIMRG_HALLEN_HALL3_Pos      1
#define TIMRG_HALLEN_HALL3_Msk      (0x01 << TIMRG_HALLEN_HALL3_Pos)

#define TIMRG_HALLSR_H0IN0_Pos      0       //HALL0输入信号0当前状态
#define TIMRG_HALLSR_H0IN0_Msk      (0x01 << TIMRG_HALLSR_H0IN0_Pos)
#define TIMRG_HALLSR_H0IN1_Pos      1
#define TIMRG_HALLSR_H0IN1_Msk      (0x01 << TIMRG_HALLSR_H0IN1_Pos)
#define TIMRG_HALLSR_H0IN2_Pos      2
#define TIMRG_HALLSR_H0IN2_Msk      (0x01 << TIMRG_HALLSR_H0IN2_Pos)
#define TIMRG_HALLSR_H3IN0_Pos      3       //HALL3输入信号0当前状态
#define TIMRG_HALLSR_H3IN0_Msk      (0x01 << TIMRG_HALLSR_H3IN0_Pos)
#define TIMRG_HALLSR_H3IN1_Pos      4
#define TIMRG_HALLSR_H3IN1_Msk      (0x01 << TIMRG_HALLSR_H3IN1_Pos)
#define TIMRG_HALLSR_H3IN2_Pos      5
#define TIMRG_HALLSR_H3IN2_Msk      (0x01 << TIMRG_HALLSR_H3IN2_Pos)

#define TIMRG_EN_TIMR0_Pos          0
#define TIMRG_EN_TIMR0_Msk          (0x01 << TIMRG_EN_TIMR0_Pos)
#define TIMRG_EN_TIMR1_Pos          1
#define TIMRG_EN_TIMR1_Msk          (0x01 << TIMRG_EN_TIMR1_Pos)
#define TIMRG_EN_TIMR2_Pos          2
#define TIMRG_EN_TIMR2_Msk          (0x01 << TIMRG_EN_TIMR2_Pos)
#define TIMRG_EN_TIMR3_Pos          3
#define TIMRG_EN_TIMR3_Msk          (0x01 << TIMRG_EN_TIMR3_Pos)
#define TIMRG_EN_TIMR4_Pos          4
#define TIMRG_EN_TIMR4_Msk          (0x01 << TIMRG_EN_TIMR4_Pos)
#define TIMRG_EN_TIMR5_Pos          5
#define TIMRG_EN_TIMR5_Msk          (0x01 << TIMRG_EN_TIMR5_Pos)
#define TIMRG_EN_TIMR6_Pos          6
#define TIMRG_EN_TIMR6_Msk          (0x01 << TIMRG_EN_TIMR6_Pos)
#define TIMRG_EN_TIMR7_Pos          7
#define TIMRG_EN_TIMR7_Msk          (0x01 << TIMRG_EN_TIMR7_Pos)
#define TIMRG_EN_TIMR8_Pos          8
#define TIMRG_EN_TIMR8_Msk          (0x01 << TIMRG_EN_TIMR8_Pos)
#define TIMRG_EN_TIMR9_Pos          9
#define TIMRG_EN_TIMR9_Msk          (0x01 << TIMRG_EN_TIMR9_Pos)
#define TIMRG_EN_TIMR10_Pos         10
#define TIMRG_EN_TIMR10_Msk         (0x01 << TIMRG_EN_TIMR10_Pos)
#define TIMRG_EN_TIMR11_Pos         11
#define TIMRG_EN_TIMR11_Msk         (0x01 << TIMRG_EN_TIMR11_Pos)




typedef struct {
    __IO uint32_t DATA;

    __IO uint32_t CTRL;

    __IO uint32_t BAUD;

    __IO uint32_t FIFO;

    __IO uint32_t LINCR;

    union {
        __IO uint32_t CTSCR;

        __IO uint32_t RTSCR;
    };

    __IO uint32_t CFG;

    __IO uint32_t TOCR;                     //Timeout Control Register
} UART_TypeDef;


#define UART_DATA_DATA_Pos          0
#define UART_DATA_DATA_Msk          (0x1FF << UART_DATA_DATA_Pos)
#define UART_DATA_VALID_Pos         9       //当DATA字段有有效的接收数据时，该位硬件置1，读取数据后自动清零
#define UART_DATA_VALID_Msk         (0x01 << UART_DATA_VALID_Pos)
#define UART_DATA_PAERR_Pos         10      //Parity Error
#define UART_DATA_PAERR_Msk         (0x01 << UART_DATA_PAERR_Pos)

#define UART_CTRL_TXIDLE_Pos        0       //TX IDLE: 0 正在发送数据 1 空闲状态，没有数据发送
#define UART_CTRL_TXIDLE_Msk        (0x01 << UART_CTRL_TXIDLE_Pos)
#define UART_CTRL_TXFF_Pos          1       //TX FIFO Full
#define UART_CTRL_TXFF_Msk          (0x01 << UART_CTRL_TXFF_Pos)
#define UART_CTRL_TXIE_Pos          2       //TX 中断使能: 1 TX FF 中数据少于设定个数时产生中断
#define UART_CTRL_TXIE_Msk          (0x01 << UART_CTRL_TXIE_Pos)
#define UART_CTRL_RXNE_Pos          3       //RX FIFO Not Empty
#define UART_CTRL_RXNE_Msk          (0x01 << UART_CTRL_RXNE_Pos)
#define UART_CTRL_RXIE_Pos          4       //RX 中断使能: 1 RX FF 中数据达到设定个数时产生中断
#define UART_CTRL_RXIE_Msk          (0x01 << UART_CTRL_RXIE_Pos)
#define UART_CTRL_RXOV_Pos          5       //RX FIFO Overflow，写1清零
#define UART_CTRL_RXOV_Msk          (0x01 << UART_CTRL_RXOV_Pos)
#define UART_CTRL_TXDOIE_Pos        6       //TX Done 中断使能，发送FIFO空且发送发送移位寄存器已将最后一位发送出去
#define UART_CTRL_TXDOIE_Msk        (0x01 << UART_CTRL_TXDOIE_Pos)
#define UART_CTRL_EN_Pos            9
#define UART_CTRL_EN_Msk            (0x01 << UART_CTRL_EN_Pos)
#define UART_CTRL_LOOP_Pos          10
#define UART_CTRL_LOOP_Msk          (0x01 << UART_CTRL_LOOP_Pos)
#define UART_CTRL_TOIE_Pos          14      //TimeOut 中断使能，接收到上个字符后，超过 TOTIME/BAUDRAUD 秒没有接收到新的数据
#define UART_CTRL_TOIE_Msk          (0x01 << UART_CTRL_TOIE_Pos)
#define UART_CTRL_DATA9b_Pos        18      //1 9位数据位    0 8位数据位
#define UART_CTRL_DATA9b_Msk        (0x01 << UART_CTRL_DATA9b_Pos)
#define UART_CTRL_PARITY_Pos        19      //000 无校验    001 奇校验   011 偶校验   101 固定为1    111 固定为0
#define UART_CTRL_PARITY_Msk        (0x07 << UART_CTRL_PARITY_Pos)
#define UART_CTRL_STOP2b_Pos        22      //1 2位停止位    0 1位停止位
#define UART_CTRL_STOP2b_Msk        (0x03 << UART_CTRL_STOP2b_Pos)

