RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define UART_BAUD_BAUD_Pos          0       //串口波特率 = SYS_Freq/16/BAUD - 1
#define UART_BAUD_BAUD_Msk          (0x3FFF << UART_BAUD_BAUD_Pos)
#define UART_BAUD_TXD_Pos           14      //通过此位可直接读取串口TXD引脚上的电平
#define UART_BAUD_TXD_Msk           (0x01 << UART_BAUD_TXD_Pos)
#define UART_BAUD_RXD_Pos           15      //通过此位可直接读取串口RXD引脚上的电平
#define UART_BAUD_RXD_Msk           (0x01 << UART_BAUD_RXD_Pos)
#define UART_BAUD_RXTOIF_Pos        16      //接收&超时的中断标志 = RXIF | TOIF
#define UART_BAUD_RXTOIF_Msk        (0x01 << UART_BAUD_RXTOIF_Pos)
#define UART_BAUD_TXIF_Pos          17      //发送中断标志 = TXTHRF & TXIE
#define UART_BAUD_TXIF_Msk          (0x01 << UART_BAUD_TXIF_Pos)
#define UART_BAUD_RXTHRF_Pos        19      //RX FIFO Threshold Flag，RX FIFO中数据达到设定个数（RXLVL >  RXTHR）时硬件置1
#define UART_BAUD_RXTHRF_Msk        (0x01 << UART_BAUD_RXTHRF_Pos)
#define UART_BAUD_TXTHRF_Pos        20      //TX FIFO Threshold Flag，TX FIFO中数据少于设定个数（TXLVL <= TXTHR）时硬件置1
#define UART_BAUD_TXTHRF_Msk        (0x01 << UART_BAUD_TXTHRF_Pos)
#define UART_BAUD_TOIF_Pos          21      //TimeOut 中断标志，超过 TOTIME/BAUDRAUD 秒没有接收到新的数据时若TOIE=1，此位由硬件置位
#define UART_BAUD_TOIF_Msk          (0x01 << UART_BAUD_TOIF_Pos)
#define UART_BAUD_RXIF_Pos          22      //接收中断标志 = RXTHRF & RXIE
#define UART_BAUD_RXIF_Msk          (0x01 << UART_BAUD_RXIF_Pos)
#define UART_BAUD_ABREN_Pos         23      //Auto Baudrate Enable，写1启动自动波特率校准，完成后自动清零
#define UART_BAUD_ABREN_Msk         (0x01 << UART_BAUD_ABREN_Pos)
#define UART_BAUD_ABRBIT_Pos        24      //Auto Baudrate Bit，用于计算波特率的检测位长，0 1位，通过测起始位           脉宽计算波特率，要求发送端发送0xFF
                                            //                                             1 2位，通过测起始位加1位数据位脉宽计算波特率，要求发送端发送0xFE
                                            //                                             1 4位，通过测起始位加3位数据位脉宽计算波特率，要求发送端发送0xF8
                                            //                                             1 8位，通过测起始位加7位数据位脉宽计算波特率，要求发送端发送0x80
#define UART_BAUD_ABRBIT_Msk        (0x03 << UART_BAUD_ABRBIT_Pos)
#define UART_BAUD_ABRERR_Pos        26      //Auto Baudrate Error，0 自动波特率校准成功     1 自动波特率校准失败
#define UART_BAUD_ABRERR_Msk        (0x01 << UART_BAUD_ABRERR_Pos)
#define UART_BAUD_TXDOIF_Pos        27      //TX Done 中断标志，发送FIFO空且发送发送移位寄存器已将最后一位发送出去
#define UART_BAUD_TXDOIF_Msk        (0x01 << UART_BAUD_TXDOIF_Pos)
#define UART_BAUD_FRAC_Pos          28      //波特率分频值小数部分
#define UART_BAUD_FRAC_Msk          (0x0Fu << UART_BAUD_FRAC_Pos)

#define UART_FIFO_RXLVL_Pos         0       //RX FIFO Level，RX FIFO 中字符个数
#define UART_FIFO_RXLVL_Msk         (0xFF << UART_FIFO_RXLVL_Pos)
#define UART_FIFO_TXLVL_Pos         8       //TX FIFO Level，TX FIFO 中字符个数
#define UART_FIFO_TXLVL_Msk         (0xFF << UART_FIFO_TXLVL_Pos)
#define UART_FIFO_RXTHR_Pos         16      //RX FIFO Threshold，RX中断触发门限，中断使能时 RXLVL >  RXTHR 触发RX中断
#define UART_FIFO_RXTHR_Msk         (0xFF << UART_FIFO_RXTHR_Pos)
#define UART_FIFO_TXTHR_Pos         24      //TX FIFO Threshold，TX中断触发门限，中断使能时 TXLVL <= TXTHR 触发TX中断
#define UART_FIFO_TXTHR_Msk         (0xFFu<< UART_FIFO_TXTHR_Pos)

#define UART_LINCR_BRKDETIE_Pos     0       //检测到LIN Break中断使能
#define UART_LINCR_BRKDETIE_Msk     (0x01 << UART_LINCR_BRKDETIE_Pos)
#define UART_LINCR_BRKDETIF_Pos     1       //检测到LIN Break中断状态
#define UART_LINCR_BRKDETIF_Msk     (0x01 << UART_LINCR_BRKDETIF_Pos)
#define UART_LINCR_GENBRKIE_Pos     2       //发送LIN Break完成中断使能
#define UART_LINCR_GENBRKIE_Msk     (0x01 << UART_LINCR_GENBRKIE_Pos)
#define UART_LINCR_GENBRKIF_Pos     3       //发送LIN Break完成中断状态
#define UART_LINCR_GENBRKIF_Msk     (0x01 << UART_LINCR_GENBRKIF_Pos)
#define UART_LINCR_GENBRK_Pos       4       //发送LIN Break，发送完成自动清零
#define UART_LINCR_GENBRK_Msk       (0x01 << UART_LINCR_GENBRK_Pos)

#define UART_CTSCR_EN_Pos           0       //CTS流控使能
#define UART_CTSCR_EN_Msk           (0x01 << UART_CTSCR_EN_Pos)
#define UART_CTSCR_POL_Pos          2       //CTS信号极性，0 低有效，CTS输入为低表示可以发送数据
#define UART_CTSCR_POL_Msk          (0x01 << UART_CTSCR_POL_Pos)
#define UART_CTSCR_STAT_Pos         7       //CTS信号的当前状态
#define UART_CTSCR_STAT_Msk         (0x01 << UART_CTSCR_STAT_Pos)

#define UART_RTSCR_EN_Pos           1       //RTS流控使能
#define UART_RTSCR_EN_Msk           (0x01 << UART_RTSCR_EN_Pos)
#define UART_RTSCR_POL_Pos          3       //RTS信号极性    0 低有效，RTS输入为低表示可以接收数据
#define UART_RTSCR_POL_Msk          (0x01 << UART_RTSCR_POL_Pos)
#define UART_RTSCR_THR_Pos          4       //RTS流控的触发阈值    0 1字节    1 2字节    2 4字节    3 6字节
#define UART_RTSCR_THR_Msk          (0x07 << UART_RTSCR_THR_Pos)
#define UART_RTSCR_STAT_Pos         8       //RTS信号的当前状态
#define UART_RTSCR_STAT_Msk         (0x01 << UART_RTSCR_STAT_Pos)

#define UART_CFG_MSBF_Pos           1       //接收发送MSB First
#define UART_CFG_MSBF_Msk           (0x01 << UART_CFG_MSBF_Pos)
#define UART_CFG_BRKTXLEN_Pos       2       //1表示1bit，以此类推，默认值13
#define UART_CFG_BRKTXLEN_Msk       (0x0F << UART_CFG_BRKTXLEN_Pos)
#define UART_CFG_BRKRXLEN_Pos       6       //0表示1bit，以此类推，默认值12
#define UART_CFG_BRKRXLEN_Msk       (0x0F << UART_CFG_BRKRXLEN_Pos)
#define UART_CFG_RXINV_Pos          10      //接收电平翻转
#define UART_CFG_RXINV_Msk          (0x01 << UART_CFG_RXINV_Pos)
#define UART_CFG_TXINV_Pos          11      //发送电平翻转
#define UART_CFG_TXINV_Msk          (0x01 << UART_CFG_TXINV_Pos)

#define UART_TOCR_TIME_Pos          0       //超时时间长度，单位为 10/BAUDRATE 秒
#define UART_TOCR_TIME_Msk          (0xFFF<< UART_TOCR_TIME_Pos)
#define UART_TOCR_MODE_Pos          12      //0 只有当FIFO中有数时才触发超时中断    1 即使FIFO中没有数也可触发超时中断
#define UART_TOCR_MODE_Msk          (0x01 << UART_TOCR_MODE_Pos)
#define UART_TOCR_IFCLR_Pos         13      //TO Interrupt Flag Clear，写1清除超时中断标志
#define UART_TOCR_IFCLR_Msk         (0x01 << UART_TOCR_IFCLR_Pos)




typedef struct {
    __IO uint32_t CTRL;

    __IO uint32_t DATA;

    __IO uint32_t STAT;

    __IO uint32_t IE;

    __IO uint32_t IF;

    __IO uint32_t I2SCR;

    __IO uint32_t I2SPR;
} SPI_TypeDef;


#define SPI_CTRL_CLKDIV_Pos         0       //Clock Divider, SPI工作时钟 = SYS_Freq/pow(2, CLKDIV+2)
#define SPI_CTRL_CLKDIV_Msk         (0x07 << SPI_CTRL_CLKDIV_Pos)
#define SPI_CTRL_EN_Pos             3
#define SPI_CTRL_EN_Msk             (0x01 << SPI_CTRL_EN_Pos)
#define SPI_CTRL_SIZE_Pos           4       //Data Size Select, 取值3--15，表示4--16位
#define SPI_CTRL_SIZE_Msk           (0x0F << SPI_CTRL_SIZE_Pos)
#define SPI_CTRL_CPHA_Pos           8       //0 在SCLK的第一个跳变沿采样数据    1 在SCLK的第二个跳变沿采样数据
#define SPI_CTRL_CPHA_Msk           (0x01 << SPI_CTRL_CPHA_Pos)
#define SPI_CTRL_CPOL_Pos           9       //0 空闲状态下SCLK为低电平         1 空闲状态下SCLK为高电平
#define SPI_CTRL_CPOL_Msk           (0x01 << SPI_CTRL_CPOL_Pos)
#define SPI_CTRL_FFS_Pos            10      //Frame Format Select, 0 SPI    1 TI SSI    2 I2S   3 SPI Flash
#define SPI_CTRL_FFS_Msk            (0x03 << SPI_CTRL_FFS_Pos)
#define SPI_CTRL_MSTR_Pos           12      //Master, 1 主模式 0 从模式
#define SPI_CTRL_MSTR_Msk           (0x01 << SPI_CTRL_MSTR_Pos)
#define SPI_CTRL_FAST_Pos           13      //1 SPI工作时钟 = SYS_Freq/2    0 SPI工作时钟由SPI->CTRL.CLKDIV设置
#define SPI_CTRL_FAST_Msk           (0x01 << SPI_CTRL_FAST_Pos)
#define SPI_CTRL_DMATXEN_Pos        14      //1 通过DMA写FIFO    0 通过MCU写FIFO
#define SPI_CTRL_DMATXEN_Msk        (0x01 << SPI_CTRL_DMATXEN_Pos)
#define SPI_CTRL_DMARXEN_Pos        15      //1 通过DMA读FIFO    0 通过MCU读FIFO
#define SPI_CTRL_DMARXEN_Msk        (0x01 << SPI_CTRL_DMARXEN_Pos)
#define SPI_CTRL_FILTE_Pos          16      //1 对SPI输入信号进行去抖操作    0 对SPI输入信号不进行去抖操作
#define SPI_CTRL_FILTE_Msk          (0x01 << SPI_CTRL_FILTE_Pos)
#define SPI_CTRL_SSN_H_Pos          17      //0 传输过程中SSN始终为0         1 传输过程中每字符之间会将SSN拉高半个SCLK周期
#define SPI_CTRL_SSN_H_Msk          (0x01 << SPI_CTRL_SSN_H_Pos)
#define SPI_CTRL_RFTHR_Pos          18      //RX FIFO Threshold，0 接收FIFO中至少有1个数据   ...   7 接收FIFO中至少有8个数据
#define SPI_CTRL_RFTHR_Msk          (0x07 << SPI_CTRL_RFTHR_Pos)
#define SPI_CTRL_TFTHR_Pos          21      //TX FIFO Threshold，0 发送FIFO中至多有0个数据   ...   7 发送FIFO中至多有7个数据
#define SPI_CTRL_TFTHR_Msk          (0x07 << SPI_CTRL_TFTHR_Pos)
#define SPI_CTRL_RFCLR_Pos          24      //RX FIFO Clear
#define SPI_CTRL_RFCLR_Msk          (0x01 << SPI_CTRL_RFCLR_Pos)
#define SPI_CTRL_TFCLR_Pos          25      //TX FIFO Clear
#define SPI_CTRL_TFCLR_Msk          (0x01 << SPI_CTRL_TFCLR_Pos)
#define SPI_CTRL_LSBF_Pos           28      //LSB Fisrt
#define SPI_CTRL_LSBF_Msk           (0x01 << SPI_CTRL_LSBF_Pos)
#define SPI_CTRL_NSYNC_Pos          29      //1 对SPI输入信号进行采样同步    0 对SPI输入信号不进行采样同步
#define SPI_CTRL_NSYNC_Msk          (0x01 << SPI_CTRL_NSYNC_Pos)

#define SPI_STAT_WTC_Pos            0       //Word Transmit Complete，每传输完成一个数据字由硬件置1，软件写1清零
#define SPI_STAT_WTC_Msk            (0x01 << SPI_STAT_WTC_Pos)
#define SPI_STAT_TFE_Pos            1       //发送FIFO Empty
#define SPI_STAT_TFE_Msk            (0x01 << SPI_STAT_TFE_Pos)
#define SPI_STAT_TFNF_Pos           2       //发送FIFO Not Full
#define SPI_STAT_TFNF_Msk           (0x01 << SPI_STAT_TFNF_Pos)
#define SPI_STAT_RFNE_Pos           3       //接收FIFO Not Empty
#define SPI_STAT_RFNE_Msk           (0x01 << SPI_STAT_RFNE_Pos)
#define SPI_STAT_RFF_Pos            4       //接收FIFO Full
#define SPI_STAT_RFF_Msk            (0x01 << SPI_STAT_RFF_Pos)
#define SPI_STAT_RFOV_Pos           5       //接收FIFO Overflow
#define SPI_STAT_RFOV_Msk           (0x01 << SPI_STAT_RFOV_Pos)
#define SPI_STAT_TFLVL_Pos          6       //发送FIFO中数据个数， 0 TFNF=0时表示FIFO内有8个数据，TFNF=1时表示FIFO内有0个数据    1--7 FIFO内有1--7个数据
#define SPI_STAT_TFLVL_Msk          (0x07 << SPI_STAT_TFLVL_Pos)
#define SPI_STAT_RFLVL_Pos          9       //接收FIFO中数据个数， 0 RFF =1时表示FIFO内有8个数据，RFF =0时表示FIFO内有0个数据    1--7 FIFO内有1--7个数据
#define SPI_STAT_RFLVL_Msk          (0x07 << SPI_STAT_RFLVL_Pos)
#define SPI_STAT_BUSY_Pos           15
#define SPI_STAT_BUSY_Msk           (0x01 << SPI_STAT_BUSY_Pos)

