RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define SPI_IE_RFOV_Pos             0
#define SPI_IE_RFOV_Msk             (0x01 << SPI_IE_RFOV_Pos)
#define SPI_IE_RFF_Pos              1
#define SPI_IE_RFF_Msk              (0x01 << SPI_IE_RFF_Pos)
#define SPI_IE_RFHF_Pos             2
#define SPI_IE_RFHF_Msk             (0x01 << SPI_IE_RFHF_Pos)
#define SPI_IE_TFE_Pos              3
#define SPI_IE_TFE_Msk              (0x01 << SPI_IE_TFE_Pos)
#define SPI_IE_TFHF_Pos             4       //发送FIFO中数据个数大于4
#define SPI_IE_TFHF_Msk             (0x01 << SPI_IE_TFHF_Pos)
#define SPI_IE_RFTHR_Pos            5       //接收FIFO中数据个数大于CTRL.RFTHR设定值中断使能
#define SPI_IE_RFTHR_Msk            (0x01 << SPI_IE_RFTHR_Pos)
#define SPI_IE_TFTHR_Pos            6       //发送FIFO中数据个数小于CTRL.TFTHR设定值中断使能
#define SPI_IE_TFTHR_Msk            (0x01 << SPI_IE_TFTHR_Pos)
#define SPI_IE_WTC_Pos              8       //Word Transmit Complete
#define SPI_IE_WTC_Msk              (0x01 << SPI_IE_WTC_Pos)
#define SPI_IE_FTC_Pos              9       //Frame Transmit Complete
#define SPI_IE_FTC_Msk              (0x01 << SPI_IE_FTC_Pos)
#define SPI_IE_SSFALL_Pos           10      //Slave Select Fall Edge
#define SPI_IE_SSFALL_Msk           (0x01 << SPI_IE_SSFALL_Pos)
#define SPI_IE_SSRISE_Pos           11      //Slave Select Rise Edge
#define SPI_IE_SSRISE_Msk           (0x01 << SPI_IE_SSRISE_Pos)

#define SPI_IF_RFOV_Pos             0       //写1清零
#define SPI_IF_RFOV_Msk             (0x01 << SPI_IF_RFOV_Pos)
#define SPI_IF_RFF_Pos              1       //写1清零
#define SPI_IF_RFF_Msk              (0x01 << SPI_IF_RFF_Pos)
#define SPI_IF_RFHF_Pos             2       //写1清零
#define SPI_IF_RFHF_Msk             (0x01 << SPI_IF_RFHF_Pos)
#define SPI_IF_TFE_Pos              3       //写1清零
#define SPI_IF_TFE_Msk              (0x01 << SPI_IF_TFE_Pos)
#define SPI_IF_TFHF_Pos             4       //写1清零
#define SPI_IF_TFHF_Msk             (0x01 << SPI_IF_TFHF_Pos)
#define SPI_IF_RFTHR_Pos            5       //写1清零
#define SPI_IF_RFTHR_Msk            (0x01 << SPI_IF_RFTHR_Pos)
#define SPI_IF_TFTHR_Pos            6       //写1清零
#define SPI_IF_TFTHR_Msk            (0x01 << SPI_IF_TFTHR_Pos)
#define SPI_IF_WTC_Pos              8       //Word Transmit Complete，每传输完成一个数据字由硬件置1
#define SPI_IF_WTC_Msk              (0x01 << SPI_IF_WTC_Pos)
#define SPI_IF_FTC_Pos              9       //Frame Transmit Complete，WTC置位时若TX FIFO是空的，则FTC置位
#define SPI_IF_FTC_Msk              (0x01 << SPI_IF_FTC_Pos)
#define SPI_IF_SSFALL_Pos           10
#define SPI_IF_SSFALL_Msk           (0x01 << SPI_IF_SSFALL_Pos)
#define SPI_IF_SSRISE_Pos           11
#define SPI_IF_SSRISE_Msk           (0x01 << SPI_IF_SSRISE_Pos)

#define SPI_I2SCR_DIEN_Pos          0       //Data Input Enable
#define SPI_I2SCR_DIEN_Msk          (0x01 << SPI_I2SCR_DIEN_Pos)
#define SPI_I2SCR_DOEN_Pos          1       //Data Output Enable
#define SPI_I2SCR_DOEN_Msk          (0x01 << SPI_I2SCR_DOEN_Pos)
#define SPI_I2SCR_MSTR_Pos          2       //Master Mode
#define SPI_I2SCR_MSTR_Msk          (0x01 << SPI_I2SCR_MSTR_Pos)
#define SPI_I2SCR_EN_Pos            3
#define SPI_I2SCR_EN_Msk            (0x01 << SPI_I2SCR_EN_Pos)
#define SPI_I2SCR_FFMT_Pos          4       //I2S Frame Format, 0 I2S philips   1 MSB justified   2 PCM Short   3 PCM Long
#define SPI_I2SCR_FFMT_Msk          (0x03 << SPI_I2SCR_FFMT_Pos)
#define SPI_I2SCR_DLEN_Pos          6       //I2S Data Length,  0 8位   1 16位   2 24位   3 32位
#define SPI_I2SCR_DLEN_Msk          (0x03 << SPI_I2SCR_DLEN_Pos)
#define SPI_I2SCR_PCMSYNW_Pos       8       //I2S PCM Long Mode Sync Width, 0 1 SCLK period   1 1 Data Length
#define SPI_I2SCR_PCMSYNW_Msk       (0x01 << SPI_I2SCR_PCMSYNW_Pos)
#define SPI_I2SCR_MCLKOE_Pos        9       //MCLK Output Enable
#define SPI_I2SCR_MCLKOE_Msk        (0x01 << SPI_I2SCR_MCLKOE_Pos)
#define SPI_I2SCR_CHLEN_Pos         10      //声道宽度，0 16位   1 32位
#define SPI_I2SCR_CHLEN_Msk         (0x01 << SPI_I2SCR_CHLEN_Pos)
#define SPI_I2SCR_CHRIGHT_Pos       16      //1 Right Channel   0 Left Channel
#define SPI_I2SCR_CHRIGHT_Msk       (0x01 << SPI_I2SCR_CHRIGHT_Pos)

#define SPI_I2SPR_MCLKDIV_Pos       0       //Fmclk = Fpclk / (2 * (MCLKDIV + 1))，MCLK一般是SCLK的256或384倍
#define SPI_I2SPR_MCLKDIV_Msk       (0x3F << SPI_I2SPR_MCLKDIV_Pos)
#define SPI_I2SPR_SCLKDIV_Pos       8       //Fsclk = Fpclk / (2 * (SCLKDIV + 1))
#define SPI_I2SPR_SCLKDIV_Msk       (0xFFF<< SPI_I2SPR_SCLKDIV_Pos)




typedef struct {
    __IO uint32_t CR;

    __IO uint32_t SR;

    __IO uint32_t TR;                       //Transfer Register

    __IO uint32_t RXDATA;

    __IO uint32_t TXDATA;

    __IO uint32_t IF;

    __IO uint32_t IE;

         uint32_t RESERVED1;

    __IO uint32_t MCR;                      //Master Control Register

    __IO uint32_t CLK;

         uint32_t RESERVED2[2];

    __IO uint32_t SCR;                      //Slave Control Register

    __IO uint32_t SADDR;
} I2C_TypeDef;


#define I2C_CR_EN_Pos               0
#define I2C_CR_EN_Msk               (0x01 << I2C_CR_EN_Pos)
#define I2C_CR_MASTER_Pos           1       //1 Master   0 Slave
#define I2C_CR_MASTER_Msk           (0x01 << I2C_CR_MASTER_Pos)
#define I2C_CR_HS_Pos               2       //1 High-Speed mode    0 Standard-mode or Fast-mode
#define I2C_CR_HS_Msk               (0x01 << I2C_CR_HS_Pos)
#define I2C_CR_DNF_Pos              3       //Digital Noise Filter, 宽度低于 DNF+1 个的电平被认为是毛刺
#define I2C_CR_DNF_Msk              (0x0F << I2C_CR_DNF_Pos)

#define I2C_SR_BUSY_Pos             0
#define I2C_SR_BUSY_Msk             (0x01 << I2C_SR_BUSY_Pos)
#define I2C_SR_SCL_Pos              1       //SCL Line Level
#define I2C_SR_SCL_Msk              (0x01 << I2C_SR_SCL_Pos)
#define I2C_SR_SDA_Pos              2       //SDA Line Level
#define I2C_SR_SDA_Msk              (0x01 << I2C_SR_SDA_Pos)

#define I2C_TR_TXACK_Pos            0       //作为接收时，反馈ACK位的电平值
#define I2C_TR_TXACK_Msk            (0x01 << I2C_TR_TXACK_Pos)
#define I2C_TR_RXACK_Pos            1       //作为发送时，接收到的ACK位电平值
#define I2C_TR_RXACK_Msk            (0x01 << I2C_TR_RXACK_Pos)
#define I2C_TR_TXCLR_Pos            2       //TX Data Clear, 自动清零
#define I2C_TR_TXCLR_Msk            (0x01 << I2C_TR_TXCLR_Pos)
#define I2C_TR_SLVACT_Pos           8       //Slave Active, 从机模式下被选中时置位
#define I2C_TR_SLVACT_Msk           (0x01 << I2C_TR_SLVACT_Pos)
#define I2C_TR_SLVRD_Pos            9       //Slave Read mode，从机模式下接收到读请求时置位
#define I2C_TR_SLVRD_Msk            (0x01 << I2C_TR_SLVRD_Pos)
#define I2C_TR_SLVWR_Pos            10      //Slave Write mode，从机模式下接收到写请求时置位
#define I2C_TR_SLVWR_Msk            (0x01 << I2C_TR_SLVWR_Pos)
#define I2C_TR_SLVSTR_Pos           11      //Slave clock stretching
#define I2C_TR_SLVSTR_Msk           (0x01 << I2C_TR_SLVSTR_Pos)
#define I2C_TR_SLVRDS_Pos           12      //Slave RXDATA Status, 0 空   1 接收到地址   2 接收到数据   3 接收到Master Code
#define I2C_TR_SLVRDS_Msk           (0x03 << I2C_TR_SLVRDS_Pos)

