RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define I2C_IF_TXE_Pos              0       //TX Empty，写TXDATA清零此位
#define I2C_IF_TXE_Msk              (0x01 << I2C_IF_TXE_Pos)
#define I2C_IF_RXNE_Pos             1       //RX Not Empty，读RXDATA清零此位
#define I2C_IF_RXNE_Msk             (0x01 << I2C_IF_RXNE_Pos)
#define I2C_IF_RXOV_Pos             2       //RX Overflow，写1清零
#define I2C_IF_RXOV_Msk             (0x01 << I2C_IF_RXOV_Pos)
#define I2C_IF_TXDONE_Pos           3       //TX Done，写1清零
#define I2C_IF_TXDONE_Msk           (0x01 << I2C_IF_TXDONE_Pos)
#define I2C_IF_RXDONE_Pos           4       //RX Done，写1清零
#define I2C_IF_RXDONE_Msk           (0x01 << I2C_IF_RXDONE_Pos)
#define I2C_IF_RXSTA_Pos            8       //从机接收到起始位，写1清零
#define I2C_IF_RXSTA_Msk            (0x01 << I2C_IF_RXSTA_Pos)
#define I2C_IF_RXSTO_Pos            9       //从机接收到停止位，写1清零
#define I2C_IF_RXSTO_Msk            (0x01 << I2C_IF_RXSTO_Pos)
#define I2C_IF_AL_Pos               16      //主机仲裁丢失总线，写1清零
#define I2C_IF_AL_Msk               (0x01 << I2C_IF_AL_Pos)
#define I2C_IF_MLTO_Pos             17      //Master SCL Low Timeout，写1清零
#define I2C_IF_MLTO_Msk             (0x01 << I2C_IF_MLTO_Pos)

#define I2C_IE_TXE_Pos              0
#define I2C_IE_TXE_Msk              (0x01 << I2C_IE_TXE_Pos)
#define I2C_IE_RXNE_Pos             1
#define I2C_IE_RXNE_Msk             (0x01 << I2C_IE_RXNE_Pos)
#define I2C_IE_RXOV_Pos             2
#define I2C_IE_RXOV_Msk             (0x01 << I2C_IE_RXOV_Pos)
#define I2C_IE_TXDONE_Pos           3
#define I2C_IE_TXDONE_Msk           (0x01 << I2C_IE_TXDONE_Pos)
#define I2C_IE_RXDONE_Pos           4
#define I2C_IE_RXDONE_Msk           (0x01 << I2C_IE_RXDONE_Pos)
#define I2C_IE_RXSTA_Pos            8
#define I2C_IE_RXSTA_Msk            (0x01 << I2C_IE_RXSTA_Pos)
#define I2C_IE_RXSTO_Pos            9
#define I2C_IE_RXSTO_Msk            (0x01 << I2C_IE_RXSTO_Pos)
#define I2C_IE_AL_Pos               16
#define I2C_IE_AL_Msk               (0x01 << I2C_IE_AL_Pos)
#define I2C_IE_MLTO_Pos             17
#define I2C_IE_MLTO_Msk             (0x01 << I2C_IE_MLTO_Pos)

#define I2C_MCR_STA_Pos             0       //写1产生起始位，完成后自动清零
#define I2C_MCR_STA_Msk             (0x01 << I2C_MCR_STA_Pos)
#define I2C_MCR_RD_Pos              1
#define I2C_MCR_RD_Msk              (0x01 << I2C_MCR_RD_Pos)
#define I2C_MCR_WR_Pos              2
#define I2C_MCR_WR_Msk              (0x01 << I2C_MCR_WR_Pos)
#define I2C_MCR_STO_Pos             3       //写1产生停止位，完成后自动清零
#define I2C_MCR_STO_Msk             (0x01 << I2C_MCR_STO_Pos)

#define I2C_CLK_SCLL_Pos            0       //SCL Low Time
#define I2C_CLK_SCLL_Msk            (0xFF << I2C_CLK_SCLL_Pos)
#define I2C_CLK_SCLH_Pos            8       //SCL High Time
#define I2C_CLK_SCLH_Msk            (0xFF << I2C_CLK_SCLH_Pos)
#define I2C_CLK_DIV_Pos             16
#define I2C_CLK_DIV_Msk             (0xFF << I2C_CLK_DIV_Pos)
#define I2C_CLK_SDAH_Pos            24      //SDA Hold Time
#define I2C_CLK_SDAH_Msk            (0x0F << I2C_CLK_SDAH_Pos)

#define I2C_SCR_ADDR10_Pos          0       //1 10位地址    0 7位地址
#define I2C_SCR_ADDR10_Msk          (0x01 << I2C_SCR_ADDR10_Pos)
#define I2C_SCR_MCDE_Pos            1       //Master Code Detect Enable
#define I2C_SCR_MCDE_Msk            (0x01 << I2C_SCR_MCDE_Pos)
#define I2C_SCR_STRE_Pos            2       //Clock Stretching Enable
#define I2C_SCR_STRE_Msk            (0x01 << I2C_SCR_STRE_Pos)
#define I2C_SCR_ASDS_Pos            3       //Adaptive Stretching Data Setup
#define I2C_SCR_ASDS_Msk            (0x01 << I2C_SCR_ASDS_Pos)

#define I2C_SADDR_ADDR7_Pos         1       //7位地址模式下的地址
#define I2C_SADDR_ADDR7_Msk         (0x7F << I2C_SADDR_ADDR7_Pos)
#define I2C_SADDR_ADDR10_Pos        0       //10位地址模式下的地址
#define I2C_SADDR_ADDR10_Msk        (0x3FF<< I2C_SADDR_ADDR10_Pos)
#define I2C_SADDR_MASK7_Pos         17      //7位地址模式下的地址掩码，ADDR7 & (~MASK7) 后与接收地址比较
#define I2C_SADDR_MASK7_Msk         (0x7F << I2C_SADDR_MASK7_Pos)
#define I2C_SADDR_MASK10_Pos        16      //10位地址模式下的地址掩码，只掩码低8位
#define I2C_SADDR_MASK10_Msk        (0xFF << I2C_SADDR_MASK10_Pos)




typedef struct {
    __IO uint32_t CR;

    __IO uint32_t GO;

    __IO uint32_t IE;

    __IO uint32_t IF;

    struct {
        __IO uint32_t SR;

        __IO uint32_t DR;

        __IO uint32_t CMP;

             uint32_t RESERVED;
    } SEQ[4];

         uint32_t RESERVED[15];

    __IO uint32_t SEQCHN0;

    __IO uint32_t SEQCHN1;                  //序列通道选择

    __IO uint32_t SEQTRG;                   //序列触发选择

    __IO uint32_t SEQCOV;                   //序列转换次数，序列被触发启动后可连续转换多次，此处指定转换次数

    __IO uint32_t SEQSMP;                   //序列采样时间，采样保持时间

         uint32_t RESERVED2[4];

    __IO uint32_t CR2;

         uint32_t RESERVED3[15];

    __IO uint32_t CALIB;
} ADC_TypeDef;


#define ADC_CR_EN_Pos               0
#define ADC_CR_EN_Msk               (0x01 << ADC_CR_EN_Pos)
#define ADC_CR_AVG_Pos              1       //0 1次采样      1 2次采样取平均值      2 4次采样取平均值      3 8次采样取平均值
#define ADC_CR_AVG_Msk              (0x03 << ADC_CR_AVG_Pos)
#define ADC_CR_RESET_Pos            3       //复位模拟模块，置位至少需两个采样周期
#define ADC_CR_RESET_Msk            (0x01 << ADC_CR_RESET_Pos)
#define ADC_CR_DMAEN_Pos            4       //四位，每位对应一个序列，同一时刻只能一个有一个序列使能DMA，0 能通过CPU读取DATA_FIFO   1 只能通过DMA读取DATA_FIFO
#define ADC_CR_DMAEN_Msk            (0x0F << ADC_CR_DMAEN_Pos)
#define ADC_CR_FFCLR_Pos            8       //FIFO Clear，四位，每位对应一个序列
#define ADC_CR_FFCLR_Msk            (0x0F << ADC_CR_FFCLR_Pos)

#define ADC_GO_SEQ0_Pos             0       //序列3转换启动位
#define ADC_GO_SEQ0_Msk             (0x01 << ADC_GO_SEQ0_Pos)
#define ADC_GO_SEQ1_Pos             1
#define ADC_GO_SEQ1_Msk             (0x01 << ADC_GO_SEQ1_Pos)
#define ADC_GO_SEQ2_Pos             2
#define ADC_GO_SEQ2_Msk             (0x01 << ADC_GO_SEQ3_Pos)
#define ADC_GO_SEQ3_Pos             3
#define ADC_GO_SEQ3_Msk             (0x01 << ADC_GO_SEQ3_Pos)
#define ADC_GO_BUSY_Pos             4
#define ADC_GO_BUSY_Msk             (0x01 << ADC_GO_BUSY_Pos)

#define ADC_IE_SEQ0EOC_Pos          0       //序列0 End Of Convertion 中断使能
#define ADC_IE_SEQ0EOC_Msk          (0x01 << ADC_IE_SEQ0EOC_Pos)
#define ADC_IE_SEQ0OVF_Pos          1       //序列0 FIFO Overflow 中断使能
#define ADC_IE_SEQ0OVF_Msk          (0x01 << ADC_IE_SEQ0OVF_Pos)
#define ADC_IE_SEQ0HALF_Pos         2       //序列0 FIFO Half Full 中断使能
#define ADC_IE_SEQ0HALF_Msk         (0x01 << ADC_IE_SEQ0HALF_Pos)
#define ADC_IE_SEQ0FULL_Pos         3       //序列0 FIFO Full 中断使能
#define ADC_IE_SEQ0FULL_Msk         (0x01 << ADC_IE_SEQ0FULL_Pos)
#define ADC_IE_SEQ0CMPMAX_Pos       4       //序列0转换结果大于COMP.MAX中断使能
#define ADC_IE_SEQ0CMPMAX_Msk       (0x01 << ADC_IE_SEQ0CMPMAX_Pos)
#define ADC_IE_SEQ0CMPMIN_Pos       5       //序列0转换结果小于COMP.MIN中断使能
#define ADC_IE_SEQ0CMPMIN_Msk       (0x01 << ADC_IE_SEQ0CMPMIN_Pos)
#define ADC_IE_SEQ1EOC_Pos          8
#define ADC_IE_SEQ1EOC_Msk          (0x01 << ADC_IE_SEQ1EOC_Pos)
#define ADC_IE_SEQ1OVF_Pos          9
#define ADC_IE_SEQ1OVF_Msk          (0x01 << ADC_IE_SEQ1OVF_Pos)
#define ADC_IE_SEQ1HALF_Pos         10
#define ADC_IE_SEQ1HALF_Msk         (0x01 << ADC_IE_SEQ1HALF_Pos)
#define ADC_IE_SEQ1FULL_Pos         11
#define ADC_IE_SEQ1FULL_Msk         (0x01 << ADC_IE_SEQ1FULL_Pos)
#define ADC_IE_SEQ1CMPMAX_Pos       12
#define ADC_IE_SEQ1CMPMAX_Msk       (0x01 << ADC_IE_SEQ1CMPMAX_Pos)
#define ADC_IE_SEQ1CMPMIN_Pos       13
#define ADC_IE_SEQ1CMPMIN_Msk       (0x01 << ADC_IE_SEQ1CMPMIN_Pos)
#define ADC_IE_SEQ2EOC_Pos          16
#define ADC_IE_SEQ2EOC_Msk          (0x01 << ADC_IE_SEQ2EOC_Pos)
#define ADC_IE_SEQ2OVF_Pos          17
#define ADC_IE_SEQ2OVF_Msk          (0x01 << ADC_IE_SEQ2OVF_Pos)
#define ADC_IE_SEQ2HALF_Pos         18
#define ADC_IE_SEQ2HALF_Msk         (0x01 << ADC_IE_SEQ2HALF_Pos)
#define ADC_IE_SEQ2FULL_Pos         19
#define ADC_IE_SEQ2FULL_Msk         (0x01 << ADC_IE_SEQ2FULL_Pos)
#define ADC_IE_SEQ2CMPMAX_Pos       20
#define ADC_IE_SEQ2CMPMAX_Msk       (0x01 << ADC_IE_SEQ2CMPMAX_Pos)
#define ADC_IE_SEQ2CMPMIN_Pos       21
#define ADC_IE_SEQ2CMPMIN_Msk       (0x01 << ADC_IE_SEQ2CMPMIN_Pos)
#define ADC_IE_SEQ3EOC_Pos          24
#define ADC_IE_SEQ3EOC_Msk          (0x01 << ADC_IE_SEQ3EOC_Pos)
#define ADC_IE_SEQ3OVF_Pos          25
#define ADC_IE_SEQ3OVF_Msk          (0x01 << ADC_IE_SEQ3OVF_Pos)
#define ADC_IE_SEQ3HALF_Pos         26
#define ADC_IE_SEQ3HALF_Msk         (0x01 << ADC_IE_SEQ3HALF_Pos)
#define ADC_IE_SEQ3FULL_Pos         27
#define ADC_IE_SEQ3FULL_Msk         (0x01 << ADC_IE_SEQ3FULL_Pos)
#define ADC_IE_SEQ3CMPMAX_Pos       28
#define ADC_IE_SEQ3CMPMAX_Msk       (0x01 << ADC_IE_SEQ3CMPMAX_Pos)
#define ADC_IE_SEQ3CMPMIN_Pos       29
#define ADC_IE_SEQ3CMPMIN_Msk       (0x01 << ADC_IE_SEQ3CMPMIN_Pos)

#define ADC_IF_SEQ0EOC_Pos          0       //序列0 End Of Convertion 中断标志
#define ADC_IF_SEQ0EOC_Msk          (0x01 << ADC_IF_SEQ0EOC_Pos)
#define ADC_IF_SEQ0OVF_Pos          1       //序列0 FIFO Overflow 中断标志
#define ADC_IF_SEQ0OVF_Msk          (0x01 << ADC_IF_SEQ0OVF_Pos)
#define ADC_IF_SEQ0HALF_Pos         2       //序列0 FIFO Half Full 中断标志
#define ADC_IF_SEQ0HALF_Msk         (0x01 << ADC_IF_SEQ0HALF_Pos)
#define ADC_IF_SEQ0FULL_Pos         3       //序列0 FIFO Full 中断标志
#define ADC_IF_SEQ0FULL_Msk         (0x01 << ADC_IF_SEQ0FULL_Pos)
#define ADC_IF_SEQ0CMPMAX_Pos       4       //序列0转换结果大于COMP.MAX中断标志
#define ADC_IF_SEQ0CMPMAX_Msk       (0x01 << ADC_IF_SEQ0CMPMAX_Pos)
#define ADC_IF_SEQ0CMPMIN_Pos       5       //序列0转换结果小于COMP.MIN中断标志
#define ADC_IF_SEQ0CMPMIN_Msk       (0x01 << ADC_IF_SEQ0CMPMIN_Pos)
#define ADC_IF_SEQ1EOC_Pos          8
#define ADC_IF_SEQ1EOC_Msk          (0x01 << ADC_IF_SEQ1EOC_Pos)
#define ADC_IF_SEQ1OVF_Pos          9
#define ADC_IF_SEQ1OVF_Msk          (0x01 << ADC_IF_SEQ1OVF_Pos)
#define ADC_IF_SEQ1HALF_Pos         10
#define ADC_IF_SEQ1HALF_Msk         (0x01 << ADC_IF_SEQ1HALF_Pos)
#define ADC_IF_SEQ1FULL_Pos         11
#define ADC_IF_SEQ1FULL_Msk         (0x01 << ADC_IF_SEQ1FULL_Pos)
#define ADC_IF_SEQ1CMPMAX_Pos       12
#define ADC_IF_SEQ1CMPMAX_Msk       (0x01 << ADC_IF_SEQ1CMPMAX_Pos)
#define ADC_IF_SEQ1CMPMIN_Pos       13
#define ADC_IF_SEQ1CMPMIN_Msk       (0x01 << ADC_IF_SEQ1CMPMIN_Pos)
#define ADC_IF_SEQ2EOC_Pos          16
#define ADC_IF_SEQ2EOC_Msk          (0x01 << ADC_IF_SEQ2EOC_Pos)
#define ADC_IF_SEQ2OVF_Pos          17
#define ADC_IF_SEQ2OVF_Msk          (0x01 << ADC_IF_SEQ2OVF_Pos)
#define ADC_IF_SEQ2HALF_Pos         18
#define ADC_IF_SEQ2HALF_Msk         (0x01 << ADC_IF_SEQ2HALF_Pos)
#define ADC_IF_SEQ2FULL_Pos         19
#define ADC_IF_SEQ2FULL_Msk         (0x01 << ADC_IF_SEQ2FULL_Pos)
#define ADC_IF_SEQ2CMPMAX_Pos       20
#define ADC_IF_SEQ2CMPMAX_Msk       (0x01 << ADC_IF_SEQ2CMPMAX_Pos)
#define ADC_IF_SEQ2CMPMIN_Pos       21
#define ADC_IF_SEQ2CMPMIN_Msk       (0x01 << ADC_IF_SEQ2CMPMIN_Pos)
#define ADC_IF_SEQ3EOC_Pos          24
#define ADC_IF_SEQ3EOC_Msk          (0x01 << ADC_IF_SEQ3EOC_Pos)
#define ADC_IF_SEQ3OVF_Pos          25
#define ADC_IF_SEQ3OVF_Msk          (0x01 << ADC_IF_SEQ3OVF_Pos)
#define ADC_IF_SEQ3HALF_Pos         26
#define ADC_IF_SEQ3HALF_Msk         (0x01 << ADC_IF_SEQ3HALF_Pos)
#define ADC_IF_SEQ3FULL_Pos         27
#define ADC_IF_SEQ3FULL_Msk         (0x01 << ADC_IF_SEQ3FULL_Pos)
#define ADC_IF_SEQ3CMPMAX_Pos       28
#define ADC_IF_SEQ3CMPMAX_Msk       (0x01 << ADC_IF_SEQ3CMPMAX_Pos)
#define ADC_IF_SEQ3CMPMIN_Pos       29
#define ADC_IF_SEQ3CMPMIN_Msk       (0x01 << ADC_IF_SEQ3CMPMIN_Pos)

#define ADC_SR_EOC_Pos              0       //End Of Conversion，ADC开始转换时硬件清零
#define ADC_SR_EOC_Msk              (0x01 << ADC_SR_EOC_Pos)
#define ADC_SR_OVF_Pos              1       //FIFO Overflow
#define ADC_SR_OVF_Msk              (0x01 << ADC_SR_OVF_Pos)
#define ADC_SR_HALF_Pos             2       //FIFO Half Full
#define ADC_SR_HALF_Msk             (0x01 << ADC_SR_HALF_Pos)
#define ADC_SR_FULL_Pos             3       //FIFO Full
#define ADC_SR_FULL_Msk             (0x01 << ADC_SR_FULL_Pos)
#define ADC_SR_EMPTY_Pos            4       //FIFO Empty
#define ADC_SR_EMPTY_Msk            (0x01 << ADC_SR_EMPTY_Pos)
#define ADC_SR_LEVEL_Pos            5       //FIFO中数据个数，1~7：FIFO中有1~7个数据    0 FIFO Empty时表示0个数据，FIFO Full时表示8个数据
#define ADC_SR_LEVEL_Msk            (0x07 << ADC_SR_LEVEL_Pos)

