RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define ADC_DR_VALUE_Pos            0
#define ADC_DR_VALUE_Msk            (0xFFF<< ADC_DR_VALUE_Pos)
#define ADC_DR_CHNUM_Pos            12
#define ADC_DR_CHNUM_Msk            (0x0F << ADC_DR_CHNUM_Pos)

#define ADC_CMP_MAX_Pos             0
#define ADC_CMP_MAX_Msk             (0xFFF<< ADC_CMP_MAX_Pos)
#define ADC_CMP_MIN_Pos             16
#define ADC_CMP_MIN_Msk             (0xFFF<< ADC_CMP_MIN_Pos)

#define ADC_SEQCHN0_SEQ0_Pos        0       //序列0通道选择，8位对应8个通道，bitx置位表示将通道x加入序列0
#define ADC_SEQCHN0_SEQ0_Msk        (0xFFF << ADC_SEQCHN0_SEQ0_Pos)
#define ADC_SEQCHN0_SEQ1_Pos        16
#define ADC_SEQCHN0_SEQ1_Msk        (0xFFF << ADC_SEQCHN0_SEQ1_Pos)

#define ADC_SEQCHN1_SEQ2_Pos        0
#define ADC_SEQCHN1_SEQ2_Msk        (0xFFF << ADC_SEQCHN1_SEQ2_Pos)
#define ADC_SEQCHN1_SEQ3_Pos        16
#define ADC_SEQCHN1_SEQ3_Msk        (0xFFF << ADC_SEQCHN1_SEQ3_Pos)

#define ADC_SEQTRG_SEQ0_Pos         0       //序列0触发选择，0x01 CPU   0x02 TIMR2   0x03 TIMR3   0x04-07 ADC_TRIG0-3引脚   0x10-1F PWM0A-PWM7B
#define ADC_SEQTRG_SEQ0_Msk         (0x1F << ADC_SEQTRG_SEQ0_Pos)
#define ADC_SEQTRG_SEQ1_Pos         8
#define ADC_SEQTRG_SEQ1_Msk         (0x1F << ADC_SEQTRG_SEQ1_Pos)
#define ADC_SEQTRG_SEQ2_Pos         16
#define ADC_SEQTRG_SEQ2_Msk         (0x1F << ADC_SEQTRG_SEQ2_Pos)
#define ADC_SEQTRG_SEQ3_Pos         24
#define ADC_SEQTRG_SEQ3_Msk         (0x1F << ADC_SEQTRG_SEQ3_Pos)

#define ADC_SEQCOV_SEQ0_Pos         0       //序列0转换次数，0x00 转换1次
#define ADC_SEQCOV_SEQ0_Msk         (0xFF << ADC_SEQCOV_SEQ0_Pos)
#define ADC_SEQCOV_SEQ1_Pos         8
#define ADC_SEQCOV_SEQ1_Msk         (0xFF << ADC_SEQCOV_SEQ1_Pos)
#define ADC_SEQCOV_SEQ2_Pos         16
#define ADC_SEQCOV_SEQ2_Msk         (0xFF << ADC_SEQCOV_SEQ2_Pos)
#define ADC_SEQCOV_SEQ3_Pos         24
#define ADC_SEQCOV_SEQ3_Msk         (0xFF << ADC_SEQCOV_SEQ3_Pos)

#define ADC_SEQSMP_SEQ0_Pos         0       //序列0采样时间，0/1/2/3 采样建立时间保持1/2/4/8个采样时钟周期
#define ADC_SEQSMP_SEQ0_Msk         (0x07 << ADC_SEQSMP_SEQ0_Pos)
#define ADC_SEQSMP_SEQ1_Pos         4
#define ADC_SEQSMP_SEQ1_Msk         (0x07 << ADC_SEQSMP_SEQ1_Pos)
#define ADC_SEQSMP_SEQ2_Pos         8
#define ADC_SEQSMP_SEQ2_Msk         (0x07 << ADC_SEQSMP_SEQ2_Pos)
#define ADC_SEQSMP_SEQ3_Pos         12
#define ADC_SEQSMP_SEQ3_Msk         (0x07 << ADC_SEQSMP_SEQ3_Pos)

#define ADC_CR2_ENLDO_Pos           2       //该信号由0变为1后，至少需要等20us才能使能ADC（将ADC_EN置为1）
#define ADC_CR2_ENLDO_Msk           (0x01 << ADC_CR2_ENLDO_Pos)
#define ADC_CR2_BITS_Pos            6       //ADC位数，0 6位   1 8位   2 10位   3 12位
#define ADC_CR2_BITS_Msk            (0x03 << ADC_CR2_BITS_Pos)

#define ADC_CALIB_RESET_Pos         0       //校准模块复位，至少保持2个采样周期
#define ADC_CALIB_RESET_Msk         (0x01 << ADC_CALIB_RESET_Pos)
#define ADC_CALIB_START_Pos         1       //写1启动校准，硬件清零
#define ADC_CALIB_START_Msk         (0x01 << ADC_CALIB_START_Pos)
#define ADC_CALIB_BUSY_Pos          2       //1 正在执行校准
#define ADC_CALIB_BUSY_Msk          (0x01 << ADC_CALIB_BUSY_Pos)
#define ADC_CALIB_LOAD_Pos          3       //写1将校准结果加载到ADC中，硬件清零
#define ADC_CALIB_LOAD_Msk          (0x01 << ADC_CALIB_LOAD_Pos)
#define ADC_CALIB_BYPASS_Pos        4       //1 旁路校准模块
#define ADC_CALIB_BYPASS_Msk        (0x01 << ADC_CALIB_BYPASS_Pos)
#define ADC_CALIB_RESULT_Pos        8
#define ADC_CALIB_RESULT_Msk        (0x7F << ADC_CALIB_RESULT_Pos)




typedef struct {
    __IO uint32_t CR;

    __IO uint32_t OCR;

    __IO uint32_t BRKCR;

    __IO uint32_t BRKIN;

         uint32_t RESERVED[4];

    __IO uint32_t PERIOD;                   //[15:0] 周期

    __IO uint32_t CMPA;                     //[15:0] A路翻转点比较值

    __IO uint32_t CMPB;                     //[15:0] B路翻转点比较值

    __IO uint32_t DZA;                      //[9:0] 死区

    __IO uint32_t DZB;

    __IO uint32_t CMPA2;                    //非对称中心对齐模式下，向下计数过程中，A路翻转点比较值

    __IO uint32_t CMPB2;                    //非对称中心对齐模式下，向下计数过程中，B路翻转点比较值

         uint32_t RESERVED2[5];

    __IO uint32_t OVFTRG;

    __IO uint32_t CMPTRG;

         uint32_t RESERVED3[2];

    __IO uint32_t EVMUX;

    __IO uint32_t EVMSK;

         uint32_t RESERVED4[2];

    __IO uint32_t IE;

    __IO uint32_t IF;

    __IO uint32_t VALUE;

    __IO uint32_t SR;
} PWM_TypeDef;


#define PWM_CR_MODE_Pos             0       //0 边沿对齐模式   1 中心对齐模式   2 非对称中心对齐模式
#define PWM_CR_MODE_Msk             (0x03 << PWM_CR_MODE_Pos)
#define PWM_CR_MULT_Pos             2       //0 单次计数模式   1 多次计数模式
#define PWM_CR_MULT_Msk             (0x01 << PWM_CR_MULT_Pos)
#define PWM_CR_DIR_Pos              3       //计数器计数方向， 0 向上计数   1 向下计数
#define PWM_CR_DIR_Msk              (0x01 << PWM_CR_DIR_Pos)
#define PWM_CR_CLKSRC_Pos           4       //计数时钟源，0 系统时钟   1 PWM_PULSE0输入   2 PWM_PULSE1输入
#define PWM_CR_CLKSRC_Msk           (0x03 << PWM_CR_CLKSRC_Pos)
#define PWM_CR_CLKDIV_Pos           6       //计数时钟预分频， 0 1分频   1 2分频   ...   1023 1024分频
#define PWM_CR_CLKDIV_Msk           (0x3FF<< PWM_CR_CLKDIV_Pos)
#define PWM_CR_RPTNUM_Pos           16      //计数器溢出多少次执行一次寄存器重载，0 1次   1 2次   ...   255 256次
#define PWM_CR_RPTNUM_Msk           (0xFF << PWM_CR_RPTNUM_Pos)

#define PWM_OCR_IDLEA_Pos           0       //A路空闲时输出电平
#define PWM_OCR_IDLEA_Msk           (0x01 << PWM_OCR_IDLEA_Pos)
#define PWM_OCR_IDLEB_Pos           1       //B路空闲时输出电平
#define PWM_OCR_IDLEB_Msk           (0x01 << PWM_OCR_IDLEB_Pos)
#define PWM_OCR_IDLEAN_Pos          2       //AN路空闲时输出电平
#define PWM_OCR_IDLEAN_Msk          (0x01 << PWM_OCR_IDLEAN_Pos)
#define PWM_OCR_IDLEBN_Pos          3       //BN路空闲时输出电平
#define PWM_OCR_IDLEBN_Msk          (0x01 << PWM_OCR_IDLEBN_Pos)
#define PWM_OCR_INVA_Pos            4       //A路输出是否取反
#define PWM_OCR_INVA_Msk            (0x01 << PWM_OCR_INVA_Pos)
#define PWM_OCR_INVB_Pos            5       //B路输出是否取反
#define PWM_OCR_INVB_Msk            (0x01 << PWM_OCR_INVB_Pos)
#define PWM_OCR_INVAN_Pos           6       //AN路输出是否取反
#define PWM_OCR_INVAN_Msk           (0x01 << PWM_OCR_INVAN_Pos)
#define PWM_OCR_INVBN_Pos           7       //BN路输出是否取反
#define PWM_OCR_INVBN_Msk           (0x01 << PWM_OCR_INVBN_Pos)

#define PWM_BRKCR_OUTA_Pos          0       //刹车状态下A路输出电平
#define PWM_BRKCR_OUTA_Msk          (0x01 << PWM_BRKCR_OUTA_Pos)
#define PWM_BRKCR_OFFA_Pos          1       //刹车信号撤销时A路输出，0 立即恢复正常输出   1 保持当前输出直到计数器溢出再恢复正常输出
#define PWM_BRKCR_OFFA_Msk          (0x01 << PWM_BRKCR_OFFA_Pos)
#define PWM_BRKCR_OUTB_Pos          4       //刹车状态下B路输出电平
#define PWM_BRKCR_OUTB_Msk          (0x01 << PWM_BRKCR_OUTB_Pos)
#define PWM_BRKCR_OFFB_Pos          5       //刹车信号撤销时B路输出，0 立即恢复正常输出   1 保持当前输出直到计数器溢出再恢复正常输出
#define PWM_BRKCR_OFFB_Msk          (0x01 << PWM_BRKCR_OFFB_Pos)
#define PWM_BRKCR_OUTAN_Pos         8       //刹车状态下AN路输出电平
#define PWM_BRKCR_OUTAN_Msk         (0x01 << PWM_BRKCR_OUTAN_Pos)
#define PWM_BRKCR_OUTBN_Pos         9       //刹车状态下BN路输出电平
#define PWM_BRKCR_OUTBN_Msk         (0x01 << PWM_BRKCR_OUTBN_Pos)
#define PWM_BRKCR_STPCNT_Pos        10      //刹车状态下是否停止计数器，1 停止计数器   0 继续计数
#define PWM_BRKCR_STPCNT_Msk        (0x01 << PWM_BRKCR_STPCNT_Pos)
#define PWM_BRKCR_ACTIVE_Pos        17      //当前是否处于刹车状态
#define PWM_BRKCR_ACTIVE_Msk        (0x01 << PWM_BRKCR_ACTIVE_Pos)

#define PWM_BRKIN_BRK0A_Pos         0       //A路是否受刹车输入PWM_BRK0影响
#define PWM_BRKIN_BRK0A_Msk         (0x01 << PWM_BRKIN_BRK0A_Pos)
#define PWM_BRKIN_BRK1A_Pos         1
#define PWM_BRKIN_BRK1A_Msk         (0x01 << PWM_BRKIN_BRK1A_Pos)
#define PWM_BRKIN_BRK2A_Pos         2
#define PWM_BRKIN_BRK2A_Msk         (0x01 << PWM_BRKIN_BRK2A_Pos)
#define PWM_BRKIN_BRK0B_Pos         4
#define PWM_BRKIN_BRK0B_Msk         (0x01 << PWM_BRKIN_BRK0B_Pos)
#define PWM_BRKIN_BRK1B_Pos         5
#define PWM_BRKIN_BRK1B_Msk         (0x01 << PWM_BRKIN_BRK1B_Pos)
#define PWM_BRKIN_BRK2B_Pos         6
#define PWM_BRKIN_BRK2B_Msk         (0x01 << PWM_BRKIN_BRK2B_Pos)

