RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define PWM_OVFTRG_UPEN_Pos         0       //计数器向上溢出Trigger使能
#define PWM_OVFTRG_UPEN_Msk         (0x01 << PWM_OVFTRG_UPEN_Pos)
#define PWM_OVFTRG_DNEN_Pos         1       //计数器向下溢出Trigger使能
#define PWM_OVFTRG_DNEN_Msk         (0x01 << PWM_OVFTRG_DNEN_Pos)
#define PWM_OVFTRG_MUX_Pos          2       //Trigger输出到哪一路，0 trig[0]   1 trig[1]   2 trig[2]   ...   7 trig[7]
#define PWM_OVFTRG_MUX_Msk          (0x07 << PWM_OVFTRG_MUX_Pos)

#define PWM_CMPTRG_CMP_Pos          0       //计数器值与此比较值相等时产生Trigger信号
#define PWM_CMPTRG_CMP_Msk          (0xFFFF<<PWM_CMPTRG_CMP_Pos)
#define PWM_CMPTRG_EN_Pos           16
#define PWM_CMPTRG_EN_Msk           (0x01 << PWM_CMPTRG_EN_Pos)
#define PWM_CMPTRG_MUX_Pos          17      //Trigger输出到哪一路，0 trig[0]   1 trig[1]   2 trig[2]   ...   7 trig[7]
#define PWM_CMPTRG_MUX_Msk          (0x07 << PWM_CMPTRG_MUX_Pos)
#define PWM_CMPTRG_WIDTH_Pos        20      //Trigger输出信号宽度，0 无输出   1 4个计数时钟   2 8个计数时钟   ...   63 252个计数时钟
#define PWM_CMPTRG_WIDTH_Msk        (0x3F << PWM_CMPTRG_WIDTH_Pos)
#define PWM_CMPTRG_DIR_Pos          28      //0 向上计数过程中产生Trigger   1 向下计数过程中产生Trigger
#define PWM_CMPTRG_DIR_Msk          (0x01 << PWM_CMPTRG_DIR_Pos)
#define PWM_CMPTRG_ATP_Pos          29      //AD触发信号在所挖坑中的位置：0 0/8处   1 1/8处   ...   7 7/8处
#define PWM_CMPTRG_ATP_Msk          (0x07u<< PWM_CMPTRG_ATP_Pos)

#define PWM_EVMUX_START_Pos         0
#define PWM_EVMUX_START_Msk         (0x07 << PWM_EVMUX_START_Pos)
#define PWM_EVMUX_STOP_Pos          4
#define PWM_EVMUX_STOP_Msk          (0x07 << PWM_EVMUX_STOP_Pos)
#define PWM_EVMUX_PAUSE_Pos         8
#define PWM_EVMUX_PAUSE_Msk         (0x07 << PWM_EVMUX_PAUSE_Pos)
#define PWM_EVMUX_RELOAD_Pos        12
#define PWM_EVMUX_RELOAD_Msk        (0x07 << PWM_EVMUX_RELOAD_Pos)
#define PWM_EVMUX_MASKA_Pos         16
#define PWM_EVMUX_MASKA_Msk         (0x07 << PWM_EVMUX_MASKA_Pos)
#define PWM_EVMUX_MASKB_Pos         20
#define PWM_EVMUX_MASKB_Msk         (0x07 << PWM_EVMUX_MASKB_Pos)
#define PWM_EVMUX_MASKAN_Pos        24
#define PWM_EVMUX_MASKAN_Msk        (0x07 << PWM_EVMUX_MASKAN_Pos)
#define PWM_EVMUX_MASKBN_Pos        28
#define PWM_EVMUX_MASKBN_Msk        (0x07 << PWM_EVMUX_MASKBN_Pos)

#define PWM_EVMSK_OUTA_Pos          0
#define PWM_EVMSK_OUTA_Msk          (0x01 << PWM_EVMSK_OUTA_Pos)
#define PWM_EVMSK_OUTB_Pos          1
#define PWM_EVMSK_OUTB_Msk          (0x01 << PWM_EVMSK_OUTB_Pos)
#define PWM_EVMSK_OUTAN_Pos         2
#define PWM_EVMSK_OUTAN_Msk         (0x01 << PWM_EVMSK_OUTAN_Pos)
#define PWM_EVMSK_OUTBN_Pos         3
#define PWM_EVMSK_OUTBN_Msk         (0x01 << PWM_EVMSK_OUTBN_Pos)
#define PWM_EVMSK_IMME_Pos          4       //1 MASK立即生效   0 计数器溢出时生效
#define PWM_EVMSK_IMME_Msk          (0x01 << PWM_EVMSK_IMME_Pos)
#define PWM_EVMSK_STPCLR_Pos        8       //外部事件导致计数器停止时计数器是否清零，1 清零   0 保持当前值
#define PWM_EVMSK_STPCLR_Msk        (0x01 << PWM_EVMSK_STPCLR_Pos)

#define PWM_IE_UPOVF_Pos            0       //向上计数时计数器溢出中断使能
#define PWM_IE_UPOVF_Msk            (0x01 << PWM_IE_UPOVF_Pos)
#define PWM_IE_DNOVF_Pos            1       //向下计数时计数器溢出中断使能
#define PWM_IE_DNOVF_Msk            (0x01 << PWM_IE_DNOVF_Pos)
#define PWM_IE_UPCMPA_Pos           2       //向上计数时计数器值与CMPA相等中断使能
#define PWM_IE_UPCMPA_Msk           (0x01 << PWM_IE_UPCMPA_Pos)
#define PWM_IE_UPCMPB_Pos           3       //向上计数时计数器值与CMPB相等中断使能
#define PWM_IE_UPCMPB_Msk           (0x01 << PWM_IE_UPCMPB_Pos)
#define PWM_IE_DNCMPA_Pos           4       //向下计数时计数器值与CMPA相等中断使能
#define PWM_IE_DNCMPA_Msk           (0x01 << PWM_IE_DNCMPA_Pos)
#define PWM_IE_DNCMPB_Pos           5       //向下计数时计数器值与CMPB相等中断使能
#define PWM_IE_DNCMPB_Msk           (0x01 << PWM_IE_DNCMPB_Pos)

#define PWM_IF_UPOVF_Pos            0
#define PWM_IF_UPOVF_Msk            (0x01 << PWM_IF_UPOVF_Pos)
#define PWM_IF_DNOVF_Pos            1
#define PWM_IF_DNOVF_Msk            (0x01 << PWM_IF_DNOVF_Pos)
#define PWM_IF_UPCMPA_Pos           2
#define PWM_IF_UPCMPA_Msk           (0x01 << PWM_IF_UPCMPA_Pos)
#define PWM_IF_UPCMPB_Pos           3
#define PWM_IF_UPCMPB_Msk           (0x01 << PWM_IF_UPCMPB_Pos)
#define PWM_IF_DNCMPA_Pos           4
#define PWM_IF_DNCMPA_Msk           (0x01 << PWM_IF_DNCMPA_Pos)
#define PWM_IF_DNCMPB_Pos           5
#define PWM_IF_DNCMPB_Msk           (0x01 << PWM_IF_DNCMPB_Pos)

#define PWM_SR_STAT_Pos             0       //0 IDLE   1 ACTIVE   2 PAUSE
#define PWM_SR_STAT_Msk             (0x03 << PWM_SR_STAT_Pos)
#define PWM_SR_DIR_Pos              4       //0 向上计数   1 向下计数
#define PWM_SR_DIR_Msk              (0x01 << PWM_SR_DIR_Pos)
#define PWM_SR_OUTA_Pos             5
#define PWM_SR_OUTA_Msk             (0x01 << PWM_SR_OUTA_Pos)
#define PWM_SR_OUTB_Pos             6
#define PWM_SR_OUTB_Msk             (0x01 << PWM_SR_OUTB_Pos)
#define PWM_SR_OUTAN_Pos            7
#define PWM_SR_OUTAN_Msk            (0x01 << PWM_SR_OUTAN_Pos)
#define PWM_SR_OUTBN_Pos            8
#define PWM_SR_OUTBN_Msk            (0x01 << PWM_SR_OUTBN_Pos)


typedef struct {
    __IO uint32_t START;

    __IO uint32_t SWBRK;                    //Software Brake，软件刹车

    __IO uint32_t RESET;

    union {
        __IO uint32_t RELOADEN;

        __IO uint32_t RESTART;
    };

    __IO uint32_t PULSE;

    __IO uint32_t FILTER;                   //外部信号滤波，0 无滤波   1 4个PCLK周期   2 8个PCLK周期   3 16个PCLK周期

    __IO uint32_t BRKPOL;                   //刹车信号极性，

    __IO uint32_t BRKIE;

    union {
        __IO uint32_t BRKIF;

        __IO uint32_t BRKSR;
    };

    __IO uint32_t EVSR;
} PWMG_TypeDef;


#define PWMG_START_PWM0_Pos         0
#define PWMG_START_PWM0_Msk         (0x01 << PWMG_START_PWM0_Pos)
#define PWMG_START_PWM1_Pos         1
#define PWMG_START_PWM1_Msk         (0x01 << PWMG_START_PWM1_Pos)
#define PWMG_START_PWM2_Pos         2
#define PWMG_START_PWM2_Msk         (0x01 << PWMG_START_PWM2_Pos)
#define PWMG_START_PWM3_Pos         3
#define PWMG_START_PWM3_Msk         (0x01 << PWMG_START_PWM3_Pos)
#define PWMG_START_PWM4_Pos         4
#define PWMG_START_PWM4_Msk         (0x01 << PWMG_START_PWM4_Pos)

#define PWMG_SWBRK_PWM0A_Pos        0
#define PWMG_SWBRK_PWM0A_Msk        (0x01 << PWMG_SWBRK_PWM0A_Pos)
#define PWMG_SWBRK_PWM1A_Pos        1
#define PWMG_SWBRK_PWM1A_Msk        (0x01 << PWMG_SWBRK_PWM1A_Pos)
#define PWMG_SWBRK_PWM2A_Pos        2
#define PWMG_SWBRK_PWM2A_Msk        (0x01 << PWMG_SWBRK_PWM2A_Pos)
#define PWMG_SWBRK_PWM3A_Pos        3
#define PWMG_SWBRK_PWM3A_Msk        (0x01 << PWMG_SWBRK_PWM3A_Pos)
#define PWMG_SWBRK_PWM4A_Pos        4
#define PWMG_SWBRK_PWM4A_Msk        (0x01 << PWMG_SWBRK_PWM4A_Pos)
#define PWMG_SWBRK_PWM0B_Pos        8
#define PWMG_SWBRK_PWM0B_Msk        (0x01 << PWMG_SWBRK_PWM0B_Pos)
#define PWMG_SWBRK_PWM1B_Pos        9
#define PWMG_SWBRK_PWM1B_Msk        (0x01 << PWMG_SWBRK_PWM1B_Pos)
#define PWMG_SWBRK_PWM2B_Pos        10
#define PWMG_SWBRK_PWM2B_Msk        (0x01 << PWMG_SWBRK_PWM2B_Pos)
#define PWMG_SWBRK_PWM3B_Pos        11
#define PWMG_SWBRK_PWM3B_Msk        (0x01 << PWMG_SWBRK_PWM3B_Pos)
#define PWMG_SWBRK_PWM4B_Pos        12
#define PWMG_SWBRK_PWM4B_Msk        (0x01 << PWMG_SWBRK_PWM4B_Pos)

#define PWMG_RESET_PWM0_Pos         0
#define PWMG_RESET_PWM0_Msk         (0x01 << PWMG_RESET_PWM0_Pos)
#define PWMG_RESET_PWM1_Pos         1
#define PWMG_RESET_PWM1_Msk         (0x01 << PWMG_RESET_PWM1_Pos)
#define PWMG_RESET_PWM2_Pos         2
#define PWMG_RESET_PWM2_Msk         (0x01 << PWMG_RESET_PWM2_Pos)
#define PWMG_RESET_PWM3_Pos         3
#define PWMG_RESET_PWM3_Msk         (0x01 << PWMG_RESET_PWM3_Pos)
#define PWMG_RESET_PWM4_Pos         4
#define PWMG_RESET_PWM4_Msk         (0x01 << PWMG_RESET_PWM4_Pos)

#define PWMG_RELOADEN_PWM0_Pos      0
#define PWMG_RELOADEN_PWM0_Msk      (0x01 << PWMG_RELOADEN_PWM0_Pos)
#define PWMG_RELOADEN_PWM1_Pos      1
#define PWMG_RELOADEN_PWM1_Msk      (0x01 << PWMG_RELOADEN_PWM1_Pos)
#define PWMG_RELOADEN_PWM2_Pos      2
#define PWMG_RELOADEN_PWM2_Msk      (0x01 << PWMG_RELOADEN_PWM2_Pos)
#define PWMG_RELOADEN_PWM3_Pos      3
#define PWMG_RELOADEN_PWM3_Msk      (0x01 << PWMG_RELOADEN_PWM3_Pos)
#define PWMG_RELOADEN_PWM4_Pos      4
#define PWMG_RELOADEN_PWM4_Msk      (0x01 << PWMG_RELOADEN_PWM4_Pos)

#define PWMG_RESTART_PWM0_Pos       8
#define PWMG_RESTART_PWM0_Msk       (0x01 << PWMG_RESTART_PWM0_Pos)
#define PWMG_RESTART_PWM1_Pos       9
#define PWMG_RESTART_PWM1_Msk       (0x01 << PWMG_RESTART_PWM1_Pos)
#define PWMG_RESTART_PWM2_Pos       10
#define PWMG_RESTART_PWM2_Msk       (0x01 << PWMG_RESTART_PWM2_Pos)
#define PWMG_RESTART_PWM3_Pos       11
#define PWMG_RESTART_PWM3_Msk       (0x01 << PWMG_RESTART_PWM3_Pos)
#define PWMG_RESTART_PWM4_Pos       12
#define PWMG_RESTART_PWM4_Msk       (0x01 << PWMG_RESTART_PWM4_Pos)

