RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define PWMG_PULSE_EDGE0_Pos        0       //PWM_PULSE0 计数边沿，0 上升沿   1 下降沿
#define PWMG_PULSE_EDGE0_Msk        (0x01 << PWMG_PULSE_EDGE0_Pos)
#define PWMG_PULSE_EDGE1_Pos        1
#define PWMG_PULSE_EDGE1_Msk        (0x01 << PWMG_PULSE_EDGE1_Pos)

#define PWMG_BRKPOL_BRK0_Pos        0       //PWMG_BRK0 刹车信号极性，0 低电平刹车   1 高电平刹车
#define PWMG_BRKPOL_BRK0_Msk        (0x01 << PWMG_BRKPOL_BRK0_Pos)
#define PWMG_BRKPOL_BRK1_Pos        1
#define PWMG_BRKPOL_BRK1_Msk        (0x01 << PWMG_BRKPOL_BRK1_Pos)
#define PWMG_BRKPOL_BRK2_Pos        2
#define PWMG_BRKPOL_BRK2_Msk        (0x01 << PWMG_BRKPOL_BRK2_Pos)

#define PWMG_BRKIE_BRK0_Pos         0
#define PWMG_BRKIE_BRK0_Msk         (0x01 << PWMG_BRKIE_BRK0_Pos)
#define PWMG_BRKIE_BRK1_Pos         1
#define PWMG_BRKIE_BRK1_Msk         (0x01 << PWMG_BRKIE_BRK1_Pos)
#define PWMG_BRKIE_BRK2_Pos         2
#define PWMG_BRKIE_BRK2_Msk         (0x01 << PWMG_BRKIE_BRK2_Pos)

#define PWMG_BRKIF_BRK0_Pos         0
#define PWMG_BRKIF_BRK0_Msk         (0x01 << PWMG_BRKIF_BRK0_Pos)
#define PWMG_BRKIF_BRK1_Pos         1
#define PWMG_BRKIF_BRK1_Msk         (0x01 << PWMG_BRKIF_BRK1_Pos)
#define PWMG_BRKIF_BRK2_Pos         2
#define PWMG_BRKIF_BRK2_Msk         (0x01 << PWMG_BRKIF_BRK2_Pos)

#define PWMG_BRKSR_BRK0_Pos         4       //刹车引脚电平值
#define PWMG_BRKSR_BRK0_Msk         (0x01 << PWMG_BRKSR_BRK0_Pos)
#define PWMG_BRKSR_BRK1_Pos         5
#define PWMG_BRKSR_BRK1_Msk         (0x01 << PWMG_BRKSR_BRK1_Pos)
#define PWMG_BRKSR_BRK2_Pos         6
#define PWMG_BRKSR_BRK2_Msk         (0x01 << PWMG_BRKSR_BRK2_Pos)

#define PWMG_EVSR_EV0_Pos           0       //外部事件信号电平值
#define PWMG_EVSR_EV0_Msk           (0x01 << PWMG_EVSR_EV0_Pos)
#define PWMG_EVSR_EV1_Pos           1
#define PWMG_EVSR_EV1_Msk           (0x01 << PWMG_EVSR_EV1_Pos)
#define PWMG_EVSR_EV2_Pos           2
#define PWMG_EVSR_EV2_Msk           (0x01 << PWMG_EVSR_EV2_Pos)
#define PWMG_EVSR_EV3_Pos           3
#define PWMG_EVSR_EV3_Msk           (0x01 << PWMG_EVSR_EV3_Pos)
#define PWMG_EVSR_EV4_Pos           4
#define PWMG_EVSR_EV4_Msk           (0x01 << PWMG_EVSR_EV4_Pos)
#define PWMG_EVSR_EV5_Pos           5
#define PWMG_EVSR_EV5_Msk           (0x01 << PWMG_EVSR_EV5_Pos)
#define PWMG_EVSR_EV6_Pos           6
#define PWMG_EVSR_EV6_Msk           (0x01 << PWMG_EVSR_EV6_Pos)




typedef struct {
    __IO uint32_t CR;

    __IO uint32_t POSCNT;                   //[15:0] 位置计数器
    __IO uint32_t MAXCNT;                   //[15:0] 最大计数值

         uint32_t RESERVED[5];

    __IO uint32_t IE;                       //Interrupt Enable，为0时IF相应位不置位

    __IO uint32_t IM;                       //Interrupt Mask，为0时即使IF相应位置位也不触发 QEI_IRQn 中断

    __O  uint32_t IC;                       //Interrupt Clear

    __I  uint32_t IF;                       //Interrupt Flag

    __IO uint32_t IFOV;                     //interrupt Interrupt Overrun
} QEI_TypeDef;


#define QEI_CR_ENA_Pos              0
#define QEI_CR_ENA_Msk              (0x01 << QEI_CR_ENA_Pos)
#define QEI_CR_ABSWAP_Pos           4       //1 A、B引脚交换
#define QEI_CR_ABSWAP_Msk           (0x01 << QEI_CR_ABSWAP_Pos)
#define QEI_CR_X2X4_Pos             5       //0 X2计数模式      1 X4计数模式
#define QEI_CR_X2X4_Msk             (0x01 << QEI_CR_X2X4_Pos)
#define QEI_CR_RSTSRC_Pos           6       //Reset Source      0 计数匹配复位        1 索引信号复位
#define QEI_CR_RSTSRC_Msk           (0x01 << QEI_CR_RSTSRC_Pos)
#define QEI_CR_MODE_Pos             7       //工作模式选择        1 QEI模式
#define QEI_CR_MODE_Msk             (0x01 << QEI_CR_MODE_Pos)
#define QEI_CR_INDEX_Pos            9       //0 索引引脚为低电平        1 索引引脚为高电平
#define QEI_CR_INDEX_Msk            (0x01 << QEI_CR_INDEX_Pos)
#define QEI_CR_PAUSE_Pos            10      //1 空闲模式停止位
#define QEI_CR_PAUSE_Msk            (0x01 << QEI_CR_PAUSE_Pos)

#define QEI_IE_INDEX_Pos            0       //检测到Index脉冲
#define QEI_IE_INDEX_Msk            (0x01 << QEI_IE_INDEX_Pos)
#define QEI_IE_MATCH_Pos            1       //POSCNT递增到与MAXCNT相等，或POSCNT从MAXCNT递减到0
#define QEI_IE_MATCH_Msk            (0x01 << QEI_IE_MATCH_Pos)
#define QEI_IE_CNTOV_Pos            2       //Counter Overrun，计数器溢出
#define QEI_IE_CNTOV_Msk            (0x01 << QEI_IE_CNTOV_Pos)
#define QEI_IE_ERROR_Pos            3       //计数器错误
#define QEI_IE_ERROR_Msk            (0x01 << QEI_IE_ERROR_Pos)

#define QEI_IM_INDEX_Pos            0
#define QEI_IM_INDEX_Msk            (0x01 << QEI_IM_INDEX_Pos)
#define QEI_IM_MATCH_Pos            1
#define QEI_IM_MATCH_Msk            (0x01 << QEI_IM_MATCH_Pos)
#define QEI_IM_CNTOV_Pos            2
#define QEI_IM_CNTOV_Msk            (0x01 << QEI_IM_CNTOV_Pos)
#define QEI_IM_ERROR_Pos            3
#define QEI_IM_ERROR_Msk            (0x01 << QEI_IM_ERROR_Pos)

#define QEI_IC_INDEX_Pos            0
#define QEI_IC_INDEX_Msk            (0x01 << QEI_IC_INDEX_Pos)
#define QEI_IC_MATCH_Pos            1
#define QEI_IC_MATCH_Msk            (0x01 << QEI_IC_MATCH_Pos)
#define QEI_IC_CNTOV_Pos            2
#define QEI_IC_CNTOV_Msk            (0x01 << QEI_IC_CNTOV_Pos)
#define QEI_IC_ERROR_Pos            3
#define QEI_IC_ERROR_Msk            (0x01 << QEI_IC_ERROR_Pos)

#define QEI_IF_INDEX_Pos            0
#define QEI_IF_INDEX_Msk            (0x01 << QEI_IF_INDEX_Pos)
#define QEI_IF_MATCH_Pos            1
#define QEI_IF_MATCH_Msk            (0x01 << QEI_IF_MATCH_Pos)
#define QEI_IF_CNTOV_Pos            2
#define QEI_IF_CNTOV_Msk            (0x01 << QEI_IF_CNTOV_Pos)
#define QEI_IF_ERROR_Pos            3
#define QEI_IF_ERROR_Msk            (0x01 << QEI_IF_ERROR_Pos)

#define QEI_IFOV_INDEX_Pos          0
#define QEI_IFOV_INDEX_Msk          (0x01 << QEI_IFOV_INDEX_Pos)
#define QEI_IFOV_MATCH_Pos          1
#define QEI_IFOV_MATCH_Msk          (0x01 << QEI_IFOV_MATCH_Pos)
#define QEI_IFOV_CNTOV_Pos          2
#define QEI_IFOV_CNTOV_Msk          (0x01 << QEI_IFOV_CNTOV_Pos)
#define QEI_IFOV_ERROR_Pos          3
#define QEI_IFOV_ERROR_Msk          (0x01 << QEI_IFOV_ERROR_Pos)




typedef struct {
    __IO uint32_t EN;                       //[0] ENABLE

    __IO uint32_t IE;                       //只有为1时，IF[CHx]在DMA传输结束时才能变为1，否则将一直保持在0

    __IO uint32_t IM;                       //当为1时，即使IF[CHx]为1，dma_int也不会因此变1

    __IO uint32_t IF;                       //写1清零

    __IO uint32_t DSTSGIE;                  //只在Scatter Gather模式下使用

    __IO uint32_t DSTSGIM;                  //只在Scatter Gather模式下使用

    __IO uint32_t DSTSGIF;                  //只在Scatter Gather模式下使用

