RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
    __IO uint32_t SRCSGIE;                  //只在Scatter Gather模式下使用

    __IO uint32_t SRCSGIM;                  //只在Scatter Gather模式下使用

    __IO uint32_t SRCSGIF;                  //只在Scatter Gather模式下使用

         uint32_t RESERVED[5];

    __IO uint32_t PRI;                      //优先级，1 高优先级    0 低优先级

    struct {
        __IO uint32_t CR;

        __IO uint32_t AM;                   //Adress Mode

        __IO uint32_t DST;

        __IO uint32_t DSTSGADDR1;           //只在Scatter Gather模式下使用

        __IO uint32_t DSTSGADDR2;           //只在Scatter Gather模式下使用

        __IO uint32_t DSTSGADDR3;           //只在Scatter Gather模式下使用

        __IO uint32_t MUX;

        __IO uint32_t SRC;

        __IO uint32_t SRCSGADDR1;           //只在Scatter Gather模式下使用

        __IO uint32_t SRCSGADDR2;           //只在Scatter Gather模式下使用

        __IO uint32_t SRCSGADDR3;           //只在Scatter Gather模式下使用

        __I  uint32_t DSTSR;

        __I  uint32_t SRCSR;

             uint32_t RESERVED[3];
    } CH[4];
} DMA_TypeDef;


#define DMA_IE_CH0_Pos              0
#define DMA_IE_CH0_Msk              (0x01 << DMA_IE_CH0_Pos)
#define DMA_IE_CH1_Pos              1
#define DMA_IE_CH1_Msk              (0x01 << DMA_IE_CH1_Pos)
#define DMA_IE_CH2_Pos              2
#define DMA_IE_CH2_Msk              (0x01 << DMA_IE_CH2_Pos)
#define DMA_IE_CH3_Pos              3
#define DMA_IE_CH3_Msk              (0x01 << DMA_IE_CH3_Pos)

#define DMA_IM_CH0_Pos              0
#define DMA_IM_CH0_Msk              (0x01 << DMA_IM_CH0_Pos)
#define DMA_IM_CH1_Pos              1
#define DMA_IM_CH1_Msk              (0x01 << DMA_IM_CH1_Pos)
#define DMA_IM_CH2_Pos              2
#define DMA_IM_CH2_Msk              (0x01 << DMA_IM_CH2_Pos)
#define DMA_IM_CH3_Pos              3
#define DMA_IM_CH3_Msk              (0x01 << DMA_IM_CH3_Pos)

#define DMA_IF_CH0_Pos              0
#define DMA_IF_CH0_Msk              (0x01 << DMA_IF_CH0_Pos)
#define DMA_IF_CH1_Pos              1
#define DMA_IF_CH1_Msk              (0x01 << DMA_IF_CH1_Pos)
#define DMA_IF_CH2_Pos              2
#define DMA_IF_CH2_Msk              (0x01 << DMA_IF_CH2_Pos)
#define DMA_IF_CH3_Pos              3
#define DMA_IF_CH3_Msk              (0x01 << DMA_IF_CH3_Pos)

#define DMA_CR_LEN_Pos              0       //此通道传输单位个数
#define DMA_CR_LEN_Msk              (0xFFFFF<< DMA_CR_LEN_Pos)
#define DMA_CR_RXEN_Pos             24      //软件启动传输，传输方向为SRC-->DST
#define DMA_CR_RXEN_Msk             (0x01 << DMA_CR_RXEN_Pos)
#define DMA_CR_TXEN_Pos             25      //软件启动传输，传输方向为DST-->SRC
#define DMA_CR_TXEN_Msk             (0x01 << DMA_CR_TXEN_Pos)
#define DMA_CR_AUTORE_Pos           26      //Auto Restart, 通道在传输完成后，是否自动重新启动
#define DMA_CR_AUTORE_Msk           (0x01 << DMA_CR_AUTORE_Pos)
#define DMA_CR_STEPOP_Pos           27      //Step Operation, 步进传输，触发1次传送1个单位数据
#define DMA_CR_STEPOP_Msk           (0x01 << DMA_CR_STEPOP_Pos)

#define DMA_AM_DSTAM_Pos            0       //Address Mode  0 地址固定    1 地址递增    2 scatter gather模式
#define DMA_AM_DSTAM_Msk            (0x03 << DMA_AM_DSTAM_Pos)
#define DMA_AM_DSTBIT_Pos           2       //传输位宽，0 字节    1 半字    2 字
#define DMA_AM_DSTBIT_Msk           (0x03 << DMA_AM_DSTBIT_Pos)
#define DMA_AM_DSTBURST_Pos         4       //传输类型，0 Single    1 Burst（Inc4）
#define DMA_AM_DSTBURST_Msk         (0x01 << DMA_AM_DSTBURST_Pos)
#define DMA_AM_SRCAM_Pos            8
#define DMA_AM_SRCAM_Msk            (0x03 << DMA_AM_SRCAM_Pos)
#define DMA_AM_SRCBIT_Pos           10
#define DMA_AM_SRCBIT_Msk           (0x03 << DMA_AM_SRCBIT_Pos)
#define DMA_AM_SRCBURST_Pos         12
#define DMA_AM_SRCBURST_Msk         (0x01 << DMA_AM_SRCBURST_Pos)

#define DMA_MUX_DSTHSSIG_Pos        0       //目标侧握手信号（handshake signal）
#define DMA_MUX_DSTHSSIG_Msk        (0x03 << DMA_MUX_DSTHSSIG_Pos)
#define DMA_MUX_DSTHSEN_Pos         2       //目标侧握手使能（handshake enable）
#define DMA_MUX_DSTHSEN_Msk         (0x01 << DMA_MUX_DSTHSEN_Pos)
#define DMA_MUX_SRCHSSIG_Pos        8       //源侧握手信号
#define DMA_MUX_SRCHSSIG_Msk        (0x03 << DMA_MUX_SRCHSSIG_Pos)
#define DMA_MUX_SRCHSEN_Pos         10      //源侧握手使能
#define DMA_MUX_SRCHSEN_Msk         (0x01 << DMA_MUX_SRCHSEN_Pos)
#define DMA_MUX_EXTHSSIG_Pos        16      //外部握手信号，0 TIMR0   1 TIMR1   2 TIMR2   3 TIMR3   4 TIMR4   5 DMA_TRIG0   6 DMA_TRIG1
#define DMA_MUX_EXTHSSIG_Msk        (0x07 << DMA_MUX_EXTHSSIG_Pos)
#define DMA_MUX_EXTHSEN_Pos         19      //外部握手使能，0 软件置位CR.RXEN/TXEN启动传输   1 EXTHSSRC选中的触发源启动传输
#define DMA_MUX_EXTHSEN_Msk         (0x01 << DMA_MUX_EXTHSEN_Pos)

#define DMA_DSTSR_LEN_Pos           0       //剩余传输量
#define DMA_DSTSR_LEN_Msk           (0xFFFFF<<DMA_DSTSR_LEN_Pos)
#define DMA_DSTSR_ERR_Pos           31      //长度配置错误
#define DMA_DSTSR_ERR_Msk           (0x01u<< DMA_DSTSR_ERR_Pos)

#define DMA_SRCSR_LEN_Pos           0
#define DMA_SRCSR_LEN_Msk           (0xFFFFF<<DMA_SRCSR_LEN_Pos)
#define DMA_SRCSR_ERR_Pos           31
#define DMA_SRCSR_ERR_Msk           (0x01u<< DMA_SRCSR_ERR_Pos)




typedef struct {
    __IO uint32_t CR;                       //Control Register

    __O  uint32_t CMD;                      //Command Register

    __I  uint32_t SR;                       //Status Register

    __IO uint32_t IF;                       //Interrupt Flag，读取清零

    __IO uint32_t IE;                       //Interrupt Enable

    __IO uint32_t BT2;

    __IO uint32_t BT0;                      //Bit Time Register 0

    __IO uint32_t BT1;                      //Bit Time Register 1

         uint32_t RESERVED;

    __IO uint32_t AFM;                      //Acceptance Filter Mode

    __IO uint32_t AFE;                      //Acceptance Filter Enable

    __I  uint32_t ALC;                      //Arbitration Lost Capture, 仲裁丢失捕捉

    __I  uint32_t ECC;                      //Error code capture, 错误代码捕捉

    __IO uint32_t EWLIM;                    //Error Warning Limit, 错误报警限制

    __IO uint32_t RXERR;                    //RX错误计数

    __IO uint32_t TXERR;                    //TX错误计数

    struct {
        __IO uint32_t INFO;                 //读访问接收Buffer，写访问发送Buffer

