RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
        __IO uint32_t DATA[12];
    } FRAME;

    __I  uint32_t RMCNT;                    //Receive Message Count

         uint32_t RESERVED2[162];

    __IO uint32_t ACR[16];                  //Acceptance Check Register, 验收寄存器

         uint32_t RESERVED3[16];

    __IO uint32_t AMR[16];                  //Acceptance Mask Register, 验收屏蔽寄存器；对应位写0，ID必须和验收寄存器匹配
} CAN_TypeDef;


#define CAN_CR_RST_Pos              0
#define CAN_CR_RST_Msk              (0x01 << CAN_CR_RST_Pos)
#define CAN_CR_LOM_Pos              1       //Listen Only Mode
#define CAN_CR_LOM_Msk              (0x01 << CAN_CR_LOM_Pos)
#define CAN_CR_STM_Pos              2       //Self Test Mode, 此模式下即使没有应答，CAN控制器也可以成功发送
#define CAN_CR_STM_Msk              (0x01 << CAN_CR_STM_Pos)
#define CAN_CR_SLEEP_Pos            4       //写1进入睡眠模式，有总线活动或中断时唤醒并自动清零此位
#define CAN_CR_SLEEP_Msk            (0x01 << CAN_CR_SLEEP_Pos)

#define CAN_CMD_TXREQ_Pos           0       //Transmission Request
#define CAN_CMD_TXREQ_Msk           (0x01 << CAN_CMD_TXREQ_Pos)
#define CAN_CMD_ABTTX_Pos           1       //Abort Transmission
#define CAN_CMD_ABTTX_Msk           (0x01 << CAN_CMD_ABTTX_Pos)
#define CAN_CMD_RRB_Pos             2       //Release Receive Buffer
#define CAN_CMD_RRB_Msk             (0x01 << CAN_CMD_RRB_Pos)
#define CAN_CMD_CLROV_Pos           3       //Clear Data Overrun
#define CAN_CMD_CLROV_Msk           (0x01 << CAN_CMD_CLROV_Pos)
#define CAN_CMD_SRR_Pos             4       //Self Reception Request
#define CAN_CMD_SRR_Msk             (0x01 << CAN_CMD_SRR_Pos)

#define CAN_SR_RXDA_Pos             0       //Receive Data Available，接收FIFO中有完整消息可以读取
#define CAN_SR_RXDA_Msk             (0x01 << CAN_SR_RXDA_Pos)
#define CAN_SR_RXOV_Pos             1       //Receive FIFO Overrun，新接收的信息由于接收FIFO已满而丢掉
#define CAN_SR_RXOV_Msk             (0x01 << CAN_SR_RXOV_Pos)
#define CAN_SR_TXBR_Pos             2       //Transmit Buffer Release，0 正在处理前面的发送，现在不能写新的消息    1 可以写入新的消息发送
#define CAN_SR_TXBR_Msk             (0x01 << CAN_SR_TXBR_Pos)
#define CAN_SR_TXOK_Pos             3       //Transmit OK，successfully completed
#define CAN_SR_TXOK_Msk             (0x01 << CAN_SR_TXOK_Pos)
#define CAN_SR_RXBUSY_Pos           4       //Receive Busy，正在接收
#define CAN_SR_RXBUSY_Msk           (0x01 << CAN_SR_RXBUSY_Pos)
#define CAN_SR_TXBUSY_Pos           5       //Transmit Busy，正在发送
#define CAN_SR_TXBUSY_Msk           (0x01 << CAN_SR_TXBUSY_Pos)
#define CAN_SR_ERRWARN_Pos          6       //1 至少一个错误计数器达到 Warning Limit
#define CAN_SR_ERRWARN_Msk          (0x01 << CAN_SR_ERRWARN_Pos)
#define CAN_SR_BUSOFF_Pos           7       //1 CAN 控制器处于总线关闭状态，没有参与到总线活动
#define CAN_SR_BUSOFF_Msk           (0x01 << CAN_SR_BUSOFF_Pos)

#define CAN_IF_RXDA_Pos             0       //IF.RXDA = SR.RXDA & IE.RXDA
#define CAN_IF_RXDA_Msk             (0x01 << CAN_IF_RXDA_Pos)
#define CAN_IF_TXBR_Pos             1       //当IE.TXBR=1时，SR.TXBR由0变成1将置位此位
#define CAN_IF_TXBR_Msk             (0x01 << CAN_IF_TXBR_Pos)
#define CAN_IF_ERRWARN_Pos          2       //当IE.ERRWARN=1时，SR.ERRWARN或SR.BUSOFF 0-to-1 或 1-to-0将置位此位
#define CAN_IF_ERRWARN_Msk          (0x01 << CAN_IF_ERRWARN_Pos)
#define CAN_IF_RXOV_Pos             3       //IF.RXOV = SR.RXOV & IE.RXOV
#define CAN_IF_RXOV_Msk             (0x01 << CAN_IF_RXOV_Pos)
#define CAN_IF_WKUP_Pos             4       //当IE.WKUP=1时，在睡眠模式下的CAN控制器检测到总线活动时硬件置位
#define CAN_IF_WKUP_Msk             (0x01 << CAN_IF_WKUP_Pos)
#define CAN_IF_ERRPASS_Pos          5       //
#define CAN_IF_ERRPASS_Msk          (0x01 << CAN_IF_ERRPASS_Pos)
#define CAN_IF_ARBLOST_Pos          6       //Arbitration Lost，当IE.ARBLOST=1时，CAN控制器丢失仲裁变成接收方时硬件置位
#define CAN_IF_ARBLOST_Msk          (0x01 << CAN_IF_ARBLOST_Pos)
#define CAN_IF_BUSERR_Pos           7       //当IE.BUSERR=1时，CAN控制器检测到总线错误时硬件置位
#define CAN_IF_BUSERR_Msk           (0x01 << CAN_IF_BUSERR_Pos)

#define CAN_IE_RXDA_Pos             0
#define CAN_IE_RXDA_Msk             (0x01 << CAN_IE_RXDA_Pos)
#define CAN_IE_TXBR_Pos             1
#define CAN_IE_TXBR_Msk             (0x01 << CAN_IE_TXBR_Pos)
#define CAN_IE_ERRWARN_Pos          2
#define CAN_IE_ERRWARN_Msk          (0x01 << CAN_IE_ERRWARN_Pos)
#define CAN_IE_RXOV_Pos             3
#define CAN_IE_RXOV_Msk             (0x01 << CAN_IE_RXOV_Pos)
#define CAN_IE_WKUP_Pos             4
#define CAN_IE_WKUP_Msk             (0x01 << CAN_IE_WKUP_Pos)
#define CAN_IE_ERRPASS_Pos          5
#define CAN_IE_ERRPASS_Msk          (0x01 << CAN_IE_ERRPASS_Pos)
#define CAN_IE_ARBLOST_Pos          6
#define CAN_IE_ARBLOST_Msk          (0x01 << CAN_IE_ARBLOST_Pos)
#define CAN_IE_BUSERR_Pos           7
#define CAN_IE_BUSERR_Msk           (0x01 << CAN_IE_BUSERR_Pos)

#define CAN_BT2_BRP_Pos             0
#define CAN_BT2_BRP_Msk             (0x0F << CAN_BT2_BRP_Pos)

#define CAN_BT0_BRP_Pos             0       //Baud Rate Prescaler，CAN时间单位=2*Tsysclk*((BT2.BRP<<6) + BT0.BRP + 1)
#define CAN_BT0_BRP_Msk             (0x3F << CAN_BT0_BRP_Pos)
#define CAN_BT0_SJW_Pos             6       //Synchronization Jump Width
#define CAN_BT0_SJW_Msk             (0x03 << CAN_BT0_SJW_Pos)

#define CAN_BT1_TSEG1_Pos           0       //t_tseg1 = CAN时间单位 * (TSEG1+1)
#define CAN_BT1_TSEG1_Msk           (0x0F << CAN_BT1_TSEG1_Pos)
#define CAN_BT1_TSEG2_Pos           4       //t_tseg2 = CAN时间单位 * (TSEG2+1)
#define CAN_BT1_TSEG2_Msk           (0x07 << CAN_BT1_TSEG2_Pos)
#define CAN_BT1_SAM_Pos             7       //采样次数  0: sampled once  1: sampled three times
#define CAN_BT1_SAM_Msk             (0x01 << CAN_BT1_SAM_Pos)

#define CAN_ECC_SEGCODE_Pos         0       //Segment Code
#define CAN_ECC_SEGCODE_Msk         (0x1F << CAN_ECC_SEGCODE_Pos)
#define CAN_ECC_DIR_Pos             5       //0 error occurred during transmission   1 during reception
#define CAN_ECC_DIR_Msk             (0x01 << CAN_ECC_DIR_Pos)
#define CAN_ECC_ERRCODE_Pos         6       //Error Code：0 Bit error   1 Form error   2 Stuff error   3 other error
#define CAN_ECC_ERRCODE_Msk         (0x03 << CAN_ECC_ERRCODE_Pos)

#define CAN_INFO_DLC_Pos            0       //Data Length Control
#define CAN_INFO_DLC_Msk            (0x0F << CAN_INFO_DLC_Pos)
#define CAN_INFO_RTR_Pos            6       //Remote Frame，1 远程帧    0 数据帧
#define CAN_INFO_RTR_Msk            (0x01 << CAN_INFO_RTR_Pos)
#define CAN_INFO_FF_Pos             7       //Frame Format，0 标准帧格式    1 扩展帧格式
#define CAN_INFO_FF_Msk             (0x01 << CAN_INFO_FF_Pos)




