RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define SDIO_IM_CMDDONE_Pos         0
#define SDIO_IM_CMDDONE_Msk         (0x01 << SDIO_IM_CMDDONE_Pos)
#define SDIO_IM_TRXDONE_Pos         1
#define SDIO_IM_TRXDONE_Msk         (0x01 << SDIO_IM_TRXDONE_Pos)
#define SDIO_IM_BLKGAP_Pos          2
#define SDIO_IM_BLKGAP_Msk          (0x01 << SDIO_IM_BLKGAP_Pos)
#define SDIO_IM_DMADONE_Pos         3
#define SDIO_IM_DMADONE_Msk         (0x01 << SDIO_IM_DMADONE_Pos)
#define SDIO_IM_BUFWRRDY_Pos        4
#define SDIO_IM_BUFWRRDY_Msk        (0x01 << SDIO_IM_BUFWRRDY_Pos)
#define SDIO_IM_BUFRDRDY_Pos        5
#define SDIO_IM_BUFRDRDY_Msk        (0x01 << SDIO_IM_BUFRDRDY_Pos)
#define SDIO_IM_CARDINSR_Pos        6
#define SDIO_IM_CARDINSR_Msk        (0x01 << SDIO_IM_CARDINSR_Pos)
#define SDIO_IM_CARDRMOV_Pos        7
#define SDIO_IM_CARDRMOV_Msk        (0x01 << SDIO_IM_CARDRMOV_Pos)
#define SDIO_IM_CARD_Pos            8
#define SDIO_IM_CARD_Msk            (0x01 << SDIO_IM_CARD_Pos)
#define SDIO_IM_CMDTIMEOUT_Pos      16
#define SDIO_IM_CMDTIMEOUT_Msk      (0x01 << SDIO_IM_CMDTIMEOUT_Pos)
#define SDIO_IM_CMDCRCERR_Pos       17
#define SDIO_IM_CMDCRCERR_Msk       (0x01 << SDIO_IM_CMDCRCERR_Pos)
#define SDIO_IM_CMDENDERR_Pos       18
#define SDIO_IM_CMDENDERR_Msk       (0x01 << SDIO_IM_CMDENDCERR_Pos)
#define SDIO_IM_CMDIDXERR_Pos       19
#define SDIO_IM_CMDIDXERR_Msk       (0x01 << SDIO_IM_CMDIDXCERR_Pos)
#define SDIO_IM_DATTIMEOUT_Pos      20
#define SDIO_IM_DATTIMEOUT_Msk      (0x01 << SDIO_IM_DATTIMEOUT_Pos)
#define SDIO_IM_DATCRCERR_Pos       21
#define SDIO_IM_DATCRCERR_Msk       (0x01 << SDIO_IM_DATCRCERR_Pos)
#define SDIO_IM_DATENDERR_Pos       22
#define SDIO_IM_DATENDERR_Msk       (0x01 << SDIO_IM_DATENDCERR_Pos)
#define SDIO_IM_CURLIMERR_Pos       23
#define SDIO_IM_CURLIMERR_Msk       (0x01 << SDIO_IM_CURLIMERR_Pos)
#define SDIO_IM_CMD12ERR_Pos        24
#define SDIO_IM_CMD12ERR_Msk        (0x01 << SDIO_IM_CMD12ERR_Pos)
#define SDIO_IM_DMAERR_Pos          25
#define SDIO_IM_DMAERR_Msk          (0x01 << SDIO_IM_DMAERR_Pos)
#define SDIO_IM_RESPERR_Pos         28
#define SDIO_IM_RESPERR_Msk         (0x01 << SDIO_IM_RESPERR_Pos)

#define SDIO_CMD12ERR_NE_Pos        0       //Auto CMD12 not Executed
#define SDIO_CMD12ERR_NE_Msk        (0x01 << SDIO_CMD12ERR_NE_Pos)
#define SDIO_CMD12ERR_TO_Pos        1       //Auto CMD12 Timeout Error
#define SDIO_CMD12ERR_TO_Msk        (0x01 << SDIO_CMD12ERR_TO_Pos)
#define SDIO_CMD12ERR_CRC_Pos       2       //Auto CMD12 CRC Error
#define SDIO_CMD12ERR_CRC_Msk       (0x01 << SDIO_CMD12ERR_CRC_Pos)
#define SDIO_CMD12ERR_END_Pos       3       //Auto CMD12 End Bit Error
#define SDIO_CMD12ERR_END_Msk       (0x01 << SDIO_CMD12ERR_END_Pos)
#define SDIO_CMD12ERR_INDEX_Pos     4       //Auto CMD12 Index Error
#define SDIO_CMD12ERR_INDEX_Msk     (0x01 << SDIO_CMD12ERR_INDEX_Pos)




typedef struct {
    __IO uint32_t IF;                       //[0] 数据传输结束时置位，写1清零

    __IO uint32_t IE;

         uint32_t RESERVED;

    __IO uint32_t START;

    __IO uint32_t RESERVED2;

    __IO uint32_t CR;

    __IO uint32_t CRH;

    __IO uint32_t CRV;

         uint32_t RESERVED3;

    __IO uint32_t BGC;                      //Background color

         uint32_t RESERVED4[6];

    struct {
        __IO uint32_t LCR;                  //Layer Control Register

        __IO uint32_t WHP;                  //Window Horizon Position

        __IO uint32_t WVP;                  //Window Vertical Position

        __IO uint32_t ADDR;                 //display data Address

        __IO uint32_t LLEN;                 //display data Line Length

        __IO uint32_t CK;                   //Color Key

             uint32_t RESERVED5[10];
    } L[2];                                 //Layer

         uint32_t RESERVED5[16];

        __IO uint32_t MPUCR;

        __IO uint32_t MPUIR;

        __IO uint32_t MPUDR;

        __IO uint32_t MPUAR;

        __IO uint32_t MPULEN;
} LCD_TypeDef;


#define LCD_START_GO_Pos            1       //写1开始传输数据，数据传输结束后自动清零
#define LCD_START_GO_Msk            (0x01 << LCD_START_GO_Pos)

#define LCD_CR_CLKDIV_Pos           0       //DOTCLK相对于模块时钟的分频比，0表示2分频，1表示3分频 ...
#define LCD_CR_CLKDIV_Msk           (0x3F << LCD_CR_CLKDIV_Pos)
#define LCD_CR_CLKINV_Pos           6       //1 输出DOTCLK反向，用于DOTCLK下降沿采样数据的屏
#define LCD_CR_CLKINV_Msk           (0x01 << LCD_CR_CLKINV_Pos)
#define LCD_CR_CLKALW_Pos           7       //DOTCLK Always，1 DOTCLK一直翻转    0 DOTCLK在空闲时停在1
#define LCD_CR_CLKALW_Msk           (0x01 << LCD_CR_CLKALW_Pos)
#define LCD_CR_BURSTEN_Pos          8       //Burst Enable，0 只进行SINGLE读   1 优先Burst读
#define LCD_CR_BURSTEN_Msk          (0x01 << LCD_CR_BURSTEN_Pos)
#define LCD_CR_AUTORESTA_Pos        13      //Auto Restart，1 刷新完一帧后自动重启刷新
#define LCD_CR_AUTORESTA_Msk        (0x01 << LCD_CR_AUTORESTA_Pos)
#define LCD_CR_IMMRELOAD_Pos        14      //Immediate Reload，立即将层配置寄存器的值加载到层工作寄存器
#define LCD_CR_IMMRELOAD_Msk        (0x01 << LCD_CR_IMMRELOAD_Pos)
#define LCD_CR_VBPRELOAD_Pos        15      //VBP Period Relaod
#define LCD_CR_VBPRELOAD_Msk        (0x01 << LCD_CR_VBPRELOAD_Pos)
#define LCD_CR_FORMAT_Pos           16      //0 RGB565    1 RGB888
#define LCD_CR_FORMAT_Msk           (0x01 << LCD_CR_FORMAT_Pos)
#define LCD_CR_SEREN_Pos            17      //Serial RGB Enable
#define LCD_CR_SEREN_Msk            (0x01 << LCD_CR_SEREN_Pos)
#define LCD_CR_MPUEN_Pos            18      //MPU Interface Enable
#define LCD_CR_MPUEN_Msk            (0x01 << LCD_CR_MPUEN_Pos)
#define LCD_CR_VSYNCINV_Pos         19      //1 VSYNC反相输出
#define LCD_CR_VSYNCINV_Msk         (0x01 << LCD_CR_VSYNCINV_Pos)
#define LCD_CR_HSYNCINV_Pos         20      //1 HSYNC反相输出
#define LCD_CR_HSYNCINV_Msk         (0x01 << LCD_CR_HSYNCINV_Pos)
#define LCD_CR_BURSTLEN_Pos         21      //Burst Length，0 Burst INCR4   1 Burst INCR8   2 Burst INCR16
#define LCD_CR_BURSTLEN_Msk         (0x03 << LCD_CR_BURSTLEN_Pos)

#define LCD_CRH_HSW_Pos             0       //Hsync Width, 输出HSYNC低电平持续多少个DOTCLK周期，0表示1个周期
#define LCD_CRH_HSW_Msk             (0xFF << LCD_CRH_HSW_Pos)
#define LCD_CRH_HBP_Pos             8       //0表示1个DOTCLK周期
#define LCD_CRH_HBP_Msk             (0xFF << LCD_CRH_HBP_Pos)
#define LCD_CRH_PIX_Pos             16      //水平方向的像素个数，0表示1个，最大为1023
#define LCD_CRH_PIX_Msk             (0x3FF<< LCD_CRH_PIX_Pos)
#define LCD_CRH_HFP_Pos             26      //0表示1个DOTCLK周期
#define LCD_CRH_HFP_Msk             (0x3Fu<< LCD_CRH_HFP_Pos)

#define LCD_CRV_VSW_Pos             0       //Vsync Width，输出VSYNC低电平持续多少个行周期，0表示1个周期
#define LCD_CRV_VSW_Msk             (0xFF << LCD_CRV_VSW_Pos)
#define LCD_CRV_VBP_Pos             8       //0表示1个水平行周期
#define LCD_CRV_VBP_Msk             (0xFF << LCD_CRV_VBP_Pos)
#define LCD_CRV_PIX_Pos             16      //垂直方向的像素个数，0表示1个，最大为1023
#define LCD_CRV_PIX_Msk             (0x3FF<< LCD_CRV_PIX_Pos)
#define LCD_CRV_VFP_Pos             26      //0表示1个水平行周期
#define LCD_CRV_VFP_Msk             (0x3Fu<< LCD_CRV_VFP_Pos)

#define LCD_LCR_ALPHA_Pos           0       //Blend时该层的Alpha值
#define LCD_LCR_ALPHA_Msk           (0xFF << LCD_LCR_ALPHA_Pos)
#define LCD_LCR_EN_Pos              8       //Layer Enable
#define LCD_LCR_EN_Msk              (0x01 << LCD_LCR_EN_Pos)
#define LCD_LCR_CKEN_Pos            9       //Layer Color Key Enable
#define LCD_LCR_CKEN_Msk            (0x01 << LCD_LCR_CKEN_Pos)

#define LCD_WHP_STA_Pos             0       //Layer Window 水平起始点
#define LCD_WHP_STA_Msk             (0x3FF<< LCD_WHP_STA_Pos)
#define LCD_WHP_STP_Pos             16      //Layer Window 水平结束点
#define LCD_WHP_STP_Msk             (0x3FF<< LCD_WHP_STP_Pos)

#define LCD_WVP_STA_Pos             0       //Layer Window 竖直起始点
#define LCD_WVP_STA_Msk             (0x3FF<< LCD_WVP_STA_Pos)
#define LCD_WVP_STP_Pos             16      //Layer Window 竖直结束点
#define LCD_WVP_STP_Msk             (0x3FF<< LCD_WVP_STP_Pos)

#define LCD_MPUCR_RCS1_0_Pos        0       //读操作时，CS上升沿到下降沿时间间隔，0  1个时钟中期
#define LCD_MPUCR_RCS1_0_Msk        (0x1F << LCD_MPUCR_RCS1_0_Pos)
#define LCD_MPUCR_RDHOLD_Pos        5       //RD低电平保持时间
#define LCD_MPUCR_RDHOLD_Msk        (0x1F << LCD_MPUCR_RDHOLD_Pos)
#define LCD_MPUCR_WCS1_0_Pos        10      //写操作时，CS上升沿到下降沿时间间隔
#define LCD_MPUCR_WCS1_0_Msk        (0x0F << LCD_MPUCR_WCS1_0_Pos)
#define LCD_MPUCR_WR1CS1_Pos        14      //WR上升沿到CS上升沿延时
#define LCD_MPUCR_WR1CS1_Msk        (0x03 << LCD_MPUCR_WR1CS1_Pos)
#define LCD_MPUCR_WRHOLD_Pos        16      //WR低电平保持时间
#define LCD_MPUCR_WRHOLD_Msk        (0x0F << LCD_MPUCR_WRHOLD_Pos)
#define LCD_MPUCR_CS0WR0_Pos        20      //CS下降沿到WR下降沿延时
#define LCD_MPUCR_CS0WR0_Msk        (0x03 << LCD_MPUCR_CS0WR0_Pos)

#define LCD_MPULEN_VPIX_Pos         0       //行数，0表示1行
#define LCD_MPULEN_VPIX_Msk         (0x3FF<< LCD_MPULEN_VPIX_Pos)
#define LCD_MPULEN_HPIX_Pos         16      //每行像素数，0表示1个像素，只能赋奇数值，保证偶数个像素
#define LCD_MPULEN_HPIX_Msk         (0x3FF<< LCD_MPULEN_HPIX_Pos)




