RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
typedef struct {
    __IO uint32_t IF;

    __IO uint32_t IE;

    __IO uint32_t CR;

         uint32_t RESERVED;

    struct {
        __IO uint32_t MAR;                  //Memory Address Register，word对齐（低两位固定为0）

        __IO uint32_t OR;                   //Offset Register, added at the end of each line to determine the starting address of the next line

        __IO uint32_t PFCCR;                //Pixel Format Converter Control Register

        __IO uint32_t COLOR;
    } L[3];                                 //Layer: 0 Foreground   1 Background   2 Output

    __IO uint32_t NLR;                      //Number of Line Register
} DMA2D_TypeDef;


#define DMA2D_IF_DONE_Pos           1       //传输完成，写1清零
#define DMA2D_IF_DONE_Msk           (0x01 << DMA2D_IF_DONE_Pos)

#define DMA2D_IE_DONE_Pos           1
#define DMA2D_IE_DONE_Msk           (0x01 << DMA2D_IE_DONE_Pos)

#define DMA2D_CR_START_Pos          0       //开始传输
#define DMA2D_CR_START_Msk          (0x01 << DMA2D_CR_START_Pos)
#define DMA2D_CR_MODE_Pos           8       //0 存储器到存储器   1 存储器到存储器并执行PFC   2 存储器到存储器并执行混合   3 寄存器到存储器（仅输出阶段激合）
#define DMA2D_CR_MODE_Msk           (0x03 << DMA2D_CR_MODE_Pos)
#define DMA2D_CR_WAIT_Pos           22      //每传输一块数据（64个字），等待指定个系统周期后再传输下一个块，防止DMA2D占用过多SDRAM带宽，影响LCD读取显示数据
#define DMA2D_CR_WAIT_Msk           (0x3FFu<<DMA2D_CR_WAIT_Pos)

#define DMA2D_PFCCR_CFMT_Pos        0       //Color Format, 0 ARGB8888   1 RGB8888   2 RGB565
#define DMA2D_PFCCR_CFMT_Msk        (0x07 << DMA2D_CFMT_FORMAT_Pos)
#define DMA2D_PFCCR_AINV_Pos        3       //Alpha Invert
#define DMA2D_PFCCR_AINV_Msk        (0x01 << DMA2D_PFCCR_AINV_Pos)
#define DMA2D_PFCCR_RBSWAP_Pos      4       //RB Swap, 0 RGB   1 BGR
#define DMA2D_PFCCR_RBSWAP_Msk      (0x01 << DMA2D_PFCCR_RBSWAP_Pos)
#define DAM2D_PFCCR_AMODE_Pos       8       //Alpha Mode, 0 使用像素点自带Alpha值   1 使用PFCCR.ALPHA值   2 使用像素点自带Alpha值与PFCCR.ALPHA值的乘积
#define DMA2D_PFCCR_AMODE_Msk       (0x03 << DAM2D_PFCCR_AMODE_Pos)
#define DMA2D_PFCCR_ALPHA_Pos       24
#define DMA2D_PFCCR_ALPHA_Msk       (0xFFu<< DMA2D_PFCCR_ALPHA_Pos)

#define DMA2D_NLR_NLINE_Pos         0       //Number of Line
#define DMA2D_NLR_NLINE_Msk         (0xFFFF<<DMA2D_NLR_NLINE_Pos)
#define DMA2D_NLR_NPIXEL_Pos        16      //Number of Pixel per line
#define DMA2D_NLR_NPIXEL_Msk        (0x3FFF<<DMA2D_NLR_NPIXEL_Pos)




typedef struct {
    __IO uint32_t TIM;                      //SDRAM时序配置

    __IO uint32_t CFG;

    __IO uint32_t T64;                      //64ms刷新周期配置

    __IO uint32_t CR;

    __IO uint32_t SR;                       //0 Idle   1 Init   2 Self-refresh   4 Operating   5 Auto-refresh
} SDRAMC_TypeDef;


#define SDRAMC_TIM_TRCD_Pos         0       //Row to column delay, Ie. Activate to Command delay
#define SDRAMC_TIM_TRCD_Msk         (0x03 << SDRAMC_TIM_TRCD_Pos)
#define SDRAMC_TIM_TRFC_Pos         2       //Refresh Cycle
#define SDRAMC_TIM_TRFC_Msk         (0x0F << SDRAMC_TIM_TRFC_Pos)
#define SDRAMC_TIM_TRP_Pos          6       //Row precharge time,  Ie. Precharge to Activate delay
#define SDRAMC_TIM_TRP_Msk          (0x03 << SDRAMC_TIM_TRP_Pos)
#define SDRAMC_TIM_T100US_Pos       8
#define SDRAMC_TIM_T100US_Msk       (0x7FFF<<SDRAMC_TIM_T100US_Pos)

#define SDRAMC_CFG_CLKDIV_Pos       0       //0 SYSCLK/1   1 SYSCLK/2
#define SDRAMC_CFG_CLKDIV_Msk       (0x01 << SDRAMC_CFG_CLKDIV_Pos)
#define SDRAMC_CFG_CASDELAY_Pos     1       //CAS Latency， 0 2    1 3
#define SDRAMC_CFG_CASDELAY_Msk     (0x01 << SDRAMC_CFG_CASDELAY_Pos)
#define SDRAMC_CFG_HIGHFREQ_Pos     2       //SDRAM工作时钟是否大于66MHz
#define SDRAMC_CFG_HIGHFREQ_Msk     (0x01 << SDRAMC_CFG_HIGHFREQ_Pos)
#define SDRAMC_CFG_SIZE_Pos         3       //0 8MB   1 16MB   2 32MB
#define SDRAMC_CFG_SIZE_Msk         (0x03 << SDRAMC_CFG_SIZE_Pos)

#define SDRAMC_CR_ENTERSRF_Pos      0       //Enter Self-refresh
#define SDRAMC_CR_ENTERSRF_Msk      (0x01 << SDRAMC_CR_ENTERSRF_Pos)
#define SDRAMC_CR_PWRON_Pos         1       //置位开始初始化流程，完成初始化自动清零
#define SDRAMC_CR_PWRON_Msk         (0x01 << SDRAMC_CR_PWRON_Pos)




typedef struct {
    __IO uint32_t CMD;

    __IO uint32_t INPUT;                    //CORDIC计算输入数据，计算SIN和COS时，表示待计算的弧度
                                            //计算ARCTAN时，为防止溢出，需要将待计算数处理后再写入INPUT寄存器：
                                            //待计算数 ∈ (0.05, 0.5]时，将待计算数乘以2后写入INPUT
                                            //待计算数 ∈ (0.5, 2]时，   将待计算数直接写入INPUT
                                            //待计算数 > 2时，           将待计算数除以2后写入INPUT

    __IO uint32_t COS;                      //COS计算结果

    __IO uint32_t SIN;                      //SIN计算结果

    __IO uint32_t ARCTAN;                   //ARCTAN计算结果

    __IO uint32_t IF;

    __IO uint32_t IE;

    __IO uint32_t TANH;                     //写启动TANH计算，写完再读，返回计算结果
} CORDIC_TypeDef;


#define CORDIC_CMD_START_Pos        0       //写1启动运算，运算完成后自动清零
#define CORDIC_CMD_START_Msk        (0x01 << CORDIC_CMD_START_Pos)
#define CORDIC_CMD_RANGE_Pos        1       //计算ARCTAN时输入数值的范围 0 (0.05, 0.5]   1 (0.5, 2]   2 >2
#define CORDIC_CMD_RANGE_Msk        (0x03 << CORDIC_CMD_RANGE_Pos)
#define CORDIC_CMD_SINCOS_Pos       3       //1 计算SIN和COS    0 计算ARCTAN
#define CORDIC_CMD_SINCOS_Msk       (0x01 << CORDIC_CMD_SINCOS_Pos)
#define CORDIC_CMD_MULDIV_Pos       4       //0 计算SIN\COS\ARCTAN，具体由SINCOS位决定   2 计算除法   3 计算乘法
#define CORDIC_CMD_MULDIV_Msk       (0x03 << CORDIC_CMD_MULDIV_Pos)

#define CORDIC_INPUT_F_Pos          0       //输入数据小数部分
#define CORDIC_INPUT_F_Msk          (0x3FFF << CORDIC_INPUT_F_Pos)
#define CORDIC_INPUT_I_Pos          14      //输入数据整数部分
#define CORDIC_INPUT_I_Msk          (0x03 << CORDIC_INPUT_I_Pos)
#define CORDIC_INPUT_F2_Pos         16      //输入数据小数部分，乘法中的第二个参数、除法中的被除数，乘法结果存于SIN、除法结果存于ARCTAN
#define CORDIC_INPUT_F2_Msk         (0x3FFF << CORDIC_INPUT_F2_Pos)
#define CORDIC_INPUT_I2_Pos         30      //输入数据整数部分，乘法中的第二个参数、除法中的被除数，乘法结果存于SIN、除法结果存于ARCTAN
#define CORDIC_INPUT_I2_Msk         (0x03u<< CORDIC_INPUT_I2_Pos)

#define CORDIC_COS_F_Pos            0       //COS计算结果的小数部分
#define CORDIC_COS_F_Msk            (0x3FFF << CORDIC_COS_F_Pos)
#define CORDIC_COS_I_Pos            14      //COS计算结果的整数部分
#define CORDIC_COS_I_Msk            (0x03 << CORDIC_COS_I_Pos)
#define CORDIC_COS_DONE_Pos         16      //1 COS计算已完成
#define CORDIC_COS_DONE_Msk         (0x01 << CORDIC_COS_DONE_Pos)

#define CORDIC_SIN_F_Pos            0       //SIN计算结果的小数部分
#define CORDIC_SIN_F_Msk            (0x3FFF << CORDIC_SIN_F_Pos)
#define CORDIC_SIN_I_Pos            14      //SIN计算结果的整数部分
#define CORDIC_SIN_I_Msk            (0x03 << CORDIC_SIN_I_Pos)
#define CORDIC_SIN_DONE_Pos         16      //1 SIN计算已完成
#define CORDIC_SIN_DONE_Msk         (0x01 << CORDIC_SIN_DONE_Pos)

#define CORDIC_ARCTAN_F_Pos         0       //ARCTAN计算结果的小数部分
#define CORDIC_ARCTAN_F_Msk         (0x3FFF << CORDIC_ARCTAN_F_Pos)
#define CORDIC_ARCTAN_I_Pos         14      //ARCTAN计算结果的整数部分
#define CORDIC_ARCTAN_I_Msk         (0x03 << CORDIC_ARCTAN_I_Pos)
#define CORDIC_ARCTAN_DONE_Pos      16      //1 ARCTAN计算已完成
#define CORDIC_ARCTAN_DONE_Msk      (0x01 << CORDIC_ARCTAN_DONE_Pos)

