RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define CORDIC_IF_DONE_Pos          0       //1 计算完成，写1清零
#define CORDIC_IF_DONE_Msk          (0x01 << CORDIC_IF_DONE_Pos)
#define CORDIC_IF_ERR_Pos           1       //1 计算出错，SIN或COS结果不在[0, 1]范围内，或ARCTAN计算结果不在[0, 2]范围内时置位，写1清零
#define CORDIC_IF_ERR_Msk           (0x01 << CORDIC_IF_ERR_Pos)

#define CORDIC_IE_DONE_Pos          0
#define CORDIC_IE_DONE_Msk          (0x01 << CORDIC_IE_DONE_Pos)
#define CORDIC_IE_ERR_Pos           1
#define CORDIC_IE_ERR_Msk           (0x01 << CORDIC_IE_ERR_Pos)

#define CORDIC_TANH_F_Pos           0       //TANH输入和计算结果的小数部分
#define CORDIC_TANH_F_Msk           (0x3FFF << CORDIC_TANH_F_Pos)
#define CORDIC_TANH_I_Pos           14      //TANH输入和计算结果的整数部分
#define CORDIC_TANH_I_Msk           (0x03 << CORDIC_TANH_I_Pos)




typedef struct {
    __IO uint32_t CR;

    __IO uint32_t SR;

         uint32_t RESERVED[2];

    __IO uint32_t DIVIDEND;                 //被除数

    __IO uint32_t DIVISOR;                  //除数

    __IO uint32_t QUO;                      //商

    __IO uint32_t REMAIN;                   //余数

    __IO uint32_t RADICAND;                 //被开方数

    __IO uint32_t ROOT;                     //平方根，低16位为小数部分，高16位为整数部分
} DIV_TypeDef;


#define DIV_CR_DIVGO_Pos            0       //写1启动除法运算，运算完成后自动清零
#define DIV_CR_DIVGO_Msk            (0x01 << DIV_CR_DIVGO_Pos)
#define DIV_CR_DIVSIGN_Pos          1       //0 有符号除法    1 无符号除法
#define DIV_CR_DIVSIGN_Msk          (0x01 << DIV_CR_DIVSIGN_Pos)
#define DIV_CR_ROOTGO_Pos           8       //写1启动开平方根运算，运算完成后自动清零
#define DIV_CR_ROOTGO_Msk           (0x01 << DIV_CR_ROOTGO_Pos)
#define DIV_CR_ROOTMOD_Pos          9       //开平方根模式：0 结果为整数    1 结果既有整数部分又有小数部分
#define DIV_CR_ROOTMOD_Msk          (0x01 << DIV_CR_ROOTMOD_Pos)

#define DIV_SR_DIVEND_Pos           0       //除法运算完成标志，写1清零
#define DIV_SR_DIVEND_Msk           (0x01 << DIV_SR_DIVEND_Pos)
#define DIV_SR_DIVBUSY_Pos          1       //1 除法运算计算中
#define DIV_SR_DIVBUSY_Msk          (0x01 << DIV_SR_DIVBUSY_Pos)
#define DIV_SR_ROOTENDI_Pos         8       //开方整数运算完成标志，写1清零
#define DIV_SR_ROOTENDI_Msk         (0x01 << DIV_SR_ROOTENDI_Pos)
#define DIV_SR_ROOTENDF_Pos         9       //开方小数运算完成标志，写1清零
#define DIV_SR_ROOTENDF_Msk         (0x01 << DIV_SR_ROOTENDF_Pos)
#define DIV_SR_ROOTBUSY_Pos         10      //1 开方运算计算中
#define DIV_SR_ROOTBUSY_Msk         (0x01 << DIV_SR_ROOTBUSY_Pos)




typedef struct {
    __IO uint32_t DATA;

    __IO uint32_t ADDR;

    __IO uint32_t FMC_ERASE;

    __IO uint32_t CACHE;

    __IO uint32_t CFG0;

    __IO uint32_t CFG1;

    __IO uint32_t CFG2;

    __IO uint32_t CFG3;

    __IO uint32_t CFG4;

    __IO uint32_t STAT;
} FMC_TypeDef;


#define FMC_ERASE_ADDR_Pos          0       //4K每页
#define FMC_ERASE_ADDR_Msk          (0x7FFFF << FMC_ERASE_ADDR_Pos)
#define FMC_ERASE_REQ_Pos           27
#define FMC_ERASE_REQ_Msk           (0x1Fu<< FMC_ERASE_REQ_Pos)

#define FMC_CACHE_PROGEN_Pos        0       //Flash Program Enable
#define FMC_CACHE_PROGEN_Msk        (0x01 << FMC_CACHE_PROGEN_Pos)
#define FMC_CACHE_CEN_Pos           16      //Cache Enable
#define FMC_CACHE_CEN_Msk           (0x01 << FMC_CACHE_CEN_Pos)
#define FMC_CACHE_CPEN_Pos          17      //Cache Predict Enable
#define FMC_CACHE_CPEN_Msk          (0x01 << FMC_CACHE_CPEN_Pos)
#define FMC_CACHE_CCLR_Pos          18      //Cache Clear，自动清零
#define FMC_CACHE_CCLR_Msk          (0x01 << FMC_CACHE_CCLR_Pos)

#define FMC_STAT_ERASEBUSY_Pos      0
#define FMC_STAT_ERASEBUSY_Msk      (0x01 << FMC_STAT_ERASEBUSY_Pos)
#define FMC_STAT_PROGBUSY_Pos       1
#define FMC_STAT_PROGBUSY_Msk       (0x01 << FMC_STAT_PROGBUSY_Pos)
#define FMC_STAT_READBUSY_Pos       2
#define FMC_STAT_READBUSY_Msk       (0x01 << FMC_STAT_READBUSY_Pos)
#define FMC_STAT_FIFOEMPTY_Pos      3       //Write FIFO Empty
#define FMC_STAT_FIFOEMPTY_Msk      (0x01 << FMC_STAT_FIFOEMPTY_Pos)
#define FMC_STAT_FIFOFULL_Pos       4       //Write FIFO Full
#define FMC_STAT_FIFOFULL_Msk       (0x01 << FMC_STAT_FIFOFULL_Pos)
#define FMC_STAT_IDLE_Pos           31
#define FMC_STAT_IDLE_Msk           (0x01u<< FMC_STAT_IDLE_Pos)




typedef struct {
    __IO uint32_t CFG;
    __IO uint32_t TIM;
    __I  uint32_t SR;
    __IO uint32_t IF;
    __IO uint32_t IE;
    __IO uint32_t GO;                       //写1开始执行
    __IO uint32_t ADDR;
    __IO uint32_t DATA;
    __IO uint32_t CMDAHB;                   //通过AHB总线读写Flash时使用的命令码
    __IO uint32_t CMD;                      //通过寄存器 读写Flash时使用的命令码
} SFC_TypeDef;                              //Serial Flash Controller


#define SFC_CFG_CMDTYPE_Pos         0       //0 无地址、无数据、无WIP，用于写使能、写禁止
                                            //1 无地址、有数据（读1字节）、无WIP，用于读状态寄存器高8位、读状态寄存器低8位
                                            //2 无地址、有数据（读3字节）、无WIP，用于读Identification
                                            //3 有地址、有数据（读2字节）、无WIP，用于读MID、读DID
                                            //4 无地址、无数据、有WIP
                                            //5 无地址、无数据、有WIP（自动写使能），用于片擦
                                            //6 无地址、有数据（写2字节）、有WIP（自动写使能），用于写16位状态寄存器
                                            //7 有地址、无数据、有WIP（自动写使能），用于扇区擦
#define SFC_CFG_CMDTYPE_Msk         (0x0F << SFC_CFG_CMDTYPE_Pos)
#define SFC_CFG_CMDWREN_Pos         5       //SFC->CMD寄存器写使能，使能后可将命令码写入CMD寄存器
#define SFC_CFG_CMDWREN_Msk         (0x01 << SFC_CFG_CMDWREN_Pos)
#define SFC_CFG_CLKDIV_Pos          6       //时钟分频：0 1分频   1 2分频   2 4分频   3 8分频
#define SFC_CFG_CLKDIV_Msk          (0x03 << SFC_CFG_CLKDIV_Pos)
#define SFC_CFG_ADDR4L_Pos          8       //编程操作的地址阶段使用4条数据线
#define SFC_CFG_ADDR4L_Msk          (0x01 << SFC_CFG_ADDR4L_Pos)
#define SFC_CFG_DATA4L_PP_Pos       9       //编程操作的数据阶段使用4条数据线
#define SFC_CFG_DATA4L_PP_Msk       (0x01 << SFC_CFG_DATA4L_PP_Pos)
#define SFC_CFG_DATA4L_RD_Pos       10      //读取操作的地址阶段和数据阶段使用：0 1条数据线   1 2条数据线   2 4条数据线
#define SFC_CFG_DATA4L_RD_Msk       (0x03 << SFC_CFG_DATA4L_RD_Pos)
#define SFC_CFG_WREN_Pos            12      //Flash写使能
#define SFC_CFG_WREN_Msk            (0x01 << SFC_CFG_WREN_Pos)

#define SFC_TIM_WIP_CHK_ITV_Pos     0       //硬件自动查询WIP时间间隔
#define SFC_TIM_WIP_CHK_ITV_Msk     (0xFF << SFC_TIM_WIP_CHK_ITV_Pos)
#define SFC_TIM_WIP_CHK_LMT_Pos     8       //硬件自动查询WIP次数限值
#define SFC_TIM_WIP_CHK_LMT_Msk     (0xFF << SFC_TIM_WIP_CHK_LMT_Pos)
#define SFC_TIM_IDLETO_Pos          16      //空闲超时，超时后释放CS
#define SFC_TIM_IDLETO_Msk          (0x3F << SFC_TIM_IDLETO_Pos)
#define SFC_TIM_CSHIGH_Pos          22      //CS拉高时间：0 1个SCLK时钟周期   1 2个   2 3个   3 4个
#define SFC_TIM_CSHIGH_Msk          (0x03 << SFC_TIM_CSHIGH_Pos)

#define SFC_SR_BUSY_Pos             0
#define SFC_SR_BUSY_Msk             (0x01 << SFC_SR_BUSY_Pos)
#define SFC_SR_FIFOLVL_Pos          24      //FIFO Level
#define SFC_SR_FIFOLVL_Msk          (0x07 << SFC_SR_FIFOLVL_Pos)
#define SFC_SR_FIFOEMPTY_Pos        27      //FIFO Empty
#define SFC_SR_FIFOEMPTY_Msk        (0x01 << SFC_SR_FIFOEMPTY_Pos)
#define SFC_SR_FIFOHFULL_Pos        28      //FIFO Half Full
#define SFC_SR_FIFOHFULL_Msk        (0x01 << SFC_SR_FIFOHFULL_Pos)
#define SFC_SR_FIFOFULL_Pos         29      //FIFO Full
#define SFC_SR_FIFOFULL_Msk         (0x01 << SFC_SR_FIFOFULL_Pos)
#define SFC_SR_FIFOOVF_Pos          30      //FIFO Overflow
#define SFC_SR_FIFOOVF_Msk          (0x01 << SFC_SR_FIFOOVF_Pos)
#define SFC_SR_FIFOUVF_Pos          31      //FIFO Underflow
#define SFC_SR_FIFOUVF_Msk          (0x01u<< SFC_SR_FIFOUVF_Pos)

#define SFC_IF_OVER_Pos             0       //操作结束，写1清零
#define SFC_IF_OVER_Msk             (0x01 << SFC_IF_OVER_Pos)
#define SFC_IF_ERR_Pos              1       //Error
#define SFC_IF_ERR_Msk              (0x01 << SFC_IF_ERR_Pos)
#define SFC_IF_TO_Pos               2       //Timeout
#define SFC_IF_TO_Msk               (0x01 << SFC_IF_TO_Pos)
#define SFC_IF_FIFOEMPTY_Pos        27
#define SFC_IF_FIFOEMPTY_Msk        (0x01 << SFC_IF_FIFOEMPTY_Pos)
#define SFC_IF_FIFOHFULL_Pos        28
#define SFC_IF_FIFOHFULL_Msk        (0x01 << SFC_IF_FIFOHFULL_Pos)
#define SFC_IF_FIFOFULL_Pos         29
#define SFC_IF_FIFOFULL_Msk         (0x01 << SFC_IF_FIFOFULL_Pos)
#define SFC_IF_FIFOOVF_Pos          30
#define SFC_IF_FIFOOVF_Msk          (0x01 << SFC_IF_FIFOOVF_Pos)
#define SFC_IF_FIFOUVF_Pos          31
#define SFC_IF_FIFOUVF_Msk          (0x01u<< SFC_IF_FIFOUVF_Pos)

#define SFC_IE_OVER_Pos             0       //操作结束
#define SFC_IE_OVER_Msk             (0x01 << SFC_IE_OVER_Pos)
#define SFC_IE_ERR_Pos              1
#define SFC_IE_ERR_Msk              (0x01 << SFC_IE_ERR_Pos)
#define SFC_IE_TO_Pos               2       //Timeout
#define SFC_IE_TO_Msk               (0x01 << SFC_IE_TO_Pos)
#define SFC_IE_FIFOEMPTY_Pos        27
#define SFC_IE_FIFOEMPTY_Msk        (0x01 << SFC_IE_FIFOEMPTY_Pos)
#define SFC_IE_FIFOHFULL_Pos        28
#define SFC_IE_FIFOHFULL_Msk        (0x01 << SFC_IE_FIFOHFULL_Pos)
#define SFC_IE_FIFOFULL_Pos         29
#define SFC_IE_FIFOFULL_Msk         (0x01 << SFC_IE_FIFOFULL_Pos)
#define SFC_IE_FIFOOVF_Pos          30
#define SFC_IE_FIFOOVF_Msk          (0x01 << SFC_IE_FIFOOVF_Pos)
#define SFC_IE_FIFOUVF_Pos          31
#define SFC_IE_FIFOUVF_Msk          (0x01u<< SFC_IE_FIFOUVF_Pos)

#define SFC_CMDAHB_WREN_Pos         0       //Flash命令码：写使能
#define SFC_CMDAHB_WREN_Msk         (0xFF << SFC_CMDAHB_WREN_Pos)
#define SFC_CMDAHB_PP_Pos           8       //Flash命令码：页编程
#define SFC_CMDAHB_PP_Msk           (0xFF << SFC_CMDAHB_PP_Pos)
#define SFC_CMDAHB_RDSRL_Pos        16      //Flash命令码：读STATUS REG低8位
#define SFC_CMDAHB_RDSRL_Msk        (0xFF << SFC_CMDAHB_RDSRL_Pos)
#define SFC_CMDAHB_READ_Pos         24      //Flash命令码：读数据
#define SFC_CMDAHB_READ_Msk         (0xFFu<< SFC_CMDAHB_READ_Pos)




