RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
typedef struct {
    __IO uint32_t CR;

    __I  uint32_t SR;

    __O  uint32_t SWTRG;                    //Software trigger

    __IO uint32_t DHR;
} DAC_TypeDef;


#define DAC_CR_EN_Pos               0
#define DAC_CR_EN_Msk               (0x01 << DAC_CR_EN_Pos)
#define DAC_CR_DMAEN_Pos            3
#define DAC_CR_DMAEN_Msk            (0x01 << DAC_CR_DMAEN_Pos)
#define DAC_CR_DHRFMT_Pos           9       //DHR Format, 0 12位数据，DHR[11:0] => DOR[11:0]   1 12位数据，DHR[15:4] => DOR[11:0]   3 8位数据，DHR[7 :0] => DOR[11:4]
#define DAC_CR_DHRFMT_Msk           (0x03 << DAC_CR_DHRFMT_Pos)

#define DAC_SR_DHRFULL_Pos          0       //0 DHR not Full, can write now
#define DAC_SR_DHRFULL_Msk          (0x01 << DAC_SR_DHRFULL_Pos)




typedef struct {
    __IO uint32_t CR;

    __O  uint32_t DATAIN;

    __IO uint32_t INIVAL;                   //CR.EN写1时，INIVAL中的值写入RESULT

    __I  uint32_t RESULT;
} CRC_TypeDef;


#define CRC_CR_EN_Pos               0
#define CRC_CR_EN_Msk               (0x01 << CRC_CR_EN_Pos)
#define CRC_CR_IREV_Pos             1       //输入数据是否翻转，0 bit顺序不变    1 bit顺序完全翻转   2 bit顺序字节内翻转   3 仅字节顺序翻转
#define CRC_CR_IREV_Msk             (0x03 << CRC_CR_IREV_Pos)
#define CRC_CR_INOT_Pos             3       //输入数据是否取反
#define CRC_CR_INOT_Msk             (0x01 << CRC_CR_INOT_Pos)
#define CRC_CR_OREV_Pos             4       //输出结果是否翻转，0 bit顺序不变    1 bit顺序完全翻转   2 bit顺序字节内翻转   3 仅字节顺序翻转
#define CRC_CR_OREV_Msk             (0x03 << CRC_CR_OREV_Pos)
#define CRC_CR_ONOT_Pos             6       //输出结果是否取反
#define CRC_CR_ONOT_Msk             (0x01 << CRC_CR_ONOT_Pos)
#define CRC_CR_POLY_Pos             7       //多项式选择，0 x^16+x^12+x^5+1   1 x^8+x^2+x+1   2 x^16+x^15+x^2+1   3 x^32+x^26+x^23+x^22+x^16+x^12+x^11+x^10+x^8+x^7+x^5+x^4+x^2+x+1
#define CRC_CR_POLY_Msk             (0x03 << CRC_CR_POLY_Pos)
#define CRC_CR_IBIT_Pos             9       //输入数据有效位数 0 32位    1 16位    2 8位
#define CRC_CR_IBIT_Msk             (0x03 << CRC_CR_IBIT_Pos)




typedef struct {
    __IO uint32_t MINSEC;                   //分秒计数

    __IO uint32_t DATHUR;                   //日时计数

    __IO uint32_t MONDAY;                   //月周计数

    __IO uint32_t YEAR;                     //[11:0] 年计数，支持1901-2199

    __IO uint32_t MINSECAL;                 //分秒闹铃设置

    __IO uint32_t DAYHURAL;                 //周时闹铃设置

    __IO uint32_t LOAD;                     //将设置寄存器中的值同步到RTC中，同步完成自动清零

    __IO uint32_t IE;

    __IO uint32_t IF;                       //写1清零

    __IO uint32_t EN;                       //[0] 1 RTC使能

    __IO uint32_t CFGABLE;                  //[0] 1 RTC可配置

    __IO uint32_t TRIM;                     //时钟调整

    __IO uint32_t TRIMM;                    //时钟微调整
} RTC_TypeDef;


#define RTC_LOAD_TIME_Pos           0
#define RTC_LOAD_TIME_Msk           (0x01 << RTC_LOAD_TIME_Pos)
#define RTC_LOAD_ALARM_Pos          1
#define RTC_LOAD_ALARM_Msk          (0x01 << RTC_LOAD_ALARM_Pos)

#define RTC_MINSEC_SEC_Pos          0       //秒计数，取值0--59
#define RTC_MINSEC_SEC_Msk          (0x3F << RTC_MINSEC_SEC_Pos)
#define RTC_MINSEC_MIN_Pos          6       //分钟计数，取值0--59
#define RTC_MINSEC_MIN_Msk          (0x3F << RTC_MINSEC_MIN_Pos)

#define RTC_DATHUR_HOUR_Pos         0       //小时计数，取值0--23
#define RTC_DATHUR_HOUR_Msk         (0x1F << RTC_DATHUR_HOUR_Pos)
#define RTC_DATHUR_DATE_Pos         5       //date of month，取值1--31
#define RTC_DATHUR_DATE_Msk         (0x1F << RTC_DATHUR_DATE_Pos)

#define RTC_MONDAY_DAY_Pos          0       //day of week，取值0--6
#define RTC_MONDAY_DAY_Msk          (0x07 << RTC_MONDAY_DAY_Pos)
#define RTC_MONDAY_MON_Pos          3       //月份计数，取值1--12
#define RTC_MONDAY_MON_Msk          (0x0F << RTC_MONDAY_MON_Pos)

#define RTC_MINSECAL_SEC_Pos        0       //闹钟秒设置
#define RTC_MINSECAL_SEC_Msk        (0x3F << RTC_MINSECAL_SEC_Pos)
#define RTC_MINSECAL_MIN_Pos        6       //闹钟分钟设置
#define RTC_MINSECAL_MIN_Msk        (0x3F << RTC_MINSECAL_MIN_Pos)

#define RTC_DAYHURAL_HOUR_Pos       0       //闹钟小时设置
#define RTC_DAYHURAL_HOUR_Msk       (0x1F << RTC_DAYHURAL_HOUR_Pos)
#define RTC_DAYHURAL_SUN_Pos        5       //周日闹钟有效
#define RTC_DAYHURAL_SUN_Msk        (0x01 << RTC_DAYHURAL_SUN_Pos)
#define RTC_DAYHURAL_MON_Pos        6       //周一闹钟有效
#define RTC_DAYHURAL_MON_Msk        (0x01 << RTC_DAYHURAL_MON_Pos)
#define RTC_DAYHURAL_TUE_Pos        7       //周二闹钟有效
#define RTC_DAYHURAL_TUE_Msk        (0x01 << RTC_DAYHURAL_TUE_Pos)
#define RTC_DAYHURAL_WED_Pos        8       //周三闹钟有效
#define RTC_DAYHURAL_WED_Msk        (0x01 << RTC_DAYHURAL_WED_Pos)
#define RTC_DAYHURAL_THU_Pos        9       //周四闹钟有效
#define RTC_DAYHURAL_THU_Msk        (0x01 << RTC_DAYHURAL_THU_Pos)
#define RTC_DAYHURAL_FRI_Pos        10      //周五闹钟有效
#define RTC_DAYHURAL_FRI_Msk        (0x01 << RTC_DAYHURAL_FRI_Pos)
#define RTC_DAYHURAL_SAT_Pos        11      //周六闹钟有效
#define RTC_DAYHURAL_SAT_Msk        (0x01 << RTC_DAYHURAL_SAT_Pos)

#define RTC_IE_SEC_Pos              0       //秒中断使能
#define RTC_IE_SEC_Msk              (0x01 << RTC_IE_SEC_Pos)
#define RTC_IE_MIN_Pos              1
#define RTC_IE_MIN_Msk              (0x01 << RTC_IE_MIN_Pos)
#define RTC_IE_HOUR_Pos             2
#define RTC_IE_HOUR_Msk             (0x01 << RTC_IE_HOUR_Pos)
#define RTC_IE_DATE_Pos             3
#define RTC_IE_DATE_Msk             (0x01 << RTC_IE_DATE_Pos)
#define RTC_IE_ALARM_Pos            4
#define RTC_IE_ALARM_Msk            (0x01 << RTC_IE_ALARM_Pos)
#define RTC_IE_TRIM_Pos             5       //校准完成中断使能
#define RTC_IE_TRIM_Msk             (0x01 << RTC_IE_TRIM_Pos)
#define RTC_IE_HSEC_Pos             6       //半秒中断使能
#define RTC_IE_HSEC_Msk             (0x01 << RTC_IE_HSEC_Pos)
#define RTC_IE_QSEC_Pos             7       //四分之一秒中断使能
#define RTC_IE_QSEC_Msk             (0x01 << RTC_IE_QSEC_Pos)

#define RTC_IF_SEC_Pos              0       //写1清零
#define RTC_IF_SEC_Msk              (0x01 << RTC_IF_SEC_Pos)
#define RTC_IF_MIN_Pos              1
#define RTC_IF_MIN_Msk              (0x01 << RTC_IF_MIN_Pos)
#define RTC_IF_HOUR_Pos             2
#define RTC_IF_HOUR_Msk             (0x01 << RTC_IF_HOUR_Pos)
#define RTC_IF_DATE_Pos             3
#define RTC_IF_DATE_Msk             (0x01 << RTC_IF_DATE_Pos)
#define RTC_IF_ALARM_Pos            4
#define RTC_IF_ALARM_Msk            (0x01 << RTC_IF_ALARM_Pos)
#define RTC_IF_TRIM_Pos             5
#define RTC_IF_TRIM_Msk             (0x01 << RTC_IF_TRIM_Pos)
#define RTC_IF_HSEC_Pos             6
#define RTC_IF_HSEC_Msk             (0x01 << RTC_IF_HSEC_Pos)
#define RTC_IF_QSEC_Pos             7
#define RTC_IF_QSEC_Msk             (0x01 << RTC_IF_QSEC_Pos)

#define RTC_TRIM_ADJ_Pos            0       //用于调整BASECNT的计数周期，默认为32768，如果DEC为1，则计数周期调整为32768-ADJ，否则调整为32768+ADJ
#define RTC_TRIM_ADJ_Msk            (0xFF << RTC_TRIM_ADJ_Pos)
#define RTC_TRIM_DEC_Pos            8
#define RTC_TRIM_DEC_Msk            (0x01 << RTC_TRIM_DEC_Pos)

#define RTC_TRIMM_CYCLE_Pos         0       //用于计数周期微调，如果INC为1，则第n个计数周期调整为(32768±ADJ)+1,否则调整为(32768±ADJ)-1
                                            //cycles=0时，不进行微调整；cycles=1，则n为2；cycles=7，则n为8；以此类推
#define RTC_TRIMM_CYCLE_Msk         (0x07 << RTC_TRIMM_CYCLE_Pos)
#define RTC_TRIMM_INC_Pos           3
#define RTC_TRIMM_INC_Msk           (0x01 << RTC_TRIMM_INC_Pos)




