RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
typedef struct {
    __IO uint32_t RSTVAL;                   //计数器计数到此值时产生复位

    __IO uint32_t INTVAL;                   //计数器计数到此值时产生中断

    __IO uint32_t CR;

    __IO uint32_t IF;                       //[0] 中断标志，写1清零

    __IO uint32_t FEED;                     //写0x55喂狗
} WDT_TypeDef;


#define WDT_CR_EN_Pos               0
#define WDT_CR_EN_Msk               (0x01 << WDT_CR_EN_Pos)
#define WDT_CR_RSTEN_Pos            1
#define WDT_CR_RSTEN_Msk            (0x01 << WDT_CR_RSTEN_Pos)
#define WDT_CR_INTEN_Pos            2
#define WDT_CR_INTEN_Msk            (0x01 << WDT_CR_INTEN_Pos)
#define WDT_CR_WINEN_Pos            3       // 窗口功能使能
#define WDT_CR_WINEN_Msk            (0x01 << WDT_CR_WINEN_Pos)
#define WDT_CR_CKDIV_Pos            8       // 时钟预分频，0 2分频   1 4分频   2 8分频 ...
#define WDT_CR_CKDIV_Msk            (0x0F << WDT_CR_CKDIV_Pos)




typedef struct {
    __IO uint32_t TXBUF[16][0x100];         //0x4000, 16KB

    __IO uint32_t RXBUF[0x100];             //0x4400，17KB

    struct {
        __IO uint32_t TXCR;                 //Tx Control

        __IO uint32_t TXSR;                 //Tx Status

             uint32_t RESERVED;

        __IO uint32_t TXTRSZ;               //Tx Transfer Size，以字节为单位
    } INEP[16];

    struct {
        __IO uint32_t RXCR;                 //Rx Control

             uint32_t RESERVED[3];
    } OUTEP[16];                            //0x4600

    __IO uint32_t DEVCR;                    //Device Control

    __I  uint32_t DEVSR;                    //Device Status

    __IO uint32_t DEVIF;                    //Device Interrupt Flag

    __IO uint32_t DEVIE;                    //Device Interrupt Enable

         uint32_t RESERVED;

    __IO uint32_t EPIE;                     //Endpoint Interrupt Enable

    __IO uint32_t FFTHR;                    //FIFO Threshold

    __IO uint32_t RXSR;                     //Rx Status

    __IO uint32_t SETUPSR;                  //Setup Status

    __IO uint32_t EPIF;                     //Endpoint Interrupt Flag

    __IO uint32_t FRAMENR;                  //Frame Number

         uint32_t RESERVED1[(0x4700-0x4628)/4-1];

    __IO uint32_t SETUPD1;

    __IO uint32_t SETUPD2;

         uint32_t RESERVED2[(0x4804-0x4704)/4-1];

    __IO uint32_t EPCFG[16];
} USBD_TypeDef;


#define USBD_TXCR_SNDSTALL_Pos      0       //Send Stall
#define USBD_TXCR_SNDSTALL_Msk      (0x01 << USBD_TXCR_SNDSTALL_Pos)
#define USBD_TXCR_FLUSHFF_Pos       2       //Flush FIFO
#define USBD_TXCR_FLUSHFF_Msk       (0x01 << USBD_TXCR_FLUSHFF_Pos)
#define USBD_TXCR_FFRDY_Pos         3       //FIFO Ready
#define USBD_TXCR_FFRDY_Msk         (0x01 << USBD_TXCR_FFRDY_Pos)

#define USBD_TXSR_SUCC_Pos          0       //Success
#define USBD_TXSR_SUCC_Msk          (0x01 << USBD_TXSR_SUCC_Pos)
#define USBD_TXSR_DATSNT_Pos        1       //Data Sent
#define USBD_TXSR_DATSNT_Msk        (0x01 << USBD_TXSR_DATSNT_Pos)
#define USBD_TXSR_NAKSNT_Pos        3       //NAK Sent
#define USBD_TXSR_NAKSNT_Msk        (0x01 << USBD_TXSR_NAKSNT_Pos)

#define USBD_RXCR_SNDSTALL_Pos      0       //Send Stall
#define USBD_RXCR_SNDSTALL_Msk      (0x01 << USBD_RXCR_SNDSTALL_Pos)
#define USBD_RXCR_FLUSHFF_Pos       2       //Flush FIFO
#define USBD_RXCR_FLUSHFF_Msk       (0x01 << USBD_RXCR_FLUSHFF_Pos)
#define USBD_RXCR_FFRDY_Pos         3       //FIFO Ready
#define USBD_RXCR_FFRDY_Msk         (0x01 << USBD_RXCR_FFRDY_Pos)

#define USBD_DEVCR_SPEED_Pos        0       //2 LS   3 FS
#define USBD_DEVCR_SPEED_Msk        (0x03 << USBD_DEVCR_SPEED_Pos)
#define USBD_DEVCR_REMOTEWKUP_Pos   2
#define USBD_DEVCR_REMOTEWKUP_Msk   (0x01 << USBD_DEVCR_REMOTEWKUP_Pos)
#define USBD_DEVCR_SELFPWRD_Pos     3       //Self Powered
#define USBD_DEVCR_SELFPWRD_Msk     (0x01 << USBD_DEVCR_SELFPWRD_Pos)
#define USBD_DEVCR_SYNCFRAME_Pos    4       //Sync Frame Command Support
#define USBD_DEVCR_SYNCFRAME_Msk    (0x01 << USBD_DEVCR_SYNCFRAME_Pos)
#define USBD_DEVCR_CSRDONE_Pos      6       //CSR Configured Done
#define USBD_DEVCR_CSRDONE_Msk      (0x01 << USBD_DEVCR_CSRDONE_Pos)
#define USBD_DEVCR_SETDESC_Pos      7       //Set Descriptor Command Support
#define USBD_DEVCR_SETDESC_Msk      (0x01 << USBD_DEVCR_SETDESC_Pos)
#define USBD_DEVCR_DEVICE_Pos       8       //1 Device   0 Host
#define USBD_DEVCR_DEVICE_Msk       (0x01 << USBD_DEVCR_DEVICE_Pos)

#define USBD_DEVSR_CFG_Pos          0       //value set by Set Configuration command
#define USBD_DEVSR_CFG_Msk          (0x0F << USBD_DEVSR_CFG_Pos)
#define USBD_DEVSR_INTF_Pos         4       //value set by Set Interface command
#define USBD_DEVSR_INTF_Msk         (0x0F << USBD_DEVSR_INTF_Pos)
#define USBD_DEVSR_ALT_Pos          8       //value set by Set Alternate command
#define USBD_DEVSR_ALT_Msk          (0x0F << USBD_DEVSR_ALT_Pos)
#define USBD_DEVSR_SUSP_Pos         12      //set when Suspend condition detected on the USB
#define USBD_DEVSR_SUSP_Msk         (0x01 << USBD_DEVSR_SUSP_Pos)
#define USBD_DEVSR_FRNR_Pos         21      //Frame Number of received SOF
#define USBD_DEVSR_FRNR_Msk         (0x7FF<< USBD_DEVSR_FRNR_Pos)

#define USBD_DEVIF_SETCFG_Pos       0       //Set when receive Set Configuration command，写1清零
#define USBD_DEVIF_SETCFG_Msk       (0x01 << USBD_DEVIF_SETCFG_Pos)
#define USBD_DEVIF_SETINTF_Pos      1       //Set when receive Set Interface command
#define USBD_DEVIF_SETINTF_Msk      (0x01 << USBD_DEVIF_SETINTF_Pos)
#define USBD_DEVIF_RST_Pos          3       //Set when Reset detected on the USB
#define USBD_DEVIF_RST_Msk          (0x01 << USBD_DEVIF_RST_Pos)
#define USBD_DEVIF_SUSP_Pos         4       //Set when Suspend detected on the USB
#define USBD_DEVIF_SUSP_Msk         (0x01 << USBD_DEVIF_SUSP_Pos)
#define USBD_DEVIF_SOF_Pos          5       //Set when SOF received
#define USBD_DEVIF_SOF_Msk          (0x01 << USBD_DEVIF_SOF_Pos)
#define USBD_DEVIF_SETUP_Pos        6       //Set when Setup received
#define USBD_DEVIF_SETUP_Msk        (0x01 << USBD_DEVIF_SETUP_Pos)
#define USBD_DEVIF_OUT_Pos          7       //Set when OUT received
#define USBD_DEVIF_OUT_Msk          (0x01 << USBD_DEVIF_OUT_Pos)

#define USBD_DEVIE_SETCFG_Pos       0
#define USBD_DEVIE_SETCFG_Msk       (0x01 << USBD_DEVIE_SETCFG_Pos)
#define USBD_DEVIE_SETINTF_Pos      1
#define USBD_DEVIE_SETINTF_Msk      (0x01 << USBD_DEVIE_SETINTF_Pos)
#define USBD_DEVIE_RST_Pos          3
#define USBD_DEVIE_RST_Msk          (0x01 << USBD_DEVIE_RST_Pos)
#define USBD_DEVIE_SUSP_Pos         4
#define USBD_DEVIE_SUSP_Msk         (0x01 << USBD_DEVIE_SUSP_Pos)
#define USBD_DEVIE_SOF_Pos          5
#define USBD_DEVIE_SOF_Msk          (0x01 << USBD_DEVIE_SOF_Pos)
#define USBD_DEVIE_SETUP_Pos        6
#define USBD_DEVIE_SETUP_Msk        (0x01 << USBD_DEVIE_SETUP_Pos)
#define USBD_DEVIE_OUT_Pos          7
#define USBD_DEVIE_OUT_Msk          (0x01 << USBD_DEVIE_OUT_Pos)

#define USBD_EPIE_INEP0_Pos         0
#define USBD_EPIE_INEP0_Msk         (0x01 << USBD_EPIE_INEP0_Pos)
#define USBD_EPIE_INEP1_Pos         1
#define USBD_EPIE_INEP1_Msk         (0x01 << USBD_EPIE_INEP1_Pos)
#define USBD_EPIE_INEP2_Pos         2
#define USBD_EPIE_INEP2_Msk         (0x01 << USBD_EPIE_INEP2_Pos)
#define USBD_EPIE_INEP3_Pos         3
#define USBD_EPIE_INEP3_Msk         (0x01 << USBD_EPIE_INEP3_Pos)
#define USBD_EPIE_INEP4_Pos         4
#define USBD_EPIE_INEP4_Msk         (0x01 << USBD_EPIE_INEP4_Pos)
#define USBD_EPIE_INEP5_Pos         5
#define USBD_EPIE_INEP5_Msk         (0x01 << USBD_EPIE_INEP5_Pos)
#define USBD_EPIE_INEP6_Pos         6
#define USBD_EPIE_INEP6_Msk         (0x01 << USBD_EPIE_INEP6_Pos)
#define USBD_EPIE_INEP7_Pos         7
#define USBD_EPIE_INEP7_Msk         (0x01 << USBD_EPIE_INEP7_Pos)
#define USBD_EPIE_OUTEP0_Pos        16
#define USBD_EPIE_OUTEP0_Msk        (0x01 << USBD_EPIE_OUTEP0_Pos)
#define USBD_EPIE_OUTEP1_Pos        17
#define USBD_EPIE_OUTEP1_Msk        (0x01 << USBD_EPIE_OUTEP1_Pos)
#define USBD_EPIE_OUTEP2_Pos        18
#define USBD_EPIE_OUTEP2_Msk        (0x01 << USBD_EPIE_OUTEP2_Pos)
#define USBD_EPIE_OUTEP3_Pos        19
#define USBD_EPIE_OUTEP3_Msk        (0x01 << USBD_EPIE_OUTEP3_Pos)
#define USBD_EPIE_OUTEP4_Pos        20
#define USBD_EPIE_OUTEP4_Msk        (0x01 << USBD_EPIE_OUTEP4_Pos)
#define USBD_EPIE_OUTEP5_Pos        21
#define USBD_EPIE_OUTEP5_Msk        (0x01 << USBD_EPIE_OUTEP5_Pos)
#define USBD_EPIE_OUTEP6_Pos        22
#define USBD_EPIE_OUTEP6_Msk        (0x01 << USBD_EPIE_OUTEP6_Pos)
#define USBD_EPIE_OUTEP7_Pos        23
#define USBD_EPIE_OUTEP7_Msk        (0x01 << USBD_EPIE_OUTEP7_Pos)

#define USBD_RXSR_SUCC_Pos          0       //Success
#define USBD_RXSR_SUCC_Msk          (0x01 << USBD_RXSR_SUCC_Pos)
#define USBD_RXSR_DONE_Pos          1       //1 Transfer completed
#define USBD_RXSR_DONE_Msk          (0x01 << USBD_RXSR_DONE_Pos)
#define USBD_RXSR_EPNR_Pos          16      //Endpoint Number
#define USBD_RXSR_EPNR_Msk          (0x0F << USBD_RXSR_EPNR_Pos)
#define USBD_RXSR_TRSZ_Pos          22      //Transfer Size in byte
#define USBD_RXSR_TRSZ_Msk          (0x3FFu<<USBD_RXSR_TRSZ_Pos)

#define USBD_SETUPSR_SUCC_Pos       0       //Success
#define USBD_SETUPSR_SUCC_Msk       (0x01 << USBD_SETUPSR_SUCC_Pos)
#define USBD_SETUPSR_DONE_Pos       1       //1 Transfer completed
#define USBD_SETUPSR_DONE_Msk       (0x01 << USBD_SETUPSR_DONE_Pos)
#define USBD_SETUPSR_EPNR_Pos       16
#define USBD_SETUPSR_EPNR_Msk       (0x0F << USBD_SETUPSR_EPNR_Pos)

#define USBD_EPIF_INEP0_Pos         0       //data sent or NAK sent
#define USBD_EPIF_INEP0_Msk         (0x01 << USBD_EPIF_INEP0_Pos)
#define USBD_EPIF_INEP1_Pos         1
#define USBD_EPIF_INEP1_Msk         (0x01 << USBD_EPIF_INEP1_Pos)
#define USBD_EPIF_INEP2_Pos         2
#define USBD_EPIF_INEP2_Msk         (0x01 << USBD_EPIF_INEP2_Pos)
#define USBD_EPIF_INEP3_Pos         3
#define USBD_EPIF_INEP3_Msk         (0x01 << USBD_EPIF_INEP3_Pos)
#define USBD_EPIF_INEP4_Pos         4
#define USBD_EPIF_INEP4_Msk         (0x01 << USBD_EPIF_INEP4_Pos)
#define USBD_EPIF_INEP5_Pos         5
#define USBD_EPIF_INEP5_Msk         (0x01 << USBD_EPIF_INEP5_Pos)
#define USBD_EPIF_INEP6_Pos         6
#define USBD_EPIF_INEP6_Msk         (0x01 << USBD_EPIF_INEP6_Pos)
#define USBD_EPIF_INEP7_Pos         7
#define USBD_EPIF_INEP7_Msk         (0x01 << USBD_EPIF_INEP7_Pos)
#define USBD_EPIF_OUTEP0_Pos        16      //data available
#define USBD_EPIF_OUTEP0_Msk        (0x01 << USBD_EPIF_OUTEP0_Pos)
#define USBD_EPIF_OUTEP1_Pos        17
#define USBD_EPIF_OUTEP1_Msk        (0x01 << USBD_EPIF_OUTEP1_Pos)
#define USBD_EPIF_OUTEP2_Pos        18
#define USBD_EPIF_OUTEP2_Msk        (0x01 << USBD_EPIF_OUTEP2_Pos)
#define USBD_EPIF_OUTEP3_Pos        19
#define USBD_EPIF_OUTEP3_Msk        (0x01 << USBD_EPIF_OUTEP3_Pos)
#define USBD_EPIF_OUTEP4_Pos        20
#define USBD_EPIF_OUTEP4_Msk        (0x01 << USBD_EPIF_OUTEP4_Pos)
#define USBD_EPIF_OUTEP5_Pos        21
#define USBD_EPIF_OUTEP5_Msk        (0x01 << USBD_EPIF_OUTEP5_Pos)
#define USBD_EPIF_OUTEP6_Pos        22
#define USBD_EPIF_OUTEP6_Msk        (0x01 << USBD_EPIF_OUTEP6_Pos)
#define USBD_EPIF_OUTEP7_Pos        23
#define USBD_EPIF_OUTEP7_Msk        (0x01 << USBD_EPIF_OUTEP7_Pos)

