RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define USBH_TOKEN_ADDR_Pos         0
#define USBH_TOKEN_ADDR_Msk         (0x7F << USBH_TOKEN_ADDR_Pos)
#define USBH_TOKEN_EPNR_Pos         7       //Endport Number
#define USBH_TOKEN_EPNR_Msk         (0x0F << USBH_TOKEN_EPNR_Pos)
#define USBH_TOKEN_DATAX_Pos        11      //0 DATA0   1 DATA1
#define USBH_TOKEN_DATAX_Msk        (0x01 << USBH_TOKEN_DATAX_Pos)
#define USBH_TOKEN_TYPE_Pos         13      //13 SETUP   1 OUT   9 IN
#define USBH_TOKEN_TYPE_Msk         (0x0F << USBH_TOKEN_TYPE_Pos)
#define USBH_TOKEN_ISO_Pos          17      //1 ISO transfer   0 Non-ISO transfer
#define USBH_TOKEN_ISO_Msk          (0x01 << USBH_TOKEN_ISO_Pos)
#define USBH_TOKEN_SPEED_Pos        18      //2 LS   3 FS
#define USBH_TOKEN_SPEED_Msk        (0x03 << USBH_TOKEN_SPEED_Pos)
#define USBH_TOKEN_TRSZ_Pos         20      //Transfer Size in byte
#define USBH_TOKEN_TRSZ_Msk         (0x3FF<< USBH_TOKEN_TRSZ_Pos)

#define USBH_OTGCSR_SRSUCC_Pos      0       //Session Request Success
#define USBH_OTGCSR_SRSUCC_Msk      (0x01 << USBH_OTGCSR_SRSUCC_Pos)
#define USBH_OTGCSR_SRSCHG_Pos      1       //Session Request Status Change,  set to 1 on Session Request Success, 写1清零
#define USBH_OTGCSR_SRSCHG_Msk      (0x01 << USBH_OTGCSR_SRSCHG_Pos)
#define USBH_OTGCSR_HNSUCC_Pos      2       //Host Negotiation Success
#define USBH_OTGCSR_HNSUCC_Msk      (0x01 << USBH_OTGCSR_HNSUCC_Pos)
#define USBH_OTGCSR_HNSCHG_Pos      3       //Host Negotiation Status Change, set to 1 on Host Negotiation Success，写1清零
#define USBH_OTGCSR_HNSCHG_Msk      (0x01 << USBH_OTGCSR_HNSCHG_Pos)
#define USBH_OTGCSR_SRDET_Pos       4       //Session Request Detected
#define USBH_OTGCSR_SRDET_Msk       (0x01 << USBH_OTGCSR_SRDET_Pos)
#define USBH_OTGCSR_SRDCHG_Pos      5       //Session Request Detected Change, set to 1 when a Session Request is detected，写1清零
#define USBH_OTGCSR_SRDCHG_Msk      (0x01 << USBH_OTGCSR_SRDCHG_Pos)
#define USBH_OTGCSR_HNDET_Pos       6       //Host Negotiation Detected
#define USBH_OTGCSR_HNDET_Msk       (0x01 << USBH_OTGCSR_HNDET_Pos)
#define USBH_OTGCSR_HNDCHG_Pos      7       //Host Negotiation Detect Change, set to 1 when a Host Negotiation is detected, 写1清零
#define USBH_OTGCSR_HNDCHG_Msk      (0x01 << USBH_OTGCSR_HNDCHG_Pos)
#define USBH_OTGCSR_ID_Pos          8       //Connector ID Status, 0 in A-device mode,   1 in B-device mode
#define USBH_OTGCSR_ID_Msk          (0x01 << USBH_OTGCSR_ID_Pos)
#define USBH_OTGCSR_IDCHG_Pos       9       //set when OTGCSR.ID changed, 写1清零
#define USBH_OTGCSR_IDCHG_Msk       (0x01 << USBH_OTGCSR_IDCHG_Pos)
#define USBH_OTGCSR_MODE_Pos        10      //0 Host mode   1 Device mode
#define USBH_OTGCSR_MODE_Msk        (0x01 << USBH_OTGCSR_MODE_Pos)
#define USBH_OTGCSR_SRPREQ_Pos      16      //SRP Request
#define USBH_OTGCSR_SRPREQ_Msk      (0x01 << USBH_OTGCSR_SRPREQ_Pos)
#define USBH_OTGCSR_HNPREQ_Pos      17      //HNP Request
#define USBH_OTGCSR_HNPREQ_Msk      (0x01 << USBH_OTGCSR_HNPREQ_Pos)
#define USBH_OTGCSR_HHNPENA_Pos     18      //Host HNP Enable, set by app when Set Feature Set HNP Enable is successful on connected device
#define USBH_OTGCSR_HHNPENA_Msk     (0x01 << USBH_OTGCSR_HHNPENA_Pos)
#define USBH_OTGCSR_HNPENA_Pos      19      //set by app when receives Set Feature Set HNP Enable command
#define USBH_OTGCSR_HNPENA_Msk      (0x01 << USBH_OTGCSR_HNPENA_Pos)
#define USBH_OTGCSR_SRPCAP_Pos      20      //SRP Capable
#define USBH_OTGCSR_SRPCAP_Msk      (0x01 << USBH_OTGCSR_SRPCAP_Pos)
#define USBH_OTGCSR_HNPCAP_Pos      21      //HNP Capable
#define USBH_OTGCSR_HNPCAP_Msk      (0x01 << USBH_OTGCSR_HNPCAP_Pos)




typedef struct {
    __IO uint32_t CFG;                      //JPEG DEC configure register

    __IO uint32_t CR;                       //JPEG DEC control register

    __IO uint32_t IR;                       //JPEG DEC interrupt register

    __IO uint32_t SR;                       //JPEG DEC status register

    __IO uint32_t IMGSIZ;                   //JPEG image size

    __IO uint32_t IMGSTR;                   //JPEG image size virtual stride

    __IO uint32_t CSBASE;                   //JPEG code-stream base address

    union {
        __IO uint32_t YBASE;                //YUV image Y base address

        __IO uint32_t RGBASE;               //RGB image base address
    };

    __IO uint32_t UBASE;                    //YUV image U base address

    __IO uint32_t VBASE;                    //YUV image V base address

    __IO uint32_t QTBASE;                   //JPEG quantization table base address

    __IO uint32_t HTBASE;                   //JPEG huffman table base address

    __IO uint32_t CODLEN;                   //JPEG code stream total length in byte

         uint32_t RESERVED[51];

    __O  uint32_t QTABLE[3][16];            //Quantization table

         uint32_t RESERVED2[16];

    struct {
        __O  uint32_t DC_CODEWORD[6];
        __O  uint32_t DC_CODELEN[2];
        __O  uint32_t DC_CODEVAL[2];

        __O  uint32_t AC_CODEWORD[8];
        __O  uint32_t AC_CODEADDR[4];
        __O  uint32_t AC_CODEVAL[41];

             uint32_t RESERVED;
    } HTABLE[2];                            //Huffman table
} JPEG_TypeDef;


#define JPEG_CFG_SRCFMT_Pos         0       //JPEG Source Format, 0 YUV420(H2V2)   1 YUV422(H2V1)   2 YUV444(H1V1)
#define JPEG_CFG_SRCFMT_Msk         (0x03 << JPEG_CFG_SRCFMT_Pos)
#define JPEG_CFG_SCANMOD_Pos        2       //JPEG scan mode, 0 interleaved (three components)   1 non-interleaved (single component)
#define JPEG_CFG_SCANMOD_Msk        (0x01 << JPEG_CFG_SCANMOD_Pos)
#define JPEG_CFG_NISCOMP_Pos        3       //Non-Interleaved Scanning Component, 0 component 1   1 component 2   2 component 3
#define JPEG_CFG_NISCOMP_Msk        (0x03 << JPEG_CFG_NISCOMP_Pos)
#define JPEG_CFG_HT1COMP_Pos        5       //Huffman Table for Component 1, 0 table 0   1 table 1
#define JPEG_CFG_HT1COMP_Msk        (0x01 << JPEG_CFG_HT1COMP_Pos)
#define JPEG_CFG_HT2COMP_Pos        6
#define JPEG_CFG_HT2COMP_Msk        (0x01 << JPEG_CFG_HT2COMP_Pos)
#define JPEG_CFG_HT3COMP_Pos        7
#define JPEG_CFG_HT3COMP_Msk        (0x01 << JPEG_CFG_HT3COMP_Pos)
#define JPEG_CFG_QT1COMP_Pos        8       //Quantization Table for Component 1, 0 table 0   1 table 1   2 table 2
#define JPEG_CFG_QT1COMP_Msk        (0x03 << JPEG_CFG_QT1COMP_Pos)
#define JPEG_CFG_QT2COMP_Pos        10
#define JPEG_CFG_QT2COMP_Msk        (0x03 << JPEG_CFG_QT2COMP_Pos)
#define JPEG_CFG_QT3COMP_Pos        12
#define JPEG_CFG_QT3COMP_Msk        (0x03 << JPEG_CFG_QT3COMP_Pos)
#define JPEG_CFG_OUTFMT_Pos         14      //Image data output format, 0 YUV planar   1 YUV semi-planar   2 XRGB888   3 RGB888   4 RGB565
#define JPEG_CFG_OUTFMT_Msk         (0x07 << JPEG_CFG_OUTFMT_Pos)
#define JPEG_CFG_YUV2RGB_Pos        17      //YUV2RGB translation, 0 Disable   1 Enable
#define JPEG_CFG_YUV2RGB_Msk        (0x01 << JPEG_CFG_YUV2RGB_Pos)
#define JPEG_CFG_UVSWAP_Pos         18      //UV output swap, 0 YUV   1 YVU
#define JPEG_CFG_UVSWAP_Msk         (0x01 << JPEG_CFG_UVSWAP_Pos)
#define JPEG_CFG_RBSWAP_Pos         19      //RB output swap, 0 RGB   1 BGR
#define JPEG_CFG_RBSWAP_Msk         (0x01 << JPEG_CFG_RBSWAP_Pos)
#define JPEG_CFG_EDSWAP_Pos         20      //endian swap, 0 XRGB   1 BGRX
#define JPEG_CFG_EDSWAP_Msk         (0x01 << JPEG_CFG_EDSWAP_Pos)
#define JPEG_CFG_565DITH_Pos        21      //RGB565 dithering, 0 Disable   1 Enable
#define JPEG_CFG_565DITH_Msk        (0x01 << JPEG_CFG_565DITH_Pos)

#define JPEG_CR_START_Pos           0       //JPEG DEC frame start，解码完成自动清零
#define JPEG_CR_START_Msk           (0x01 << JPEG_CR_START_Pos)
#define JPEG_CR_RESTART_Pos         1       //Decoder stream buffering restart
#define JPEG_CR_RESTART_Msk         (0x01 << JPEG_CR_RESTART_Pos)
#define JPEG_CR_RESET_Pos           3       //JPEG DEC core reset，自动清零
#define JPEG_CR_RESET_Msk           (0x01 << JPEG_CR_RESET_Pos)
#define JPEG_CR_REINTRV_Pos         4       //Restart interval marker enable
#define JPEG_CR_REINTRV_Msk         (0x01 << JPEG_CR_REINTRV_Pos)
#define JPEG_CR_LASTBUF_Pos         5       //Decoder last stream buffering
#define JPEG_CR_LASTBUF_Msk         (0x01 << JPEG_CR_LASTBUF_Pos)
#define JPEG_CR_QTAUTO_Pos          7       //JPEG quantization tables auto refresh enable
#define JPEG_CR_QTAUTO_Msk          (0x01 << JPEG_CR_QTAUTO_Pos)
#define JPEG_CR_HTAUTO_Pos          8       //JPEG huffman tables auto refresh enable
#define JPEG_CR_HTAUTO_Msk          (0x01 << JPEG_CR_HTAUTO_Pos)
#define JPEG_CR_QTCNT_Pos           9       //Number of quantization tables
#define JPEG_CR_QTCNT_Msk           (0x03 << JPEG_CR_QTCNT_Pos)
#define JPEG_CR_HTCNT_Pos           11      //Number of huffman tables
#define JPEG_CR_HTCNT_Msk           (0x01 << JPEG_CR_HTCNT_Pos)
#define JPEG_CR_CUCNT_Pos           12      //The number of CU in the restart interval
#define JPEG_CR_CUCNT_Msk           (0xFFFF<<JPEG_CR_CUCNT_Pos)

#define JPEG_IR_IEDONE_Pos          0       //Frame processing finish interrupt enable
#define JPEG_IR_IEDONE_Msk          (0x01 << JPEG_IR_IEDONE_Pos)
#define JPEG_IR_IEEMPTY_Pos         2       //JPEG decoder stream buffering empty interrupt enable
#define JPEG_IR_IEEMPTY_Msk         (0x01 << JPEG_IR_IEEMPTY_Pos)
#define JPEG_IR_IEERROR_Pos         3       //JPEG error interrupt enable
#define JPEG_IR_IEERROR_Msk         (0x01 << JPEG_IR_IEERROR_Pos)
#define JPEG_IR_ICDONE_Pos          5       //Interrupt Clear, write-ongly
#define JPEG_IR_ICDONE_Msk          (0x01 << JPEG_IR_ICDONE_Pos)
#define JPEG_IR_ICEMPTY_Pos         7
#define JPEG_IR_ICEMPTY_Msk         (0x01 << JPEG_IR_ICEMPTY_Pos)
#define JPEG_IR_ICERROR_Pos         8
#define JPEG_IR_ICERROR_Msk         (0x01 << JPEG_IR_ICERROR_Pos)
#define JPEG_IR_IFDONE_Pos          10      //Interrupt Flag, read-only
#define JPEG_IR_IFDONE_Msk          (0x01 << JPEG_IR_IFDONE_Pos)
#define JPEG_IR_IFEMPTY_Pos         12
#define JPEG_IR_IFEMPTY_Msk         (0x01 << JPEG_IR_IFEMPTY_Pos)
#define JPEG_IR_IFERROR_Pos         13
#define JPEG_IR_IFERROR_Msk         (0x01 << JPEG_IR_IFERROR_Pos)

#define JPEG_SR_BUSY_Pos            0
#define JPEG_SR_BUSY_Msk            (0x01 << JPEG_SR_BUSY_Pos)
#define JPEG_SR_CUOVR_Pos           1       //JPEG CU run length overflow error
#define JPEG_SR_CUOVR_Msk           (0x01 << JPEG_SR_CUOVR_Pos)
#define JPEG_SR_REIMERR_Pos         2       //JPEG Restart interval marker error
#define JPEG_SR_REIMERR_Msk         (0x01 << JPEG_SR_REIMERR_Pos)
#define JPEG_SR_BUFBUSY_Pos         4       //JPEG decoder stream buffering status
#define JPEG_SR_BUFBUSY_Msk         (0x01 << JPEG_SR_BUFBUSY_Pos)
#define JPEG_SR_DMARDBUSY_Pos       5
#define JPEG_SR_DMARDBUSY_Msk       (0x01 << JPEG_SR_DMARDBUSY_Pos)
#define JPEG_SR_DMAWRBUSY_Pos       6
#define JPEG_SR_DMAWRBUSY_Msk       (0x01 << JPEG_SR_DMAWRBUSY_Pos)

#define JPEG_IMGSIZ_HPIX_Pos        0       //JPEG image width (minus 1)
#define JPEG_IMGSIZ_HPIX_Msk        (0x3FF<< JPEG_IMGSIZ_HPIX_Pos)
#define JPEG_IMGSIZ_VPIX_Pos        16      //JPEG image height (minus 1)
#define JPEG_IMGSIZ_VPIX_Msk        (0x3FF<< JPEG_IMGSIZ_VPIX_Pos)

#define JPEG_IMGSTR_RGBLINE_Pos     0       //number of words of RGB line width, XRGB888: img_width   RGB888: ceil(img_width*3/4)   RGB565 : ceil(img_width/2)
#define JPEG_IMGSTR_RGBLINE_Msk     (0x7FF<< JPEG_IMGSTR_RGBLINE_Pos)
#define JPEG_IMGSTR_YLINE_Pos       0       //number of words of Y line width, ceil(img_width/4)
#define JPEG_IMGSTR_YLINE_Msk       (0x7FF<< JPEG_IMGSTR_YLINE_Pos)
#define JPEG_IMGSTR_UVLINE_Pos      16      //number of words of UV line width, UV-planer 444: ceil(img_width/4)   UV-planar 420/422: ceil(img_width/8)
                                            //                                  UV-semi planer 444: ceil(img_width/2)   UV-semi planer 420/422: ceil(img_width/4)
#define JPEG_IMGSTR_UVLINE_Msk      (0x7FF<< JPEG_IMGSTR_UVLINE_Pos)




/******************************************************************************/
/*                       Peripheral memory map                            */
/******************************************************************************/
#define RAM_BASE            0x20000000
#define AHB_BASE            0x40000000
#define APB1_BASE           0x40040000
#define APB2_BASE           0x400A0000

#define SFLASH_BASE         0x70000000  //Serial Flash

#define SDRAMM_BASE         0x80000000
#define SDRAMC_BASE         0x88000000



