RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
/* AHB Peripheral memory map */
#define SYS_BASE            (AHB_BASE + 0x00000)

#define DMA_BASE            (AHB_BASE + 0x00800)

#define SDIO_BASE           (AHB_BASE + 0x01800)

#define LCD_BASE            (AHB_BASE + 0x02000)

#define CRC_BASE            (AHB_BASE + 0x02800)

#define CORDIC_BASE         (AHB_BASE + 0x03000)

#define DIV_BASE            (AHB_BASE + 0x03800)

#define GPIOM_BASE          (AHB_BASE + 0x04000)
#define GPION_BASE          (AHB_BASE + 0x04800)

#define USBD_BASE           (AHB_BASE + 0x05000)
#define USBH_BASE           (AHB_BASE + 0x05000)

#define JPEG_BASE           (AHB_BASE + 0x0B000)
#define DMA2D_BASE          (AHB_BASE + 0x0C000)

/* APB Peripheral memory map */
#define GPIOA_BASE          (APB1_BASE + 0x00000)
#define GPIOB_BASE          (APB1_BASE + 0x00800)
#define GPIOC_BASE          (APB1_BASE + 0x01000)
#define GPIOD_BASE          (APB1_BASE + 0x01800)

#define UART0_BASE          (APB1_BASE + 0x02000)
#define UART1_BASE          (APB1_BASE + 0x02800)
#define UART2_BASE          (APB1_BASE + 0x03000)
#define UART3_BASE          (APB1_BASE + 0x03800)

#define SPI0_BASE           (APB1_BASE + 0x04000)
#define SPI1_BASE           (APB1_BASE + 0x04800)

#define PWM0_BASE           (APB1_BASE + 0x06000)
#define PWM1_BASE           (APB1_BASE + 0x06080)
#define PWM2_BASE           (APB1_BASE + 0x06100)
#define PWM3_BASE           (APB1_BASE + 0x06180)
#define PWM4_BASE           (APB1_BASE + 0x06200)
#define PWMG_BASE           (APB1_BASE + 0x06400)

#define TIMR0_BASE          (APB1_BASE + 0x06800)
#define TIMR1_BASE          (APB1_BASE + 0x06840)
#define TIMR2_BASE          (APB1_BASE + 0x06880)
#define TIMR3_BASE          (APB1_BASE + 0x068C0)
#define TIMR4_BASE          (APB1_BASE + 0x06900)
#define TIMRG_BASE          (APB1_BASE + 0x06C00)

#define BTIMR0_BASE         (APB1_BASE + 0x08800)
#define BTIMR1_BASE         (APB1_BASE + 0x08840)
#define BTIMR2_BASE         (APB1_BASE + 0x08880)
#define BTIMR3_BASE         (APB1_BASE + 0x088C0)
#define BTIMR4_BASE         (APB1_BASE + 0x08900)
#define BTIMR5_BASE         (APB1_BASE + 0x08940)
#define BTIMR6_BASE         (APB1_BASE + 0x08980)
#define BTIMR7_BASE         (APB1_BASE + 0x089C0)
#define BTIMR8_BASE         (APB1_BASE + 0x08A00)
#define BTIMR9_BASE         (APB1_BASE + 0x08A40)
#define BTIMR10_BASE        (APB1_BASE + 0x08A80)
#define BTIMR11_BASE        (APB1_BASE + 0x08AC0)
#define BTIMRG_BASE         (APB1_BASE + 0x08C00)

#define ADC0_BASE           (APB1_BASE + 0x09000)
#define ADC1_BASE           (APB1_BASE + 0x09800)

#define FMC_BASE            (APB1_BASE + 0x0A000)   //Flash Memory Controller

#define SFC_BASE            (APB1_BASE + 0x0A800)   //Serial Flash Controller

#define RTC_BASE            (APB1_BASE + 0x0B800)

#define DAC_BASE            (APB1_BASE + 0x0C000)

#define QEI_BASE            (APB1_BASE + 0x0C800)

#define PORTA_BASE          (APB2_BASE + 0x00000)
#define PORTB_BASE          (APB2_BASE + 0x00010)
#define PORTC_BASE          (APB2_BASE + 0x00020)
#define PORTD_BASE          (APB2_BASE + 0x00030)
#define PORTE_BASE          (APB2_BASE + 0x00040)
#define PORTM_BASE          (APB2_BASE + 0x00080)
#define PORTN_BASE          (APB2_BASE + 0x00090)

#define WDT_BASE            (APB2_BASE + 0x00800)

#define GPIOE_BASE          (APB2_BASE + 0x01000)

#define I2C0_BASE           (APB2_BASE + 0x06000)
#define I2C1_BASE           (APB2_BASE + 0x06800)

#define CAN0_BASE           (APB2_BASE + 0x08000)
#define CAN1_BASE           (APB2_BASE + 0x08800)



/******************************************************************************/
/*                       Peripheral declaration                          */
/******************************************************************************/
#define SYS                 ((SYS_TypeDef  *) SYS_BASE)

#define PORTA               ((PORT_TypeDef *) PORTA_BASE)
#define PORTB               ((PORT_TypeDef *) PORTB_BASE)
#define PORTC               ((PORT_TypeDef *) PORTC_BASE)
#define PORTD               ((PORT_TypeDef *) PORTD_BASE)
#define PORTE               ((PORT_TypeDef *) PORTE_BASE)
#define PORTM               ((PORT_TypeDef *) PORTM_BASE)
#define PORTN               ((PORT_TypeDef *) PORTN_BASE)

#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOM               ((GPIO_TypeDef *) GPIOM_BASE)
#define GPION               ((GPIO_TypeDef *) GPION_BASE)

#define TIMR0               ((TIMR_TypeDef *) TIMR0_BASE)
#define TIMR1               ((TIMR_TypeDef *) TIMR1_BASE)
#define TIMR2               ((TIMR_TypeDef *) TIMR2_BASE)
#define TIMR3               ((TIMR_TypeDef *) TIMR3_BASE)
#define TIMR4               ((TIMR_TypeDef *) TIMR4_BASE)
#define TIMRG               ((TIMRG_TypeDef*) TIMRG_BASE)

#define BTIMR0              ((TIMR_TypeDef *) BTIMR0_BASE)
#define BTIMR1              ((TIMR_TypeDef *) BTIMR1_BASE)
#define BTIMR2              ((TIMR_TypeDef *) BTIMR2_BASE)
#define BTIMR3              ((TIMR_TypeDef *) BTIMR3_BASE)
#define BTIMR4              ((TIMR_TypeDef *) BTIMR4_BASE)
#define BTIMR5              ((TIMR_TypeDef *) BTIMR5_BASE)
#define BTIMR6              ((TIMR_TypeDef *) BTIMR6_BASE)
#define BTIMR7              ((TIMR_TypeDef *) BTIMR7_BASE)
#define BTIMR8              ((TIMR_TypeDef *) BTIMR8_BASE)
#define BTIMR9              ((TIMR_TypeDef *) BTIMR9_BASE)
#define BTIMR10             ((TIMR_TypeDef *) BTIMR10_BASE)
#define BTIMR11             ((TIMR_TypeDef *) BTIMR11_BASE)
#define BTIMRG              ((TIMRG_TypeDef*) BTIMRG_BASE)

#define UART0               ((UART_TypeDef *) UART0_BASE)
#define UART1               ((UART_TypeDef *) UART1_BASE)
#define UART2               ((UART_TypeDef *) UART2_BASE)
#define UART3               ((UART_TypeDef *) UART3_BASE)

#define SPI0                ((SPI_TypeDef  *) SPI0_BASE)
#define SPI1                ((SPI_TypeDef  *) SPI1_BASE)

#define I2C0                ((I2C_TypeDef  *) I2C0_BASE)
#define I2C1                ((I2C_TypeDef  *) I2C1_BASE)

#define ADC0                ((ADC_TypeDef  *) ADC0_BASE)
#define ADC1                ((ADC_TypeDef  *) ADC1_BASE)

