RT-Thread/rt-thread/bsp/synwit/swm341/libraries/CMSIS/DeviceSupport/SWM341.h
#define PWM0                ((PWM_TypeDef  *) PWM0_BASE)
#define PWM1                ((PWM_TypeDef  *) PWM1_BASE)
#define PWM2                ((PWM_TypeDef  *) PWM2_BASE)
#define PWM3                ((PWM_TypeDef  *) PWM3_BASE)
#define PWM4                ((PWM_TypeDef  *) PWM4_BASE)
#define PWMG                ((PWMG_TypeDef *) PWMG_BASE)

#define CAN0                ((CAN_TypeDef  *) CAN0_BASE)
#define CAN1                ((CAN_TypeDef  *) CAN1_BASE)

#define USBD                ((USBD_TypeDef *) USBD_BASE)
#define USBH                ((USBH_TypeDef *) USBH_BASE)

#define SDIO                ((SDIO_TypeDef *) SDIO_BASE)

#define SDRAMC              ((SDRAMC_TypeDef*)SDRAMC_BASE)

#define DMA                 ((DMA_TypeDef  *) DMA_BASE)

#define LCD                 ((LCD_TypeDef  *) LCD_BASE)

#define DMA2D               ((DMA2D_TypeDef*) DMA2D_BASE)

#define DAC                 ((DAC_TypeDef  *) DAC_BASE)

#define CRC                 ((CRC_TypeDef  *) CRC_BASE)

#define CORDIC              ((CORDIC_TypeDef*)CORDIC_BASE)

#define DIV                 ((DIV_TypeDef  *) DIV_BASE)

#define RTC                 ((RTC_TypeDef  *) RTC_BASE)

#define WDT                 ((WDT_TypeDef  *) WDT_BASE)

#define QEI                 ((QEI_TypeDef  *) QEI_BASE)

#define FMC                 ((FMC_TypeDef  *) FMC_BASE)

#define SFC                 ((SFC_TypeDef  *) SFC_BASE)

#define JPEG                ((JPEG_TypeDef *) JPEG_BASE)



#include "SWM341_port.h"
#include "SWM341_gpio.h"
#include "SWM341_exti.h"
#include "SWM341_timr.h"
#include "SWM341_uart.h"
#include "SWM341_spi.h"
#include "SWM341_i2c.h"
#include "SWM341_adc.h"
#include "SWM341_pwm.h"
#include "SWM341_dma.h"
#include "SWM341_can.h"
#include "SWM341_sdio.h"
#include "SWM341_sdram.h"
#include "SWM341_flash.h"
#include "SWM341_lcd.h"
#include "SWM341_sfc.h"
#include "SWM341_dac.h"
#include "SWM341_cordic.h"
#include "SWM341_crc.h"
#include "SWM341_div.h"
#include "SWM341_rtc.h"
#include "SWM341_wdt.h"
#include "SWM341_qei.h"
#include "SWM341_usb.h"
#include "SWM341_usbd.h"
#include "SWM341_usbh.h"
#include "SWM341_jpeg.h"
#include "SWM341_dma2d.h"
#include "SWM341_iofilt.h"


#endif //__SWM341_H__
